{"meta":{"title":"Hexo","subtitle":"","description":"xxx","author":"John Doe","url":"http://example.com","root":"/"},"pages":[{"title":"","date":"2024-01-01T18:47:06.160Z","updated":"2024-01-01T18:47:06.160Z","comments":true,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"下面写关于自己的内容"},{"title":"所有分类","date":"2024-01-01T18:47:26.073Z","updated":"2024-01-01T18:47:26.073Z","comments":true,"path":"categories/index.html","permalink":"http://example.com/categories/index.html","excerpt":"","text":""},{"title":"friends","date":"2024-01-01T18:41:02.000Z","updated":"2024-01-01T18:41:02.508Z","comments":true,"path":"friends/index.html","permalink":"http://example.com/friends/index.html","excerpt":"","text":""},{"title":"所有标签","date":"2024-01-01T18:47:38.303Z","updated":"2024-01-01T18:47:38.303Z","comments":true,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Harry Potter","slug":"Harry Potter","date":"2024-10-29T19:00:00.000Z","updated":"2024-10-30T23:52:40.182Z","comments":true,"path":"2024/10/29/Harry Potter/","permalink":"http://example.com/2024/10/29/Harry%20Potter/","excerpt":"","text":"The Boy Who Livedmysterious a 神秘的 hold the view&#x2F;belief&#x2F;opinion that… 表示某人认同某观点 1234567891011121314I hold the view that remote work can increase productivity for some employees.（我认为远程工作可以提高某些员工的生产力。）Many people hold the belief that technology will continue to shape the future of our industry.（许多人认为科技会继续塑造我们行业的未来。）I hold the opinion that teamwork is essential for success in most projects.（我认为团队合作对大多数项目的成功至关重要。）Our team holds the position that open communication leads to better project outcomes.（我们团队认为开放沟通可以带来更好的项目结果。）Some hold a different perspective, but I hold that diversity in ideas leads to innovation.（有些人持不同的观点，但我认为多样化的想法能够带来创新。） beefy a 身材很zhuang三声的人 &#x3D;&#x3D; 可以表示胖，也可以表示强壮 with hardly any neck 几乎没脖子 mustache a 八字胡 crane n 升降机，鹤 v 伸长脖子看 crane over 伸长脖子越过 shudder v 打寒颤 mix with somebody 跟某人鬼混在一起，与HP有来往 12345这里的want后面没用to，直接接了doing，表示某事持续、延续发生、某种状态。They didn&#x27;t want Dudley mixing with a child like that.“want somebody doing something”：表示不希望某人处于某种状态、进行某项活动，带有一种对该状态的抵触或反感。“want somebody to do something”：更中性，通常表示希望某人完成某个具体的动作或任务。 wrestle v.n 摔跤，扭打 这里形容费力地把挣扎的 Dudley 放到他的高脚椅上。 tawny a 茶色的，褐色的 flutter v.n 振翅，拍打翅膀 peck v.n 轻啄 这里说的是轻轻的亲吻一下 tantrum n 发火，闹情绪 1234a sudden period of uncontrolled anger like a young child&#x27;s:Charlie had/threw a tantrum in the shop because I wouldn&#x27;t buy him any sweets.If she doesn&#x27;t get her own way she has temper tantrums. little tyke 臭小子 chortle v &#x3D;&#x3D; laugh backed out of … drive 退出车道 peculiar a unusual and strange, sometimes in an unpleasant way jerk v If you jerk something or someone in a particular direction, or they jerk in a particular direction, they move a short distance very suddenly and quickly. tabby cat 虎斑猫 tabby a 有斑纹的 in sight 视野内 put the cat out of his mind 不想猫的事情了，将猫咪的事情抛到脑后 drive out 驱逐，迫使离开 couldn’t help doing &#x3D;&#x3D; can’t help doing 忍不住做 cloak n 长斗篷 cape n 披风，短斗篷 getups n 装扮，扮相 weirdo n 奇怪的人 drummed v 敲击 drum steering wheel 方向盘 a huddle of 一群人，一大帮子人 close by 在附近 1He drummed his fingers on the steering wheel and his eyes fell on a huddle of these weirdos standing quite close by. enrage v 使激怒 be enraged 被激怒 emerald 翠绿色 The nerve of him! 岂有此理，他真实胆肥了嘿！ stunt n 噱头，作秀 swoop v 猛冲 open-mouthed 目瞪口呆地，惊掉下巴地 owl after owl 这是指一直猫头鹰接着另一只猫头鹰 stretch his legs 伸伸腿 clutch v 抓着 dead adv 突然 Mr. Dursley stopped dead. but thought better of it.但还是打消了这个念头 12He was about to say something, but thought better of it.他本来想说些什么，但还是打消了念头。 snap at 严厉斥责，追着咬 Come to think of it 表示刚想起来 &#x3D;&#x3D; 这么说来，这么一琢磨 no point in doing 没意义做某事 There was no point in worrying Mrs. Dursley grunt v 嘟哝 stumble v 绊倒 violet a.n 紫罗兰，紫罗兰的 squeaky a 吱吱嘎嘎作响的 passersby n 过路人 rejoice v 很高兴 stand rooted to the spot 站在原地不动 rattled a 担忧的 set off 动身，出发，启程 set off for home 动身回家 approve of 赞成，支持 12He didn’t approve of imagination.老姨夫对想象力持否定态度 pull into 驶入 backed out of 倒车倒出 spot 这个词 v 看见，使有斑点 a 有斑点的&#x3D;&#x3D;同spotted stern a 严厉的，不动摇的，严峻的 newscaster n 新闻播报员 over to 切换到，转向到 下面我们把镜头切换到天气预报员 as far apart as 远至。。 downpour of shooting stars 流星雨 bonfire 篝火 wet night 雨夜 whisper n 传闻，谣言 petunia 牵牛花 虽然是姨妈的名字，但是本意是牵牛花 pretend v 假装 这个单词的发音总错 mumble v 含糊的说话 大理石是哪个单词 marble snap v 厉声说 sip v 抿一口 purse v 撅嘴 n 女士钱包 stiffly adv 生硬地，顽固地 I quite agree 表示我完全赞同 crept v 匍匐爬行 creep的过去式 peer v 凝视（这个凝视就是使劲盯着瞪眼看，生怕看不见看不清） n 同辈 as though 就好像，就是像 get out 泄露，走漏；逃脱 drift v 漂流，飘移；不自觉地陷入 still a 静止的 twitch v 抽搐，抽动 narrow v 收缩，变窄 这里说猫猫眯起眼睛 you’d have thought 这个理解为 “你还以为。。。” judging by 从。。来判断 tuck v 塞入 n 衣服褶子 robe n 长袍 bathrobe 浴袍 spectacles n 眼镜；壮观的场面、表演 crooked a 弯曲的，狡诈的 老友记Phoebe用过这个词 rummag v 翻查，搜出 chuckle v 咯咯笑 mutter v 嘟哝，低声说话 flick v 轻弹，轻拂 flicker v 闪烁，摇曳 pinprick n 针刺，针孔，小的东西 beady-eyed 目光锐利的 pavement n 人行道 emerald n 翡翠 a 翠绿色的 ruffle v 弄褶皱 ruffled a 气恼的 sniff v 吸气 impatiently adv 不耐烦地 Flocks of owls 成群的猫头鹰 be bound to 一定会 sense n 理智，良好的判断 irritably adv 性急地 downright a.adv 十足的，彻头彻尾的 in broad daylight 光天化日之下 swapping rumors 交换（散布）谣言 I’m rather fond of 我相当喜欢 sensible a 理智的 flinch v 因恐惧退缩 unstick v 使脱落 get confused&#x2F;confusing 感到混乱&#x2F;使别人感到混乱 exasperate v 使恼怒，恶化，加剧 flatter v 奉承，讨好 blushed a 脸红的 earmuffs n 耳套，护耳 我竟然一直不知道这东西中文名字是什么 shot a sharp look at 这个动词 给了一个锐利的眼神 The owls are nothing next to the rumors 站在谣言身边，猫头鹰不算什么 &#x3D;&#x3D; 猫头鹰相对于谣言根本不值一提 12for neither as a cat nor as a woman had she fixed Dumbledore with such a piercing stare as she did now. 这句话是倒装句 had she fixed... gasp v 倒抽一口凉气 bowed his head 低头也用这个bow reached out and patted her on the shoulder 伸出手拍人的肩膀的表达 tremble v 颤抖 faltered a 蹒跚的，犹豫的 astounding a 令人震惊的 handkerchief n 手帕，丝巾，围巾 dabbed 轻触，轻拍，轻擦 原型 dab sniff 吸，嗅 of all places 偏偏在这个地方 faintly adv 模糊地，虚弱地 rumbling a.n.v 轰隆隆 astride adv 分开双腿胯 bushy a 浓茂的 muscular a 强壮的，肌肉的 tuft 丛，一簇 a bolt of lightning 一道闪电 come in handy 派上用场 get this over with 尽快做完 shaggy a 蓬松的 whiskery 有胡须的 howl 嚎叫 sobbed a 啜泣的 get a grip on yourself 控制自己的行为或情绪 gingerly adv 小心翼翼地 a 谨慎的，轻手轻脚的 ginger n 生姜 tuck v 掖进去，塞进去 bundle n 捆，婴儿 twinkling n 瞬间 a 闪烁的 muffled a 沉闷的，压抑的，听不清的 streaming eyes 泪汪汪的眼镜 rose into &#x3D;&#x3D; rise into 上升，升入 slinking a 鬼鬼祟祟的 swish 鞭打声，啪 prod v.n 戳","categories":[{"name":"English","slug":"English","permalink":"http://example.com/categories/English/"}],"tags":[{"name":"English learning","slug":"English-learning","permalink":"http://example.com/tags/English-learning/"}]},{"title":"","slug":"Friends","date":"2024-10-11T18:39:45.480Z","updated":"2024-10-28T03:06:40.353Z","comments":true,"path":"2024/10/11/Friends/","permalink":"http://example.com/2024/10/11/Friends/","excerpt":"","text":"[TOC] S02E01what’s happened so far. 一直奇怪为什么用’s 原来是has的意思表示目前已经发生的状况 since forever 自古以来，一直都是 get in the way 妨碍 Something kind of got in the way let it slip that 说漏了嘴 enough about me 别管我了 Orient n 东方 baggage claim 领行李处 go for it 大胆争取 cramp n 抽筋 v 阻止 slowpoke n 慢性子 give away 泄露 cab n 出租车 since then 从那以后 crotch n 裤裆 what happened to you? 在你身上发生了什么？ 1What the hell happened to you in China? aside from doing.. 除了 almighty n 全能者 a 全能的 go for it with sb 向某人告白 1I never would have gone for it with her, if it hadn&#x27;t been for you. silver lining 困难中的慰藉 anal a 挑剔的，B事儿多的 spare your feelings 让你好受点，不伤害你的感情 clothes altered 改衣服 resistance n 阻力，阻抗，电阻 fall for v 听信，上当 pathetic a 可怜的 palpable tension 明显的紧张局势 bossy a 喜欢发号施令的 cuff n 袖口 inseam n 裤长，内缝 waiting game 耐性等待 hit rock bottom 跌至谷底 paisan n 老乡，同志 put on a pot of coffee 这里的put on代表烧水 hernia 疝气 scum 烂，渣男 S02E02ladle n 长柄勺 apron n 围裙 abuse his discount 花光他的折扣 I can’t, I have to take my grandmother to the vet. house of worship 宗教的仪式场所，可以简单理解为“神坛，圣坛” escalator n 自动扶梯 full a 表示吃饱了 pod里有这个表达 you bet 理解为好的，没问题，没关系 of course, no problem reaffirm 重申，加强 re-affirm one thing led to another get caught 被抓 Did it ever occur to you 你想过没，意识到没 freak out 火了 sb freak out 某人发火了 freak sb out 某人被吓坏了 appeal to 呼吁，吸引，上诉 1The packaging does appeal to grouwnups and kids. cantaloupe 哈密瓜，美国甜瓜 Howdy 哈哈哈，德州人民打招呼的方式，因为这段Joey也穿的cowboy costume as the Hombre get out of the game &#x3D;&#x3D; quit 退出游戏 sooner or later 迟早 cheddar 芝士奶酪 薯片的芝士口味用这个词 12I say you show him what you&#x27;re made of. 我说那你就让他看看你的本事吧。这个what you&#x27;re made of就像中文的“行，你有种”的感觉 stand your ground 坚守阵地 囧.雪诺让部下成防御阵形 lingerie n 女士内衣 fix you up with 给你安排约会或者提供资源 在剧里是介绍一个hooker，这里从穿着到倒饮料都非常西部 123Because I&#x27;m friends with her doesn&#x27;t make me any less friends with you.这句像bojack的:You not understand you are a horrible person doesn&#x27;t make you less of a horrible person. doofus n 蠢人，笨蛋 intimidate v 威吓，恫吓 paranoid a 多疑的，迫害妄想症的 n 偏执狂 manipulative a 爱操控人的，玩弄人的 S02E03nostril n 鼻孔 flew 飞 fly lean back 向后靠，后仰 insignificant a 微不足道的 1How many perfectly fine woman are you gonna reject over the most superficial insignificant things? side with someone 站在某人一边 表示支持某人 1I gotta side with Chandler on this one Adam’s apple 喉结 mess with me 糊弄我，骗我 1You guys are messing with me, right? stomp v 跺脚 broom n 扫把 faint a 微小的，可能性不大的 go into the light 走到光亮中吧 &#x3D;&#x3D; 现身吧 scoff v.n. 嘲笑，狼吞虎咽地吃 1The process of every living thing on this planet evolving over millions of years from single-celled organisms is &quot;too easy&quot;? I just don’t buy it. 我就是不买账 gravity n 重力 pissed a 生气的 piss本身是小便 hop v 跳 earthly a 人间的，尘世的 possession n 拥有，个人财产 position revenge n 复仇 sully v 玷污，败坏 funky a 时髦的，畏缩的 fossil 化石 grievance n 苦难，不满 excessive a 过度的 tacky a 低劣的，俗气的 opposable thumbs 对生拇指 opposable a 可反对的，可相对的 stand by 看热闹，袖手旁观 obsessive a 着迷的，强迫的 n 强迫症患者 1What is this obsessive need you have to make everybody agree with you? crack me up 逗死我了，让我捧腹大笑 clarinet n 单簧管 dork n 书呆子 knock it off 住口！停止 1Our trains are on the same track. go off 走开 You couldn’t have told me about this on the phone? 你就不能在电话里跟我说一声么？。。。 arrogant a 傲慢的，自负的 caved a 掉进陷阱了，屈服了 magically adv 神奇地，魔法般地 get over this 想开点儿。。 bitch v 挖苦，说坏话 n son of bitch take rists 接受风险 make a commitment 做承诺 hold off 推迟 get hung up on it 沉迷于此，纠结于 1Don’t get hung up on your weight! Actually you look so slim classified n 分类广告 S02E04I can get a message to her. 我可以帮你传话 stop by 顺便拜访 stay in your pajamas for a month 这里表示郁郁寡欢，闷闷不乐 What have I not told you? 我有什么没告诉你 terrace n 阳台 1How about the fact that the underwear out there on the telephoone pole is yours from when you were having sex with Fun Bobby out on the terrace. dead meat 死定了 you are dead meat whip it out 秀出来 as opposed to 相反于，而不是。。。 nubbin n 小瘤子 porno 色情~ flick v 轻弹 magical a 魔法的 virility n 男子气概 hut n 小屋 tri-state area 三个州交界的地区 1Does she put on an outfit on at night and go out and fight crime? hook up with 与某人建立联系 get over it 看开点 玩文明的时候被电脑谴责就会选这个让对方消消气 sassy a 时髦的，漂亮的，粗野的 Ice Capades 泛指滑冰表演 dress up 打扮 you’d dress up for him set yourself up 这个表达暗示着某人做了一些行为或决定，可能会导致不好的后果。因此，它经常被理解为“你自找麻烦” fill me up 给我满上 cut it out 停手吧 technically adv 严格来说 Ross好像挺爱说这个词的 psyched out 精神崩溃，害怕 That just means it’s working. 这就说明见效了 jewelry n 珠宝 一直觉得这个单词发音难 sparkly a 闪闪发光的 spooky a 幽灵般的，阴森可怖的 paleontologist n 古生物学家 filled with two-nippled people 充斥着两个乳头的人 unflattering a 不讨喜的 reach a point where… 到了某个点，到了某种程度 fit in 融入，合群 back in college adv 在大学的时候 experiment v 尝试，试验 I was born in this way 生来如此 一般同性恋才这么说慎用 wiped a 累了 有点表示歇菜了 It could take a while 那要花一点时间 12I got the time to get to know Julie.我有时间。。 in a nutshell 简单来说，总的来说 1I don&#x27;t think either answer would make me feel better. beforehand adv 预先地 pounce v 猛扑，突袭 darn hard 这个darn表示十分地，强烈地 是damn的变形，口语中常见，但是damn更不文明 put it off 推迟 on the right track 在正确的道路上 catch me off guard 出其不意，趁我不备 sweaty a 出汗的，汗流浃背的 Somebody got some last night! 这里的some专指为性爱 例如中文的办事 S02E05aerobics n 有氧运动，健美操 nerve n 勇气 pay off 偿清（债务），发完工资 rekindle v 重燃 seek comfort 寻求安慰 round up 抹零 go through with this 完成某事，坚持到底 save up 存钱 at work 上班 saute v 炒 kidney 肾 conventional a 按照惯例的，传统的 stand someone up 放某人鸽子 on the edge of my seat 形容一个人激动，盼望的坐在椅子上，那种只坐前三分之一的感觉 carpaccio n 意式腌红肉 prawn n 对虾 leeks 大葱 on the side of 123What would that be on the side of?What would that be on the side of the rice?I’ll have a side of fries on the side of my burger. Cajun catfish 鲶鱼 Cajun是路易斯安那的菜 hoopla 狂欢 skit n 小品 dorky out 愚蠢的，傻了吧唧的 blowfish 河豚 enthuse v 热情 Could you be less enthused? 能再不热情一点么？ It’s a nice gesture 一番好意 charity n 慈善，施舍 tiara n 头饰，冠状头饰 It’s not for another six hours 意思是 “还要再等六个小时”。这里的 “not for another” 表示剩余时间，也就是说距离事件发生还有 6 小时。“not for” 则表示当前时刻之前不会发生。 biting her lip 她咬着嘴唇 he was nothing compared to you. 他没法跟你比 bumpy a 颠簸的，崎岖不平的 不知道为什么要用这个词形容。。。 bust v.a 打破，打碎~ hickey n 唇印，吻痕 outreach v 延展 outreach program 可以理解为提供关怀和帮助的项目，在剧里翻译为施舍 page 可以表示传呼机的传呼 hold you back 阻碍你了，拖你后腿了 想表达支持你应该是“Have your back” 或 “Got your back” kickback 回扣 old time’s sake 看在旧交情的份上 S02E06jagged a 锯齿状的 cranky a 古怪的，怪异的 1234为什么用pants：“Cranky pants” 这个表达中的 “pants” 是一种俏皮的说法，用来指代一个人，而不是字面上的裤子。英语中有时会在表达负面情绪或形容某种性格时使用“pants”这个词，来带出一种轻松或幽默的语气。像“smarty pants”（爱卖弄聪明的人）和“fancy pants”（装腔作势的人）这样的词组也是类似的用法。“Cranky pants” 通常用来形容一个容易发脾气、烦躁或情绪不好的家伙。使用“pants”能让表达听起来更加轻松、幽默，给人一种调侃的感觉，而不是过于严肃或批评。 unemployed a 失业的 key lime 佛州一种青柠檬，以地名Keys命名 I’m allergic to kiwi 对猕猴桃过敏 either that, or 或者说，难不成 anyone up for 有人愿意。。？ scrabble 拼字游戏 Catholic a 天主教的 consider it done 举手之劳，包在我身上 FYI 供参考(for your information) swirl v 打漩 n 漩涡 lather v 打肥皂 rinse n.v 冲洗，漱口 break away 逃脱，挣脱 immodest a 自负的，不谦虚的 whiff v 嗅，闻 n 气味 get a whiff 闻一下 uterus n 子宫 还记得尿道么 urethra 哈哈 life is just a long kick on your urethra 真是魔鬼 adopt v 采纳，收养 gig v 坐小快艇 n 驻点演出的场所 sloppy second 二流的 sloppy a 马虎的，草率的 squirt v 喷 squirt gun 水枪 phobia n 恐惧症，畏惧症 carry on a 可随身携带的 n 随身行李 v 继续 heterosexual a 异性恋的 homosexual a 同性的 bruise n.v 挫伤 puncture v.n 刺伤 stroller n 婴儿车 mole n 痣 jam into 挤入，塞入 freckle n 雀斑 spokes n 辐条，车条 Ken 哈哈，芭比 S02E07repellent a 令人厌恶的 n 驱蚊剂 hideously adv 可怕地，非常地 unattractive a 没有吸引力的，不好的 insulation n 隔离，绝缘，隔热 lying-around a 四处闲逛的，无所事事的 spandex n 弹性纤维 I can’t make hands meet. stretchy pants 紧身裤 stretchy a 弹性的 flash v 表示迅速暴露身体部位给别人看，通常是胸部 I’ll flash you butt-clenches 收臀运动 all pitch in 全部投入 put out 公布 zilch 零，没有 racquetball 壁球 smack v 掌掴，使劲拍 opt for sanity 选择理智 I am over you 我不在乎你 I am beyond you sail v 启航 n 帆 groove v 挖沟，开槽 S02E08unplug v 拔掉 intense a 激烈的 sunk into &#x3D;&#x3D; sink into的过去式 沉入，陷入 start out 开始 tougue 舌头，这里指舌吻。。。 spreadsheet n 电子表格 modem n 调制解调器 how’d you make out last night? 这里的make out是进展如何 saline a 含盐的 n 生理盐水 throw away 扔 I’m jsut throwing all that away? Visine 眼药水品牌 cast aside 抛弃，消除，唾弃 entail v 需要，牵涉 synthetic a 人造的，合成的 crumble v 崩溃，成碎屑 I love how it crumbles. 这里在说有嚼劲 mousse n 慕斯(蛋糕) threesome n 三人行，3P Amish boy Amish 人 spoiled a 娇生惯养的 ditzy a 脑子秀逗的 Star Trek 星际迷航 trek 长途跋涉 1You&#x27;d be a great person to have around after an emergency. cut him some slack 放他一马吧 come up 1She came up with a brilliant idea for the project. Let’s get some perspective here 让我们换个角度看一下 back me up 帮我一下，支持我一下 dung beetle 蜣螂，屎壳郎 fire escape 防火梯，逃生通道 approval 获批，其实就是提交了的申请 FDA approval be dedicated to 致力于，献给 thorn n 荆棘，尖刺 sleight n 奸计，诡计 stand a chance 有机会 1Why don&#x27;t we devote our time to a couple that stands a chance? pistachios n 开心果 reconstitute v 重组，重构 Cardiaccardiac n 心脏病患者 a 心脏的diagnostic n 诊断，诊断的 diagnosis n 诊断 physician n 内科医生 ECG&#x3D;electrocardiogram 心电图 at the diagnostics 在诊断中 vitals n 核心，重要器官 clinical a 临床的，临床诊断的 scrum team perceive v 理解 monologue n 独白，独角戏 当对方介绍完基本情况年后，要说一段，这个听起来真棒，这就是我想工作的team之类的话 monolastic 单一的 EKS EC2 Lambda 1Can you tell me more about that project that you will form one of it to microservices? what that project was about, some of the challenges that you went through. analytic a 分析的 monolith n 巨石 1234567891011How many parts in that?What&#x27;s the Context boundary for micro services?Is that what you descripe just now.What&#x27;s the problem that? led you to introduce microservices.How many people was working in your project with you?How many microsoft services did you? build a pump on that one of it, did you?Who decided on that 25 microservices? why not 10? why not 50?可以回答，we have architecture team. 12345678910Did you work on creating some of these micro services, right?What kind of challange you met..?答 How we can improve the efficiency.For example, you have usual database. Data layer always tricky. have you seen this problem?答 because we have many data sources. centralization and decentralization of the data. We need to spread the data into different domain, but they always need to share the data. So they are spread out and communicate and we need to try to either build the centralize the data storage. For example, build decentrlized data storage.You mentioned you guys use Kafka, right? Why not rabbit MQ. What&#x27;s the preference of Kafka versus rabbit MQ.答：we have a large big data, we have large amount of data.Kafka is good in large amount of data. Rabbit MQ focus on message delivery, and low latency and especially it is designed for a real-time communication. Because of large datad scales, that is the important reason we choose Kafka. In the futurn we will have more data. 1234567I see you have alot of focus on security, right? Can you tell me more about your experience and security as a data privacy or what happened there? what&#x27;s the main responsibility?答：that role is about information security.comment,user photos breaks our policy. like the comment triger the security alert and againist some rules.What&#x27;s the role in that project? Are you do you write an actual language processing. I mean how can you tell me more?答 large language model is responsible by data team and I just write code to in implement the entire folw to handle this, we just need to call the model called the NLP model. I didn&#x27;t not really work directly on it. 12345678why do you use angular? How did you use Angular? Which company use angular heavily?答 more often on angularI worked as a fullstack. My work is more concentrated on the backend. My work is more focused on the backend. 20%on the frontend and 80% on the backend.What&#x27;s your preference backend or front end?我认为后端重视传递数据的逻辑，前端需要更理解样式，审美之类东西The scalability of the micro service, how did you guys achieve that? How did you guys measure that?答 we use AWS services like EKS which manage the kubernetes cluster, EC2 S3 lambda; load balancer. 12345how do you moniter that, trouble shoot micro services.We have cloudwatch splunk. lences Cloudwatch which will report the status of each service. show us the cpu and memory and traffic We use Eureic monitor the status of each sourcesWe also have somelocal tools to debug or to check the traffic. 12How do you achieve the API versioning?答 When you actually by default, you will call the keyword. 12345还有什么想表达in XX company, I have some experience in design as well. I actually joined the team design. We have a design meeting in every scrumI am familiar with different databases.what your bachelor degree? S02E09super n 警长，大楼管理员（实际上是apartment里修水电的那些人，并不是真正管理者，管理者是apartment manager） tip 这里作动词给小费 homemade a 家里做的 impersonal a 没人情味的，见外的 we’re broke 我们破产了 &#x3D;&#x3D; 我们没钱 brownies n 布朗尼 limerick n 五行打油诗 这个有点三句半那个意思 pot n 大麻 crossword puzzle 填字游戏 be mad at somebody 生某人的气 from now on 从今以后 固定搭配这个介词on go nuts 拿去疯吧 &#x3D;&#x3D; 拿去玩吧 blouse n 女士衬衫 authentic fake medals 以假乱真的奖章 run out on us 逃离我们 run out 用光，用完了 1234567你怎么没。。。？How have you never been on Oprah?How haven&#x27;t you been on Oprah?你怎么从来没有女朋友？How have you never had a girl friend?你怎么从过去到现在一直没有参与soccer?How have you never been playing soccer? It&#x27;s such a popular sport! collie n 牧羊犬 everone’s all ears! 大家都洗耳恭听 meadow n 草地，牧场 I smell smoke. 我感觉气氛不对，我感觉不对味儿 Someone’s pants are on fire 有人撒谎 1pants are on fire is taken from the children&#x27;s taunt(n.嘲弄): &quot;Liar, liar, pants on fire&quot; I didn’t wanna go wrong with you. 我不想在你这出错 Burma n 缅甸 pharmacist n 药剂师 patent leather 漆皮 patent a 专利的，寄生虫感染的 stumble v 绊倒 claymation n 粘土动画 类似小羊肖恩那种 ornament v.n 装饰 whiny a 爱发牢骚的，哭哭啼啼的 obsessive a 强迫症的，缠人的 insecure a 缺乏安全感的 gutless 没有胆量的 gel n 发胶 you’re better off without him. 你最好没有他，没有他你过得更好 irresponsible a 不负责任的 creep n 混球 lock up 把。。关起来 lock up your mom Gremlin 小精灵 nobody else 别无他人 &#x3D;&#x3D; 非你莫属 hop in 上车 hop 啤酒花 cheat sheep 小抄，备忘纸条 paramedic n 急救人员，医护人员 cut through it 割断，剪断 knob n 旋钮，圆形或者球形开关 fuse v 熔接 n 保险丝 blackmail v.n 勒索，敲诈 P.S. 你勒索我！ if worse comes to worse 如果越来越糟糕 jerky a 颠簸的，干涩的 n 肉干，牛肉干 sauna n 桑拿 cave v 使坍塌，使崩溃，高压下的屈服 n 洞穴 No can do 没辙，没有办法 mistletoe 槲寄生 basil n 紫苏，罗勒 nip 掐 12Do you think it&#x27;d be alright if I went in and used his bathroom?注意这个时态，因为请求，所以would + if + 过去时 get gas 加油 ribbed a 带螺纹的 因为rib是肋骨嘛 S02E10be sold out of something 某物被卖光了 You might wanna consider doing something 一种很委婉建议：你最好做某事 1You might wanna consider wearing underwear next time. 你下次最好考虑穿上内裤。 authenticity n 真实性 genital n 外阴，生殖器 a 生殖器的 adolescent n 青少年 a 青春期的 在这里是讽刺导演幼稚 disturbingly adv 令人不安地 portrayal n 描述，描绘 portray v 描绘 pay your dues 投资你自己，耕耘你自己 mediocre a 平庸的 veterinarian n vet stegosaurus n 剑龙 don’t toy with me 别耍我，别玩我 psyched a 开心的 public display of affection &#x3D;&#x3D; PDA 公开场合秀恩爱 前两天刚在一个电影里看到这个的缩写 avert v 背过脸，转移目光 lousy a 非常糟糕 go through &#x3D;&#x3D; consume 1we went through a lot of wine wasted&#x2F;bombed a 喝醉了&#x2F;喝倒了 an awful lot of 很多 这个awful就是表示adv 很，非常 flask n 烧瓶，扁的随身酒壶 make excuses about it 找借口 bittersweet a 苦乐参半的 amnesia n 健忘症 crouton n 油炸面包丁 callback 这里表示复试 ecstatic a 欣喜若狂的 sraighten it out 捋清楚 sober v 变冷静 a 没喝多的，清醒的 set it free 给他自由 这里指代让其暴露本性 periodontist 牙周病医生 Ross是 paleontologist 古生物学家 ditto 同上，我也是 curator n 馆长，管理者 be drawn to me 被我吸引，看上我了 keep her at bay 与她保持距离 goober 一种花生 break n 机会 这里不是休息 12Didn&#x27;t you use to call it &quot;the little major&quot;? 你以前不是叫他小少校么？I&#x27;ve gotta get used to it. 我要习惯这种事。 the light went out 灯熄灭了 flotation n 漂浮 recur v 重现，重演 S02E11projectile n 抛射物 a 抛射的 throw up 呕吐 as in 就像 revel 狂喜，沉醉 I’m revelling 表示我很高兴 hit me 让我意识到，打动我 It really hit me last night. intense a 激烈的，严肃紧张的 intense n 口红，唇彩 rim n 圆边 &#x3D;&#x3D; 杯沿儿 uptight a 紧张不安的 sorority n 姐妹会 lousy 糟糕的 marshmallow n 棉花糖 call up 打电话给。。 barely adv 勉强地，几乎不能地 flatter v 奉承，讨好 shrink n 心理医生 v 收缩 one last time adv 最后一次 1She also said she wanted to sleep with me one last time. worth a shot 值得一试 P.S. 这个桥段设计的可以 marijuana 大麻 &#x3D;&#x3D; pot be reluctant to do 不愿意做 I feel for you 我同情你 call off &#x3D;&#x3D; cancel emphatic a 强调的，加强语气的 devil n 虽然是魔鬼的意思 但还有 v 切碎的意思 futile a 徒劳的，无用的 matrimony n 结婚，婚礼，婚姻生活 can’t help but do 不禁。。不得不。。。 couldn’t help but do 同上 这个里这个人表示自己并非故意偷听的 make eyes at me 朝我抛媚眼 S02E12Can’t get the monkey off your back 是一个英语成语，意思是你有个无法摆脱的问题或负担，总是困扰着你。 pouty a 翘嘴的，鼓起来的，噘嘴的 raisin n 葡萄干 stalker n 跟踪者，狗仔 &#x3D;&#x3D; 影迷 pass on 去世 pass away macaw n 金刚鹦鹉 wack a 古怪的 12maniac n.疯子/boff&lt;俚&gt; A term to describe quick sexual intercourse which includes theman not taking off his pants and a lot of dry humping.","categories":[],"tags":[]},{"title":"Leetcode75","slug":"Leetcode75","date":"2024-10-07T19:00:00.000Z","updated":"2024-10-08T06:01:48.715Z","comments":true,"path":"2024/10/07/Leetcode75/","permalink":"http://example.com/2024/10/07/Leetcode75/","excerpt":"","text":"[TOC] https://leetcode.com/discuss/general-discussion/460599/blind-75-leetcode-questions Binary 和 Dynamic Programming不用看 关于循环的描述 1I am looping through this array using a for loop, and each time, I print the value of the element. 常用方法汇总 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667686970map.containsKey(key)map.putmap.getmap.getOrDefault(Object key, V defaultValue);创建一个带参数的map：public static HashMap&lt;Character, Character&gt; map = new HashMap()&#123;&#123;put(&#x27;(&#x27;, &#x27;)&#x27;);put(&#x27;[&#x27;,&#x27;]&#x27;);put(&#x27;&#123;&#x27;,&#x27;&#125;&#x27;);&#125;&#125;;map.keySet()map.values()Set&lt;String&gt; keySet = hashMap.keySet(); Set&lt;Map.Entry&lt;String, String&gt;&gt; entrySet = hashMap.entrySet(); for (Map.Entry&lt;String, String&gt; entry : entrySet) &#123; System.out.println(entry.getKey() + &quot;-&quot; + entry.getValue()); &#125;set.contains(value) 查看是否有值其中一种写法可以返回add的值，判断是否containsif (!set.add(x)) &#123; return true;&#125;字符串字符串返回特定index上的字符是str.charAt(index)或者先把字符串打成数组：str.toCharArray()s.substring(l, r); // r不包括 广度优先 queueQueue&lt;Integer&gt; queue = new LinkedList&lt;Integer&gt;();queue.addqueue.offer(i);queue.removeint u = queue.poll();PriorityQueue&lt;Status&gt; queue = new PriorityQueue&lt;Status&gt;();PriorityQueue&lt;int[]&gt; queue = new PriorityQueue&lt;int[]&gt;(new Comparator&lt;int[]&gt;() &#123; public int compare(int[] m, int[] n) &#123; return m[1] - n[1]; &#125;&#125;);Deque&lt;ListNode&gt; stack = new LinkedList&lt;ListNode&gt;();// 数组Arrays.fill(dp, amount+1); db[0]=0char[] charArray = s.toCharArray();int[][] arr = list.toArray(new int[list.size()][]); list转数组LinkedList&lt;Character&gt; stack = new LinkedList();stack.offer(&#x27;?&#x27;); stack.addLast(c); 注意对于栈这两个不是标准方法stack.push(c);stack.size();char temp = stack.pop(); stack.removeLast();List 转数组int[] intArray = myList.stream().mapToInt(Integer::intValue).toArray();Integer[] integerArray = list.toArray(new Integer[0]);System.out.println(Arrays.toString(integerArray));ArrayList泛型 List&lt;List&lt;Integer&gt;&gt; ret = new ArrayList&lt;List&lt;Integer&gt;&gt;();对字符的判断Character.isLetterOrDigit(s.charAt(left))sgood.append(Character.toLowerCase(ch));StringBuffer sgood_rev = new StringBuffer(sgood).reverse();compareArrays.sort(intervals, (v1, v2) -&gt; v1[0] - v2[0]);Arrays.sort(intervals, new Comparator&lt;int[]&gt;()&#123; public int compare(int[] interval1, int[] interval2)&#123; return interval1[0] - interval2[0]; &#125;&#125;); Array 101.Two Sum12345Map泛型必须用类Integer，不能是int这种基本类型map.containsKey(key)map.putmap.get存储的是以当前元素为key，寻找的是target-当前元素的值为key en note 123456789101112131415161718It might be tempting to say 可能禁不住会说add up 加起来add up to five 加起来等于5表示一个[1，4]数组可以说It is an array of 1, 4.time and space complexityend up 最后是I&#x27;ll see that the time ends up being O ...n squared n的二次方，注意是过去式look in v 查找，顺便看看stumble upon 碰上，遇到keep track of.. 追踪，密切关注，记录 这里是记录已经看过的数据later on 随后doesn&#x27;t look like it does. 看着不像subtract v 减去 If I subtract 3 from my 1, we&#x27;ll get negative 2.It doesn&#x27;t matter the order. 顺序不重要，It doesn&#x27;t matter 后面可以直接加it指代的名词Because I iterate once through the array. 遍历了一遍数组start out by doing 首先从doing出发/开始 121.Best Time to Buy and Sell Stock1234初始的最小金额可以设置成Integer.MAX_VALUE也可以先检查数组长度，如果长度大于0，就将第一个值赋值给记录最小值的变量iterate through the array 形容便利一个数组的时候 217.Contains Duplicate12345set.contains(value) 查看是否有值其中一种写法可以返回add的值，判断是否containsif (!set.add(x)) &#123; return true;&#125; 238.Product of Array Except Self 成积前缀后缀乘积，空间复杂度控制n，需要背下来，开始根本记不住，现在完全能盲写 1234567891011121314public int[] productExceptSelf(int[] nums) &#123; int len = nums.length; int[] answer = new int[len]; answer[0] = 1; for(int i=1; i&lt;len; i++)&#123; answer[i]=answer[i-1] * nums[i-1]; &#125; int r = 1; for(int i=len-1; i&gt;=0; i--)&#123; answer[i] = answer[i] * r; r *= nums[i]; &#125; return answer;&#125; en note 12prefix n 前缀suffix n 后缀 53.Maximum Subarray用动态规划解题，有点像计算前序和，后续和 1234567891011121314151617181920212223242526272829303132 public int maxSubArray(int[] nums) &#123; int len = nums.length; int[] dp = new int[len]; dp[0] = nums[0]; int result = dp[0]; for(int i=1; i&lt;len; i++)&#123; if(dp[i-1] &lt; 0)&#123; dp[i] = nums[i]; &#125; else&#123; dp[i] = dp[i-1] + nums[i]; &#125; result=result&lt;dp[i]?dp[i]:result; &#125; return result; &#125;// 改进：只需要记录当前sum就可以了// 用sum记录前序和，当前序和小于0，就用当前值做前序，否则就累加当前值 public int maxSubArray(int[] nums) &#123; int sum = nums[0]; int max = nums[0]; for(int i=1; i&lt;nums.length; i++)&#123; if(sum&lt;0)&#123; sum = nums[i]; &#125; else &#123; sum += nums[i]; &#125; max = max&lt;sum? sum : max; &#125; return max; &#125; en note 1subarray 这个词指代连续的一段子数组 152.Maximum Product Subarray12345计算截至到当前数字的最大区间的最大积Math.max(mn*nums[i], Math.max(mx*nums[i], nums[i]));，和最大区间的最小积Math.min(mn*nums[i], Math.min(mx*nums[i], nums[i]));，和当前最大积result也是类似dp的思路，只是记录两个dp 1234567891011121314151617public int maxProduct(int[] nums) &#123; if(nums.length == 0)&#123; return 0; &#125; int result = nums[0]; int mxResult = nums[0]; int mnResult = nums[0]; for(int i=1; i&lt;nums.length; i++)&#123; int current = nums[i]; int mx = mxResult, mn = mnResult; mxResult = Integer.max(current*mn, Integer.max(current, current*mx)); mnResult = Integer.min(current*mn, Integer.min(current, current*mx)); result = Integer.max(result, mxResult); &#125; return result;&#125; 153.Find Minimum in Rotated Sorted Array二分法，找不是ascending的那两个数字感悟这个比较过程，当med小于high时候，说明med到high都是顺序，则pivot可能在left到med之间，所以high&#x3D;med. 123这个算法有两个点注意1：中间点是final int m = (left + right) / 2;2：先检查后半部分是否符合标准，符合则right=m；不符合则left=m+1；这样不会出现越界现象，中间点赋值时候不会等于右边点。 33.Search in Rotated Sorted Array需要背 首先给定的数组分为两部分，前升序和后升序。这里的后升序的最大值小于前升序的最小值。 然后先找med的值，和target比较。再和left和right比较，在这个区间就缩小范围，不在这个区间就尝试下另外一个范围。 1nums[0]&lt;=nums[med] 先用上面的代码分出前还是后升序 然后再分出是有序部分还是无序部分 15.3Sum需要背，现在也不用背了 先排序 两个For 循环（进入循环后去重） + 双指针 1关于not contain duplicate triplets的问题，可以自己查重，也可以用set去重 11.Container With Most Water双指针，往里面缩短板，可能会得到更大的面积，往里面缩长板，长变小，高不变，一定会得到更小的面积。因此策略是双指针向内缩短板。 Binary 5371.Sum of Tow Integers不能用+-符号，思路是位运算符号 12345bit-wise operators &amp; (and), | (or), ~ (not) and ^ (exclusive-or, xor) and shift operators a &lt;&lt; b and a &gt;&gt; b.进位 carry进位的值用 a &amp; b 然后左移1位 最终表示为：(a&amp;b) &lt;&lt; 1无进位的值 a ^ b二者的值相加，直到进位为0（也就是没有需要进1的位），说明本轮这次a ^ b就是最终结果。 191.Number of 1 Bits1234567每次n &amp; (n−1)都把n的最低的1位变成了0，所以统计这个运算的次数 int output=0; while(n!=0)&#123; n &amp;= (n-1); output++; &#125; return output; 338.Counting Bits4种解法，基本是动态规划的逻辑，用已经算出的数字推演当前数字 268.Missing Number123456789101112public int missingNumber(int[] nums) &#123; int xor = 0; int n = nums.length; for (int i = 0; i &lt; n; i++) &#123; xor ^= nums[i]; &#125; for (int i = 0; i &lt;= n; i++) &#123; xor ^= i; &#125; return xor;&#125;// 当一个数字^两次同样的数字后为0 190.Reverse Bits左右不停颠倒题。。。123456789101112131415161718192021public int reverseBits(int n) &#123; int rev = 0; for (int i = 0; i &lt; 32 &amp;&amp; n != 0; ++i) &#123; rev |= (n &amp; 1) &lt;&lt; (31 - i); n &gt;&gt;&gt;= 1; &#125; return rev;&#125;private static final int M1 = 0x55555555; // 01010101010101010101010101010101private static final int M2 = 0x33333333; // 00110011001100110011001100110011private static final int M4 = 0x0f0f0f0f; // 00001111000011110000111100001111private static final int M8 = 0x00ff00ff; // 00000000111111110000000011111111public int reverseBits(int n) &#123; n = n &gt;&gt;&gt; 1 &amp; M1 | (n &amp; M1) &lt;&lt; 1; n = n &gt;&gt;&gt; 2 &amp; M2 | (n &amp; M2) &lt;&lt; 2; n = n &gt;&gt;&gt; 4 &amp; M4 | (n &amp; M4) &lt;&lt; 4; n = n &gt;&gt;&gt; 8 &amp; M8 | (n &amp; M8) &lt;&lt; 8; return n &gt;&gt;&gt; 16 | n &lt;&lt; 16;&#125; Dynamic Programming 1170.Climbing Stairs123上台阶，一次可以上1级或者2级台阶，问多少种走法当i&gt;=3时候output[i] = output[i-1] + output[i-2]; 322.Coin Change1234567891011121314public int coinChange(int[] coins, int amount) &#123; int output = 0; int[] dp = new int[amount + 1]; Arrays.fill(dp, amount+1); dp[0] = 0; for(int i=1; i&lt;amount+1; i++)&#123; for(int j=0; j&lt;coins.length; j++)&#123; if(coins[j] &lt;= i)&#123; dp[i] = Math.min(dp[i], dp[i - coins[j]] + 1); &#125; &#125; &#125; return dp[amount]&gt;amount? -1: dp[amount];&#125; 1234dp 只一个数组的解法，长度是amount+1初始化用Arrays.fill(dp, amount+1); db[0]=0两个for循环,外循环是amount,从1开始，内循环是coins的长度，从0开始最后比较dp[amount]值是否被改变过 300.Longest Increasing Subsequence1234567891011121314151617public int lengthOfLIS(int[] nums) &#123; if(nums.length&lt;=1)&#123; return nums.length; &#125; int[] dp = new int[nums.length]; Arrays.fill(dp, 1); int output = 1; for(int i=1; i&lt;nums.length; i++)&#123; for(int j=i-1; j&gt;=0; j--)&#123; if(nums[j]&lt;nums[i])&#123; dp[i] = Math.max(dp[i], dp[j]+1); output = Math.max(output, dp[i]); &#125; &#125; &#125; return output; &#125; 1每次记录output 12345678910111213141516171819202122232425262728// dp算法很好理解，以下是贪心d数组记录每个i位置的最小结尾数字，不断更新这个结尾数字。用二分提高查找效率，这个算法不好理解 public int lengthOfLIS(int[] nums) &#123; int len = 1, n = nums.length; if (n == 0) &#123; return 0; &#125; int[] d = new int[n + 1]; d[len] = nums[0]; for (int i = 1; i &lt; n; ++i) &#123; if (nums[i] &gt; d[len]) &#123; d[++len] = nums[i]; &#125; else &#123; int l = 1, r = len, pos = 0; // 如果找不到说明所有的数都比 nums[i] 大，此时要更新 d[1]，所以这里将 pos 设为 0 while (l &lt;= r) &#123; int mid = (l + r) &gt;&gt; 1; if (d[mid] &lt; nums[i]) &#123; pos = mid; l = mid + 1; &#125; else &#123; r = mid - 1; &#125; &#125; d[pos + 1] = nums[i]; &#125; &#125; return len; &#125; 1143.Longest Common Subsequence1234如果相等，就dp[i-1][j-1] + 1如果不等，就Math.max(dp[i-1][j], dp[i][j-1])字符串返回特定index上的字符是str.charAt(index)或者先把字符串打成数组：str.toCharArray() 123456789101112131415161718public static int longestCommonSubsequence(String text1, String text2) &#123; int[][] dp = new int[text2.length() + 1][text1.length() + 1]; for(int i=0; i&lt;text2.length()+1; i++)&#123; int[] cur = new int[text1.length() + 1]; dp[i] = cur; if(i!=0)&#123; for(int j=1; j&lt;text1.length() + 1; j++)&#123; if(text1.charAt(j-1) == text2.charAt(i-1))&#123; dp[i][j] = dp[i-1][j-1] + 1; &#125; else&#123; dp[i][j] = Math.max(dp[i][j-1], dp[i-1][j]); &#125; &#125; &#125; &#125; return dp[text2.length()][text1.length()];&#125; 139.Word Break12主要是条件不好想dp[j] &amp;&amp; set.contains(s.substring(j, i)) 1234567891011121314public boolean wordBreak(String s, List&lt;String&gt; wordDict) &#123; Set&lt;String&gt; set = new HashSet(wordDict); boolean[] dp = new boolean[s.length() + 1]; dp[0] = true; for(int i=0; i&lt;=s.length(); i++)&#123; for(int j=0; j&lt;i; j++)&#123; if(dp[j] &amp;&amp; set.contains(s.substring(j, i)))&#123; dp[i] = true; break; &#125; &#125; &#125; return dp[s.length()];&#125; 377.Combination Sum IV123这个dp代表当前target从0-target值每一轮是当前硬币组成当前target的可能性，只考虑当前硬币在当前位置上dp[i] += dp[i-num] 123456789101112public int combinationSum4(int[] nums, int target) &#123; int[] dp = new int[target + 1]; dp[0] = 1; for(int i=1; i&lt;=target; i++)&#123; for(int coin:nums)&#123; if(coin&lt;=i)&#123; dp[i] += dp[i-coin]; &#125; &#125; &#125; return dp[target];&#125; 198.House Robber1234567891011121314// 一次迈两步还是一次迈三步的问题，这个问题比较简单public int rob(int[] nums) &#123; int[] dp = new int[nums.length + 1]; dp[0] = 0; dp[1] = nums[0]; for(int i=2; i&lt;=nums.length; i++)&#123; if(i-3&lt;0)&#123; dp[i] = dp[i-2] + nums[i-1]; &#125; else&#123; dp[i] = Math.max(dp[i-3], dp[i-2]) + nums[i-1]; &#125; &#125; return Math.max(dp[nums.length], dp[nums.length-1]);&#125; 213.House Robber II1闭环以后，逻辑就变成(0, len-2)或者(1, len-1)谁更大的问题，这题要考虑len==1和len==2的情况 12345678910111213141516171819public int rob(int[] nums) &#123; int length = nums.length; if (length == 1) &#123; return nums[0]; &#125; else if (length == 2) &#123; return Math.max(nums[0], nums[1]); &#125; return Math.max(robRange(nums, 0, length - 2), robRange(nums, 1, length - 1)); &#125; public int robRange(int[] nums, int start, int end) &#123; int first = nums[start], second = Math.max(nums[start], nums[start + 1]); for (int i = start + 2; i &lt;= end; i++) &#123; int temp = second; second = Math.max(first + nums[i], second); first = temp; &#125; return second; &#125; 91.Decode Ways12345转移方程1：当第i个字符不是&#x27;0&#x27;,说明当前字符自成一个字母，那么dp[i] = dp[i-1]2：当第i-1个字符不是&#x27;0&#x27;，且第i-1个字符和第i个字符能组成一个新的字符，也就是&lt;=26，则dp[i] = dp[i-2]上述2点可能同时发生，因此第二条应该累加 dp[i] += dp[i-2]，且当i为起始点的时候没有第i-1的字符。考虑到index，文中的i应该对应index的i-1 1234567891011121314public int numDecodings(String s) &#123; int len = s.length(); int[] dp = new int[len + 1]; dp[0] = 1; for(int i=1; i&lt;=len; i++)&#123; if(s.charAt(i-1) != &#x27;0&#x27;)&#123; dp[i] = dp[i-1]; &#125; if(i&gt;1 &amp;&amp; s.charAt(i-2) !=&#x27;0&#x27; &amp;&amp; 10 * (s.charAt(i-2)-&#x27;0&#x27;) + s.charAt(i-1) - &#x27;0&#x27; &lt;= 26)&#123; dp[i] += dp[i-2]; &#125; &#125; return dp[len];&#125; wed_115pm 62.Unique Paths1计算一个二维数组从左上到右下有多少个不同的路径，属于dp范例问题，用两个数组实现。 1234567891011121314public int uniquePaths(int m, int n) &#123; int[] first = new int[n]; int[] second = new int[n]; Arrays.fill(first, 1); for(int i=1; i&lt;m; i++)&#123; second[0] = 1; for(int j=1; j&lt;n; j++)&#123; second[j] = second[j-1] + first[j]; &#125; first = second; &#125; return first[n-1];&#125; 55.Jump Game1234567891011121314151617// 不算动态规划，是贪心问题，思路比较简单，注意当最长距离小于当前轮次就要结束循环了 public boolean canJump(int[] nums) &#123; int target = 0; for(int i=0; i&lt;nums.length; i++)&#123; if(i&gt;target)&#123; break; &#125; if(i+nums[i] &gt; target)&#123; target = i + nums[i]; &#125; &#125; if(target &gt;= nums.length - 1)&#123; return true; &#125; else &#123; return false; &#125; &#125; Graph 8133.Clone GraphGraph的基本结构 深度优先和广度优先遍历 123广度优先 queuequeue.addqueue.remove 12345678910111213141516// 深度优先 if(node == null)&#123; return null; &#125; if(visited.containsKey(node))&#123; return visited.get(node); &#125; List&lt;Node&gt; neighbors = new ArrayList(); Node cur = new Node(node.val, new ArrayList()); visited.put(node, cur); for(Node original:node.neighbors)&#123; Node newNode = cloneGraph(original); cur.neighbors.add(newNode); &#125; return cur; 123456789101112131415161718192021//广度优先if(node == null)&#123; return null;&#125;Map&lt;Node, Node&gt; visited = new HashMap();LinkedList&lt;Node&gt; queue = new LinkedList();queue.add(node); // rootvisited.put(node, new Node(node.val, new ArrayList&lt;Node&gt;()));while(!queue.isEmpty())&#123; Node head = queue.remove(); for (Node neighbor: head.neighbors) &#123; if(!visited.containsKey(neighbor))&#123; visited.put(neighbor, new Node(neighbor.val, new ArrayList&lt;Node&gt;())); queue.add(neighbor); &#125; visited.get(head).neighbors.add(visited.get(neighbor)); &#125;&#125;return visited.get(node); 207.Course Schedule拓扑图结构，有向图，无环。 BFS遍历，需要先将edges统计一下，先修prerequisite-&gt;List_advancedCourses. 然后定义每个高级课程的入度，当入度为0的时候，offer入queue. 然后按照顺序从queue中poll出。 1234567891011121314151617181920212223242526272829303132333435List&lt;List&lt;Integer&gt;&gt; edges = new ArrayList&lt;&gt;();int[] indeg;public boolean canFinish(int numCourses, int[][] prerequisites) &#123; int result = 0; for(int i=0; i&lt;numCourses; i++)&#123; edges.add(new ArrayList&lt;Integer&gt;()); &#125; indeg = new int[numCourses]; for(int[] info:prerequisites)&#123; edges.get(info[1]).add(info[0]); indeg[info[0]]++; &#125; Queue&lt;Integer&gt; queue = new LinkedList&lt;&gt;(); for(int i=0; i&lt;numCourses; i++)&#123; if(indeg[i] == 0)&#123; queue.add(i); result++; &#125; &#125; while(!queue.isEmpty())&#123; int cur = queue.poll(); for(int ch:edges.get(cur))&#123; if(--indeg[ch] == 0)&#123; queue.offer(ch); result++; &#125; &#125; &#125; return result==numCourses;&#125; DFS遍历，全局valid变量表示是否有环，结果是返回这个图是否有环。valid有三个status，0是未访问，1是正在访问，如果正在访问的节点被访问了，说明有环，2是访问完毕。基本逻辑是循环便利所有的点，查看是否有环。 123456789101112131415161718192021222324252627282930313233343536class Solution &#123; List&lt;List&lt;Integer&gt;&gt; edges = new ArrayList(); int[] visited; boolean valid = true; public boolean canFinish(int numCourses, int[][] prerequisites) &#123; for(int i=0; i&lt;numCourses; i++)&#123; edges.add(new ArrayList&lt;Integer&gt;()); &#125; visited = new int[numCourses]; for(int[] info:prerequisites)&#123; edges.get(info[0]).add(info[1]); // 这个谁指向谁是无所谓的，也可以用edges.get(info[1]).add(info[0]); &#125; for(int i=0; i&lt;numCourses &amp;&amp; valid; ++i)&#123; if(visited[i] == 0)&#123; dfs(i); &#125; &#125; return valid; &#125; public void dfs(int u)&#123; visited[u] = 1; for(int v:edges.get(u))&#123; if(visited[v] == 0)&#123; dfs(v); if(!valid)&#123; //如果已经发现有闭环，就返回结果 return; &#125; &#125; else if(visited[v] == 1)&#123; // 发现闭环，将标志位置为false，然后结束往后的查询 valid = false; return; &#125; &#125; visited[u] = 2; // 当前课程已经查询过了，且已经可以成功学成 &#125;&#125; 417.Pacific Atlantic Water Flow略，我觉得这个题可以不看 200.Number of Islands方法1：深度优先dfs，把所有遍历到的地块都变成0，也就是变成海洋。本来应该用队列存储邻居，但是邻居恒定为4，就直接写了。 12345678910111213141516171819202122232425262728293031323334public int numIslands(char[][] grid) &#123; int m = grid.length; if(m==0)&#123; return 0; &#125; int n = grid[0].length; if(n==0)&#123; return 0; &#125; int output = 0; for(int i=0; i&lt;m; i++)&#123; for(int j=0; j&lt;n; j++)&#123; if(grid[i][j] == &#x27;1&#x27;)&#123; output++; dfs(grid, i, j); &#125; &#125; &#125; return output;&#125;public void dfs(char[][] grid, int i, int j)&#123; int m = grid.length; int n = grid[0].length; if(i&gt;=0 &amp;&amp; i&lt;m &amp;&amp; j&gt;=0 &amp;&amp; j&lt;n &amp;&amp; grid[i][j] == &#x27;1&#x27;)&#123; grid[i][j] = &#x27;0&#x27;; dfs(grid, i-1, j); dfs(grid, i+1, j); dfs(grid, i, j-1); dfs(grid, i, j+1); &#125;&#125; 方法2：广度优先遍历 也是将相邻的陆地翻转成’0’，用一个Queue存放下一层邻居并翻转。注意在Queue中存放的是(row * numberOfColumn + column) 这样二维数组就翻译成一个数字了。 123456789101112131415161718192021222324252627282930313233343536373839404142public int numIslands(char[][] grid) &#123; if (grid == null || grid.length == 0) &#123; return 0; &#125; int nr = grid.length; int nc = grid[0].length; int num_islands = 0; for (int r = 0; r &lt; nr; ++r) &#123; for (int c = 0; c &lt; nc; ++c) &#123; if (grid[r][c] == &#x27;1&#x27;) &#123; ++num_islands; grid[r][c] = &#x27;0&#x27;; Queue&lt;Integer&gt; neighbors = new LinkedList&lt;&gt;(); neighbors.add(r * nc + c); while (!neighbors.isEmpty()) &#123; int id = neighbors.remove(); int row = id / nc; int col = id % nc; if (row - 1 &gt;= 0 &amp;&amp; grid[row-1][col] == &#x27;1&#x27;) &#123; neighbors.add((row-1) * nc + col); grid[row-1][col] = &#x27;0&#x27;; &#125; if (row + 1 &lt; nr &amp;&amp; grid[row+1][col] == &#x27;1&#x27;) &#123; neighbors.add((row+1) * nc + col); grid[row+1][col] = &#x27;0&#x27;; &#125; if (col - 1 &gt;= 0 &amp;&amp; grid[row][col-1] == &#x27;1&#x27;) &#123; neighbors.add(row * nc + col-1); grid[row][col-1] = &#x27;0&#x27;; &#125; if (col + 1 &lt; nc &amp;&amp; grid[row][col+1] == &#x27;1&#x27;) &#123; neighbors.add(row * nc + col+1); grid[row][col+1] = &#x27;0&#x27;; &#125; &#125; &#125; &#125; &#125; return num_islands;&#125; 128.Longest Consecutive Sequence题目要求Time Complexity &#x3D; n 12345678910111213141516171819public int longestConsecutive(int[] nums) &#123; Set&lt;Integer&gt; set = new HashSet&lt;&gt;(); for(int i:nums)&#123; set.add(i); &#125; int output = 0; for(int i:nums)&#123; if(!set.contains(i-1))&#123; int current = i; while(set.contains(++current))&#123; &#125; output = Math.max(current - i, output); &#125; &#125; return output;&#125; 题目要求 O(n)O(n)O(n) 复杂度。 用哈希表存储每个端点值对应连续区间的长度若数已在哈希表中：跳过不做处理若是新数加入：取出其左右相邻数已有的连续区间长度 left 和 right计算当前数的区间长度为：cur_length &#x3D; left + right + 1根据 cur_length 更新最大长度 max_length 的值更新区间两端点的长度值 1234567891011121314151617181920public int longestConsecutive(int[] nums) &#123; int n=nums.length; HashMap&lt;Integer,Integer&gt;map = new HashMap&lt;Integer,Integer&gt;(); int res = 0; for(int num:nums)&#123; if(!map.containsKey(num))&#123; int left = map.get(num-1)==null?0:map.get(num-1); int right = map.get(num+1)==null?0:map.get(num+1); int cur = 1+left+right; if(cur&gt;res)&#123; res = cur; &#125; map.put(num,cur); map.put(num-left,cur); map.put(num+right,cur); &#125; &#125; return res;&#125;// 二者相邻，此时这个连续序列只有left和right最远端可能还会出现一个相邻点，其余链上的数字都没有相邻点了，因此不用处理链上的数字。 269.Alien Dictionary 会员（Hard）261.Graph Valid Tree 会员123首先一棵树的特点是边数目+1等于点的数目，不符合直接返回false其次将入参转换成双向bidirected的二维ArrayList，从0开始遍历，用set记录已经遍历过的点最后对比set的size是否等于入参n的个数 323.Number of Connected Components in an undiredted Graph 会员Interval 557.Insert Interval1non-overlapping intervals 非重叠区间 12345678910111213141516171819202122232425262728// 分别考虑2种不交叉和1种相互交叉的情况 public int[][] insert(int[][] intervals, int[] newInterval) &#123; List&lt;int[]&gt; list = new ArrayList&lt;&gt;(); int start = newInterval[0]; int end = newInterval[1]; boolean flag = true; for(int[] interval:intervals)&#123; if(interval[0] &gt; end)&#123; if(flag)&#123; flag = false; list.add(new int[]&#123;start, end&#125;); &#125; list.add(interval); &#125; else if(start &gt; interval[1])&#123; list.add(interval); &#125; else&#123; start = Math.min(start, interval[0]); end = Math.max(end, interval[1]); &#125; &#125; if(flag)&#123; flag = false; list.add(new int[]&#123;start, end&#125;); &#125; return list.toArray(new int[list.size()][]); &#125; 56.merge intervals123456789101112131415161718192021222324public int[][] merge(int[][] intervals) &#123; if(intervals.length==0)&#123; return new int[1][2]; &#125; Arrays.sort(intervals, new Comparator&lt;int[]&gt;()&#123; public int compare(int[] interval1, int[] interval2)&#123; return interval1[0] - interval2[0]; &#125; &#125;); List&lt;int[]&gt; list = new ArrayList(); int l = intervals[0][0]; int r = intervals[0][1]; for(int[] arr:intervals)&#123; if(arr[0]&gt;r)&#123; list.add(new int[]&#123;l, r&#125;); l = arr[0]; r = arr[1]; &#125; else &#123; r = Math.max(r, arr[1]); &#125; &#125; list.add(new int[]&#123;l, r&#125;); return list.toArray(new int[list.size()][]);&#125; 1234567891011121314151617181920public int[][] merge(int[][] intervals) &#123; if (intervals.length == 0) &#123; return new int[0][2]; &#125; Arrays.sort(intervals, new Comparator&lt;int[]&gt;() &#123; public int compare(int[] interval1, int[] interval2) &#123; return interval1[0] - interval2[0]; &#125; &#125;); List&lt;int[]&gt; merged = new ArrayList&lt;int[]&gt;(); for (int i = 0; i &lt; intervals.length; ++i) &#123; int L = intervals[i][0], R = intervals[i][1]; if (merged.size() == 0 || merged.get(merged.size() - 1)[1] &lt; L) &#123; merged.add(new int[]&#123;L, R&#125;); &#125; else &#123; merged.get(merged.size() - 1)[1] = Math.max(merged.get(merged.size() - 1)[1], R); &#125; &#125; return merged.toArray(new int[merged.size()][]); &#125; 435.Non-overlapping Intervals12345678910111213141516171819// 如果按照start排序就取Math.min(r, intervals[i][1]);// 本代码按照end排序，所以r = intervals[i][1];即可public int eraseOverlapIntervals(int[][] intervals) &#123; if(intervals.length == 0)&#123; return 0; &#125; Arrays.sort(intervals, (item1, item2)-&gt;item1[1]-item2[1]); int output = 0; int r = intervals[0][1]; for(int i=1; i&lt;intervals.length; i++)&#123; if(intervals[i][0]&lt;r)&#123; output++; &#125; else&#123; r = intervals[i][1]; &#125; &#125; return output;&#125; Linked List 6206.Reverse Linked List反转链表，首先需要定义一个pre指针代表上一个Node，cur代表当前Node。 然后每一轮循环中新建一个Next，当前cur.next指向前pre，前pre指向当前cur，当前指向Next。 head已经是链表中的第一个节点了，不存在head.next是第一个节点。 1234567891011public ListNode reverseList(ListNode head) &#123; ListNode pre = null; ListNode cur = head; while(cur !=null)&#123; ListNode next = cur.next; cur.next = pre; pre=cur; cur = next; &#125; return pre;&#125; 141.Linked List Cycle 本题思路简单判断linkedlist是否有环。 思路是做一个set或者数组作为查重，当访问过的点再次被访问，就返回true。 12345678910public boolean hasCycle(ListNode head) &#123; Set&lt;ListNode&gt; set = new HashSet&lt;&gt;(); while(head!=null)&#123; if(!set.add(head))&#123; return true; &#125; head = head.next; &#125; return false;&#125; 21.Merge Two Sorted Lists要定义一个Head位置，否则splice之后找不到这个新链表的头了。 1234567891011121314151617public ListNode mergeTwoLists(ListNode list1, ListNode list2) &#123; ListNode preNode = new ListNode(-1); ListNode cur = preNode; while(list2 !=null &amp;&amp; list1 != null)&#123; if(list1.val &lt;= list2.val)&#123; cur.next = list1; cur = cur.next; list1 = list1.next; &#125; else&#123; cur.next = list2; cur = cur.next; list2 = list2.next; &#125; &#125; cur.next = list1 == null? list2 : list1; return preNode.next;&#125; 23.Merge k Sorted Lists (Hard)可以采用对21题目不对合并，或者两两合并，也可以用一个队列不断插入最小的节点的方式。 下面是利用PriorityQueue保证长度最大为k，每次poll都是当前队列中的最小的节点，并将它的下一个节点放入queue 123456789101112131415161718192021222324252627282930313233343536373839404142434445/** * Definition for singly-linked list. * public class ListNode &#123; * int val; * ListNode next; * ListNode() &#123;&#125; * ListNode(int val) &#123; this.val = val; &#125; * ListNode(int val, ListNode next) &#123; this.val = val; this.next = next; &#125; * &#125; */class Solution &#123; class Status implements Comparable&lt;Status&gt; &#123; int val; ListNode ptr; Status(int val, ListNode ptr)&#123; this.val = val; this.ptr = ptr; &#125; public int compareTo(Status status2)&#123; return this.val - status2.val; &#125; &#125; public ListNode mergeKLists(ListNode[] lists) &#123; PriorityQueue&lt;Status&gt; queue = new PriorityQueue&lt;&gt;(); for(ListNode node: lists)&#123; if(node != null)&#123; queue.offer(new Status(node.val, node)); &#125; &#125; ListNode head = new ListNode(0); ListNode tail = head; while(!queue.isEmpty())&#123; Status f = queue.poll(); tail.next = f.ptr; tail = tail.next; if(f.ptr.next != null)&#123; queue.offer(new Status(f.ptr.next.val, f.ptr.next)); &#125; &#125; return head.next; &#125;&#125; 19.Remove Nth Node From End of List双指针 1234567891011121314151617public ListNode removeNthFromEnd(ListNode head, int n) &#123; ListNode dummy = new ListNode(0, head); ListNode left = dummy; ListNode right = head; for(int i=0; i&lt;n; i++)&#123; if(right == null)&#123; return head; &#125; right = right.next; &#125; while(right != null)&#123; left = left.next; right = right.next; &#125; left.next = left.next.next; return dummy.next;&#125; 143.Reorder List自己想到的方法，将后半段压入stack中，注意寻找中心点奇数偶数不同 1234567891011121314151617181920212223242526272829303132public void reorderList(ListNode head) &#123; if(head == null)&#123; return; &#125; Deque&lt;ListNode&gt; stack = new LinkedList(); ListNode slowNode = head; ListNode quickNode = head; while(quickNode.next !=null &amp;&amp; quickNode.next.next!=null)&#123; slowNode = slowNode.next; quickNode = quickNode.next.next; &#125; ListNode secondNode = slowNode.next; ListNode midNode = slowNode; while(secondNode!=null)&#123; stack.push(secondNode); secondNode = secondNode.next; &#125; ListNode firstNode = new ListNode(-1, head); ListNode output = new ListNode(-1, head); while(stack.size()!=0)&#123; firstNode.next = head; head = head.next; firstNode = firstNode.next; firstNode.next = stack.pop(); firstNode = firstNode.next; &#125; if(head==slowNode)&#123; firstNode.next = head; &#125; head.next = null; head = output.next;&#125; Matrix 这一章都是体力活，面试大概率不考73.Set Matrix 矩阵 Zeroes遍历两次二维数组，记录横纵坐标 12345678910111213141516171819202122232425262728public void setZeroes(int[][] matrix) &#123; if(matrix.length == 0)&#123; return; &#125; int m = matrix.length; int n = matrix[0].length; Set&lt;Integer&gt; col = new HashSet&lt;&gt;(); Set&lt;Integer&gt; row = new HashSet&lt;&gt;(); for(int i=0; i&lt;m; i++)&#123; for(int j=0; j&lt;n; j++)&#123; if(matrix[i][j] == 0)&#123; row.add(i); col.add(j); &#125; &#125; &#125; for(int i=0; i&lt;m; i++)&#123; if(row.contains(i))&#123; matrix[i] = new int[n]; continue; &#125; for(int j=0; j&lt;n; j++)&#123; if(col.contains(j))&#123; matrix[i][j] = 0; &#125; &#125; &#125;&#125; 54.Spiral Matrix官方解法太麻烦，下面评论给出新思路 123456789101112131415161718192021222324252627public List&lt;Integer&gt; spiralOrder(int[][] matrix) &#123; List&lt;Integer&gt; ans = new ArrayList&lt;&gt;(); if (matrix == null || matrix.length == 0 || matrix[0].length == 0) return ans; int u = 0, d = matrix.length - 1; int l = 0, r = matrix[0].length - 1; while (true) &#123; for (int i = l; i &lt;= r; i++) &#123; // 左-&gt;右 ans.add(matrix[u][i]); &#125; if (++u &gt; d) break; for (int i = u; i &lt;= d; i++) &#123; // 上-&gt;下 ans.add(matrix[i][r]); &#125; if (--r &lt; l) break; for (int i = r; i &gt;= l; i--) &#123; // 右-&gt;左 ans.add(matrix[d][i]); &#125; if (--d &lt; u) break; for (int i = d; i &gt;= u; i--) &#123; // 下-&gt;上 ans.add(matrix[i][l]); &#125; if (++l &gt; r) break; &#125; return ans;&#125; 48.Rotate Image先上下翻转，再对角线翻转 12345678910111213141516171819202122public void rotate(int[][] matrix) &#123; int n = matrix.length; // 上下翻转 for (int i = 0; i &lt; n / 2; i++) &#123; for (int j = 0; j &lt; n; j++) &#123; int tmp = matrix[i][j]; matrix[i][j] = matrix[n - 1 -i][j]; matrix[n - 1 -i][j] = tmp; &#125; &#125; // 左斜对角线(\\)翻转 for(int i = 0; i &lt; n; i++) &#123; // 第二层遍历终止条件为 j &lt; i for(int j = 0; j &lt; i; j++) &#123; int tmp = matrix[i][j]; matrix[i][j] = matrix[j][i]; matrix[j][i] = tmp; &#125; &#125;&#125; 79.Word Search12345678910111213141516171819202122232425262728293031323334353637383940public boolean exist(char[][] board, String word) &#123; int h = board.length, w = board[0].length; boolean[][] visited = new boolean[h][w]; for (int i = 0; i &lt; h; i++) &#123; for (int j = 0; j &lt; w; j++) &#123; visited = new boolean[h][w]; boolean flag = check(board, visited, i, j, word, 0); if (flag) &#123; return true; &#125; &#125; &#125; return false; &#125; public boolean check(char[][] board, boolean[][] visited, int i, int j, String s, int k) &#123; if (board[i][j] != s.charAt(k)) &#123; return false; &#125; else if (k == s.length() - 1) &#123; return true; &#125; visited[i][j] = true; int[][] directions = &#123;&#123;0, 1&#125;, &#123;0, -1&#125;, &#123;1, 0&#125;, &#123;-1, 0&#125;&#125;; boolean result = false; for (int[] dir : directions) &#123; int newi = i + dir[0], newj = j + dir[1]; if (newi &gt;= 0 &amp;&amp; newi &lt; board.length &amp;&amp; newj &gt;= 0 &amp;&amp; newj &lt; board[0].length) &#123; if (!visited[newi][newj]) &#123; boolean flag = check(board, visited, newi, newj, s, k + 1); if (flag) &#123; result = true; break; &#125; &#125; &#125; &#125; visited[i][j] = false; return result; &#125; String3.Longest Substring Without Repeating Characters滑动窗口的概念反应不过来，我用的是Map记录字符出现的最新位置的方法 字符串长度用str.length() 根据循环中的字符是否是重复字符，来决定left的边界是否右移。对于外循环来说，只要遍历所有字符，知道字符串结束，每轮i，会有对应i的最佳不重复的left。对比每轮的长度，得到最后的logest 1234567891011121314151617// 用map记录字符出现的lastest index，每次比较start index和output，最后返回outputpublic int lengthOfLongestSubstring(String s) &#123; int output = 0; int start = 0; Map&lt;Character, Integer&gt; hashmap = new HashMap(); int len = s.length(); for(int i=0; i&lt;len; i++)&#123; Character ch = s.charAt(i); if(hashmap.containsKey(ch))&#123; start = Math.max(hashmap.get(ch) + 1, start); &#125; output = Math.max(1+i-start, output); hashmap.put(ch, i); &#125; return output;&#125; 424.Longest Repeating Character Replacement滑动窗口思路，只用记录滑动窗口的长度。窗口长度只会变长，每次left向左收敛只收敛1。 记录每个字符出现的频率，left向右走一步就频率减一，right向右走一步就频率加1. 当窗口长度等于最大的字符频率+k。如果窗口长了，则left+1，然后取每次与result比较 1char[] charArray = s.toCharArray(); 滑动窗口 12345678910111213141516171819public int characterReplacement(String s, int k) &#123; int output = 0; int left = 0; int right = 0; int len = s.length(); int maxn = 0; int[] record = new int[26]; for(int i=0; i&lt;len; i++)&#123; char cur = s.charAt(i); record[cur-&#x27;A&#x27;]++; maxn = Math.max(record[cur-&#x27;A&#x27;], maxn); if(right+1-left&gt;maxn + k)&#123; record[s.charAt(left) - &#x27;A&#x27;]--; left++; &#125; right++; &#125; return right - left;&#125; 76.Minimum Window Substring （Hard）242.Valid Anagram （掌握题不用看）相同字母异序词 非常简单的题，哈希表一次过 长度不同直接返回false，用一个长度26的数组统计频率，然后再统计另一个字符串的字符频率，出现负数直接返回false。 49.Group Anagrams按照字符分组 题目本身不复杂，用到的方法有点繁琐，注意返回值的写法 123456新建HashMap&lt;String, List&lt;String&gt;&gt; key表示每个item的字母排序，value是实际的itemstr.toCharArray()new String(array)map.getOrDefault(key, new ArrayList&lt;String&gt;())return new ArrayList&lt;List&lt;String&gt;&gt;(map.values()); 123456789101112public List&lt;List&lt;String&gt;&gt; groupAnagrams(String[] strs) &#123; Map&lt;String, List&lt;String&gt;&gt; map = new HashMap(); for(String str:strs)&#123; char[] cur = str.toCharArray(); Arrays.sort(cur); String key = new String(cur); List&lt;String&gt; list = map.getOrDefault(key, new ArrayList&lt;String&gt;()); list.add(str); map.put(key, list); &#125; return new ArrayList&lt;List&lt;String&gt;&gt;(map.values());&#125; 20.Valid Parentheses(圆括号)本题考察对栈stack的运用，大量方法需要记住 1234567891011121314151617//用栈的原理，先让一个特殊字符?入栈，如果这个特殊字符出栈（被调取），则返回false。//做括号就入栈，右括号就从栈里匹配左括号出栈，类似扑克牌抽对。//匹配结束后，看栈里的字符是否为1，?避免有左括号在栈中//或者用peep()也可以,空栈返回null，null和Character可以==比较，但不能和基本数据类型比较private static final Map&lt;Character,Character&gt; map = new HashMap&lt;Character,Character&gt;()&#123;&#123; put(&#x27;&#123;&#x27;,&#x27;&#125;&#x27;); put(&#x27;[&#x27;,&#x27;]&#x27;); put(&#x27;(&#x27;,&#x27;)&#x27;);&#125;&#125;;public boolean isValid(String s) &#123; // if(s.length() &gt; 0 &amp;&amp; !map.containsKey(s.charAt(0))) return false; LinkedList&lt;Character&gt; stack = new LinkedList&lt;Character&gt;() &#123;&#123; add(&#x27;?&#x27;); &#125;&#125;; for(Character c : s.toCharArray())&#123; if(map.containsKey(c)) stack.addLast(c); else if(map.get(stack.removeLast()) != c) return false; &#125; return stack.size() == 1;&#125; 125.Valid Palindrome左右双指针 1234判断字符是不是字母或者数字Character.isLetterOrDigit(s.charAt(left))sgood.append(Character.toLowerCase(ch));StringBuffer sgood_rev = new StringBuffer(sgood).reverse(); 123456789101112131415161718public boolean isPalindrome(String s) &#123; StringBuffer sb = new StringBuffer(); for(char c:s.toCharArray())&#123; if(Character.isLetterOrDigit(c))&#123; sb.append(Character.toUpperCase(c)); &#125; &#125; int r = sb.length()-1; int l = 0; while(l&lt;r)&#123; if(sb.charAt(l) != sb.charAt(r))&#123; return false; &#125; l++; r--; &#125; return true;&#125; 5.Longest Palindromic Substring1.动态规划，策略详见 12https://alchemist-al.com/algorithms/longest-palindromic-substring 分为三种情况：1. 长度为1，每个字符都是palindrome 2. 长度为2，则对比这2个字符 3. 长度大于2，则用状态转移方程则先对比，再查看第i+1, j-1的结果。 2.中心扩展 for循环遍历每个item作为中心点，以中心点或者中心点和中心点+1作为中心向两边扩张，直到不是回文。 记录每次的最大记录。 123456789101112131415161718192021222324252627282930313233343536373839404142public String longestPalindrome(String s) &#123; if(s.length()&lt;2)&#123; return s; &#125; int output = 0; int outputl = 0; int outputr = 0; int len = s.length(); for(int i=0; i&lt;len; i++)&#123; int l = i; int r = i; while(l&gt;=0 &amp;&amp; r&lt;len)&#123; if(s.charAt(l) == s.charAt(r))&#123; if(r-l+1 &gt; output)&#123; outputr=r; outputl = l; output= r-l+1; &#125; l--; r++; &#125; else&#123; break; &#125; &#125; l = i; r = i+1; while(l&gt;=0 &amp;&amp; r&lt;len)&#123; if(s.charAt(l) == s.charAt(r))&#123; if(r-l+1 &gt; output)&#123; outputr=r; outputl = l; output= r-l+1; &#125; l--; r++; &#125; else&#123; break; &#125; &#125; &#125; return s.substring(outputl, outputr+1);&#125; 3.马拉车，这是真复杂，不想看了 647.Palindromic Substrings其实跟上边那题目一样，只是返回值不同 1234567891011121314151617181920212223242526272829303132public int countSubstrings(String s) &#123; if(s.length()&lt;2)&#123; return s.length(); &#125; int len = s.length(); int result = 0; for(int i=0; i&lt;len; i++)&#123; int l = i; int r = i; while(l&gt;=0 &amp;&amp; r&lt;len)&#123; if(s.charAt(l) == s.charAt(r))&#123; result++; l--; r++; &#125; else&#123; break; &#125; &#125; l = i; r = i+1; while(l&gt;=0 &amp;&amp; r&lt;len)&#123; if(s.charAt(l) == s.charAt(r))&#123; result++; l--; r++; &#125; else&#123; break; &#125; &#125; &#125; return result; &#125; 计算Palin drome的时候，要考虑奇数偶数，用小于2n-1限制i，i&#x2F;2和i&#x2F;2+n%2确定左右边界。当i为偶数，左右边界相同，i为奇数，r比l大1，左右边界以中心线为对称线。 1234567801234i n 2n-1 L R0 5 9 0 01 5 9 0 12 1 13 1 27 5 9 3 48 5 9 4 4 第二种方法是Manacher 271.encode and decode strings 这题是会员题目。。。12345678910111213141516171819public String encode(List&lt;String&gt; strs)&#123; StringBuilder sb = new StringBuilder(); for(String str : strs)&#123; sb.append(str.length()).append(&quot;/&quot;).append(str); &#125; return sb.toString();&#125;public List&lt;String&gt; decode(String s)&#123; List&lt;String&gt; res = new ArrayList&lt;&gt;(); int i=0; while(i&lt;s.length())&#123; int slash = s.indexOf(&#x27;/&#x27;, i); int size = Integer.valueOf(s.substring(i, slash)); res.add(s.substring(slash + 1, slash + 1 + size)); i = slash + 1 + size; // 防止非各位数字 for example: 16 &#125; return res;&#125; Tree104.Maximum Depth of Binary Tree如果用DFS，则 max(l,r)+1 BFD, 则每次扩展到下一层深度+1 12345678910public int maxDepth(TreeNode root) &#123; int ans = 0; if(root == null)&#123; return 0; &#125; else&#123; int left = maxDepth(root.left) + 1; int right = maxDepth(root.right) + 1; return Math.max(left, right); &#125;&#125; 1234567891011121314151617181920212223 public int maxDepth(TreeNode root) &#123;if(root == null)&#123; return 0; &#125; int ans = 0; Queue&lt;TreeNode&gt; queue = new LinkedList(); queue.offer(root); while(!queue.isEmpty())&#123; int size = queue.size(); while(size &gt; 0)&#123; TreeNode node = queue.poll(); if(node.left != null)&#123; queue.offer(node.left); &#125; if(node.right != null)&#123; queue.offer(node.right); &#125; size--; &#125; ans++; &#125;return ans; &#125; 100.Same Tree判断两个binary tree 是否 identical， 用BFS，DFS. BFS最后要看Queue里面是否为空，否则二者长度不同，肯定不相等。 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556/ public boolean isSameTree(TreeNode p, TreeNode q) &#123; // if(p==null &amp;&amp; q==null)&#123; // return true; // &#125; // if(p!=null &amp;&amp; q!=null &amp;&amp; p.val == q.val)&#123; // // 下一层 // return isSameTree(p.left, q.left) &amp;&amp; isSameTree(p.right, q.right); // &#125; else &#123; // return false; // &#125; // &#125; public boolean isSameTree(TreeNode p, TreeNode q) &#123; if(p==null &amp;&amp; q==null)&#123; return true; &#125; else if(p==null ^ q==null) &#123; return false; &#125; else&#123; // 都不为空就真的要对比值 if(p.val != q.val)&#123; return false; &#125; else&#123; Queue&lt;TreeNode&gt; q1 = new LinkedList(); Queue&lt;TreeNode&gt; q2 = new LinkedList(); q1.offer(p); q2.offer(q); while(!q1.isEmpty() &amp;&amp; !q2.isEmpty())&#123; TreeNode one= q1.poll(); TreeNode two= q2.poll(); if(one.val != two.val)&#123; return false; &#125; TreeNode l1 = one.left; TreeNode r1 = one.right; TreeNode l2 = two.left; TreeNode r2 = two.right; if(l1==null ^ l2==null)&#123; return false; &#125; if(r1==null ^ r2==null)&#123; return false; &#125; if(l1!=null &amp;&amp; l2!=null)&#123; q1.offer(l1); q2.offer(l2); &#125; if(r1!=null &amp;&amp; r2!=null)&#123; q1.offer(r1); q2.offer(r2); &#125; &#125; return q1.isEmpty() &amp;&amp; q2.isEmpty(); &#125; &#125; &#125; 226.Invert Binary Tree左右翻转 123456789public TreeNode invertTree(TreeNode root) &#123; if(root == null)&#123; return root; &#125; TreeNode temp = root.left; root.left = invertTree(root.right); root.right=invertTree(temp); return root;&#125; 124.Binary Tree Maximum Path Sum （Hard）递归，返回包含当前节点的最大半截链。返回结果是历史最大长链。 123456789101112131415161718public int ans = Integer.MIN_VALUE;public int maxPathSum(TreeNode root) &#123; // 返回当前节点的最大贡献值 // return the maximum donation of current node maxDon(root); return ans; // 因为返回的值，不是递归的返回值(含当前节点的半截链)，是其中的链最大值&#125;public int maxDon(TreeNode root)&#123; if(root == null)&#123; return 0; &#125; int left = Math.max(0, maxDon(root.left)); int right = Math.max(0, maxDon(root.right)); int donation = root.val + left + right; ans = Math.max(ans, donation); return root.val + Math.max(left, right);&#125; 123456789101112131415161718192021public TreeNode invertTree(TreeNode root) &#123; if(root == null)&#123; return root; &#125; Queue&lt;TreeNode&gt; queue = new LinkedList&lt;&gt;(); queue.offer(root); while(!queue.isEmpty())&#123; TreeNode node = queue.poll(); TreeNode temp = node.left; node.left = node.right; node.right = temp; if(node.left != null)&#123; queue.offer(node.left); &#125; if(node.right!=null)&#123; queue.offer(node.right); &#125; &#125; return root;&#125; 102.Binary Tree Level Order Traversal广度优先遍历，要求结果一层一个数组（list） 12注意generics的写法List&lt;List&lt;Integer&gt;&gt; ret = new ArrayList&lt;List&lt;Integer&gt;&gt;(); 1234567891011121314151617181920212223242526public List&lt;List&lt;Integer&gt;&gt; levelOrder(TreeNode root) &#123; List&lt;List&lt;Integer&gt;&gt; ret = new ArrayList&lt;List&lt;Integer&gt;&gt;(); if (root == null) &#123; return ret; &#125; Queue&lt;TreeNode&gt; queue = new LinkedList&lt;TreeNode&gt;(); queue.offer(root); while (!queue.isEmpty()) &#123; List&lt;Integer&gt; level = new ArrayList&lt;Integer&gt;(); int currentLevelSize = queue.size(); for (int i = 1; i &lt;= currentLevelSize; ++i) &#123; TreeNode node = queue.poll(); level.add(node.val); if (node.left != null) &#123; queue.offer(node.left); &#125; if (node.right != null) &#123; queue.offer(node.right); &#125; &#125; ret.add(level); &#125; return ret;&#125; 297.Serialize and Deserialize Binary Tree123数组转ListArrays.asList(strings[])List&lt;String&gt; list = new ArrayList(Arrays.asList(strings[])); 体力活，不想看，官方是先序遍历 572.Subtree of Another Tree这不遍历加对比么，样本要一直对比到Null节点 遍历对比的时间负责都是 O(∣s∣×∣t∣)，后面的两种方法可以缩短发杂度，但比较复杂 105.Construct Binary Tree from Preorder and Inorder Traversal用前序遍历和中序遍历构造二叉树 用确定根节点的方法可以构建找个结构，Otime为n，每次调用递归可以得到一个根节点的位置。 123456789101112131415161718192021222324252627282930313233343536// preorder = [3,9,20,15,7], inorder = [9,3,15,20,7]private Map&lt;Integer, Integer&gt; indexMap;public TreeNode myBuildTree(int[] preorder, int[] inorder, int preorder_left, int preorder_right, int inorder_left, int inorder_right) &#123; if (preorder_left &gt; preorder_right) &#123; return null; &#125; // 前序遍历中的第一个节点就是根节点 int preorder_root = preorder_left; // 在中序遍历中定位根节点 int inorder_root = indexMap.get(preorder[preorder_root]); // 先把根节点建立出来 TreeNode root = new TreeNode(preorder[preorder_root]); // 得到左子树中的节点数目 int size_left_subtree = inorder_root - inorder_left; // 递归地构造左子树，并连接到根节点 // 先序遍历中「从 左边界+1 开始的 size_left_subtree」个元素就对应了中序遍历中「从 左边界 开始到 根节点定位-1」的元素 root.left = myBuildTree(preorder, inorder, preorder_left + 1, preorder_left + size_left_subtree, inorder_left, inorder_root - 1); // 递归地构造右子树，并连接到根节点 // 先序遍历中「从 左边界+1+左子树节点数目 开始到 右边界」的元素就对应了中序遍历中「从 根节点定位+1 到 右边界」的元素 root.right = myBuildTree(preorder, inorder, preorder_left + size_left_subtree + 1, preorder_right, inorder_root + 1, inorder_right); return root;&#125;public TreeNode buildTree(int[] preorder, int[] inorder) &#123; int n = preorder.length; // 构造哈希映射，帮助我们快速定位根节点 indexMap = new HashMap&lt;Integer, Integer&gt;(); for (int i = 0; i &lt; n; i++) &#123; indexMap.put(inorder[i], i); &#125; return myBuildTree(preorder, inorder, 0, n - 1, 0, n - 1);&#125; 98.Validate Binary Search Tree230.Kth Smallest Element in a BST1中序遍历，基本思想是利用Stack，两个While循环，内循环压入左节点，外循环弹出节点并且压入右侧节点 1234567891011121314151617// 中序遍历public int kthSmallest(TreeNode root, int k) &#123; Deque&lt;TreeNode&gt; stack = new ArrayDeque&lt;&gt;(); while(!stack.isEmpty() || root!=null)&#123; while(root!=null)&#123; stack.push(root); root = root.left; &#125; TreeNode cur = stack.pop(); k--; if(k==0)&#123; return cur.val; &#125; root = cur.right; &#125; return 0;&#125; 1234567891011121314151617181920public int kthSmallest(TreeNode root, int k) &#123; int leftNodes = countNodes(root.left); if(leftNodes &lt; k - 1)&#123; //答案存在右子树中 return kthSmallest(root.right,k - leftNodes - 1); &#125;else if(leftNodes == k - 1)&#123; return root.val; &#125;else&#123; return kthSmallest(root.left,k); &#125;&#125;//左神递归套路分析左右子树返回信息只需要节点数，因此无需额外定义数据结构public int countNodes(TreeNode root)&#123; //base case返回0 if(root == null) return 0; //递归处理左右子树并接收返回值 int leftNodes = countNodes(root.left); int rightNodes = countNodes(root.right); //判断分析本层递归返回值的具体值 return leftNodes + rightNodes + 1;&#125; 235.Lowest Common Ancestor of Binary Search Tree1234567891011121314// 一次遍历法public TreeNode lowestCommonAncestor(TreeNode root, TreeNode p, TreeNode q) &#123; TreeNode ancestor = root; while(ancestor != null)&#123; if(ancestor.val &gt; p.val &amp;&amp; ancestor.val &gt; q.val)&#123; ancestor = ancestor.left; &#125; else if(ancestor.val &lt; p.val &amp;&amp; ancestor.val &lt; q.val)&#123; ancestor = ancestor.right; &#125; else&#123; break; &#125; &#125; return ancestor;&#125; Heap23.重复题目，不做展示 347.Top K Frequent Elements123456789101112131415161718192021222324252627282930// 最小堆public int[] topKFrequent(int[] nums, int k) &#123; Map&lt;Integer, Integer&gt; occurrences = new HashMap&lt;Integer, Integer&gt;(); for (int num : nums) &#123; occurrences.put(num, occurrences.getOrDefault(num, 0) + 1); &#125; // int[] 的第一个元素代表数组的值，第二个元素代表了该值出现的次数 PriorityQueue&lt;int[]&gt; queue = new PriorityQueue&lt;int[]&gt;(new Comparator&lt;int[]&gt;() &#123; public int compare(int[] m, int[] n) &#123; return m[1] - n[1]; &#125; &#125;); for (Map.Entry&lt;Integer, Integer&gt; entry : occurrences.entrySet()) &#123; int num = entry.getKey(), count = entry.getValue(); if (queue.size() == k) &#123; if (queue.peek()[1] &lt; count) &#123; queue.poll(); queue.offer(new int[]&#123;num, count&#125;); &#125; &#125; else &#123; queue.offer(new int[]&#123;num, count&#125;); &#125; &#125; int[] ret = new int[k]; for (int i = 0; i &lt; k; ++i) &#123; ret[i] = queue.poll()[0]; &#125; return ret;&#125; 295.Find Median from Data Stream (Hard)","categories":[{"name":"leetcode","slug":"leetcode","permalink":"http://example.com/categories/leetcode/"}],"tags":[{"name":"leetcode","slug":"leetcode","permalink":"http://example.com/tags/leetcode/"}]},{"title":"Horseman BoJack","slug":"Bojack","date":"2024-09-26T19:00:00.000Z","updated":"2024-10-02T19:02:17.225Z","comments":true,"path":"2024/09/26/Bojack/","permalink":"http://example.com/2024/09/26/Bojack/","excerpt":"","text":"Horseman BoJack[TOC] S01E01situation comedy 情景喜剧 premiere v.n. 首映 premiered on 首映于。。 1The show, in which a young, bachelor horse is forced to reevaluate his priorities when he agrees to raise three human children, was initially dismissed by critics as broad and saccharine and not good, but the family comedy struck a chord with America and went on to air for nine seasons. is forced to 被迫。。 reevaluate v 重新考虑 dismiss v 驳回，放弃，解雇 critic n 批评家，批判者，反对者 broad a 宽广的；粗俗的，土味十足的 saccharine a 夸张的，故作多情的 struck a chord with 与。。产生共鸣 strike 敲击，捶打，打击，罢工 go on to air 继续直播 go on 继续 go on doing something&#x2F; go on with something park in 停车停在 handicapped spot 残障停车位&#x2F;区域 handicap 障碍，残障，弱智 v 妨碍 这个词语形容残疾人的时候略贬义 spot 斑点，污渍；疱疹；位置，地点，场所 parking spot&#x2F; parking lot 停机坪、停车场 disabled spot 残疾人专用区域 proper a 适合的 nomenclature 术语，命名法，名称 terminology 术语 nailing &lt;俚语&gt; 极好的&#x2F;极好地 nail本来是钉子的意思 我分析这个词后面直接加名词 I am nailing this interview. 这个词语源于hit the nail on the head 表示一针见血 12345678“Nailing” 确实可以用来表示某人把某件事做得非常棒，通常带有完成得很出色或精准的意思。以下是几个用 “nailing” 造的句子：She’s really nailing that presentation—the audience is totally engaged.You’ve been nailing every coding challenge lately, keep up the great work!He nailed the interview and got the job offer on the spot.After weeks of practice, they’re finally nailing the choreography for the performance.You’re nailing this recipe—it tastes amazing!在这些句子中，“nailing” 都表示某人成功地、出色地完成了某件事 appeal 上诉，吸引力 wide appeal 广泛的吸引力 attribute n 属性，象征 v 归因于 PS.这句开头用to是因为attribute to 归因于。。 1To what do you attribute the show&#x27;s wide appeal? shit all over 把。。贬的一文不值 我觉得这么理解文雅一点 solid 坚实可靠的； 固体 urethra 尿道，膀胱 cancellation 取消 Uhmmmmm 这里的无语奠定了本剧的灰暗悲惨的基调。。。。。 gloomy a 阴沉的，阴郁的 roomie 室友 roommate ie构词法 houseguest 在家过夜或者赞助的客人 put labels on things 给事物下定义&#x2F;贴标签 tapeworm 绦虫，寄生虫 parasitic 寄生的，依附性的 less parasitic &#x3D;&#x3D; independent 注意parasitic的重音 in the first place 首先，最开始 kick somebody out 把某人赶出去 secretly 背地里地，暗地里地 approve of v赞成 alternative a 另类的，非传统的 印象里总是形容交替的 realize by 意识到 meant 注意过去式的写法和发音 that’s on you 都是你的责任 assumption 猜测，假设 1That&#x27;s on you for making assumptions. 都怪你瞎猜 strudel 点心，发面卷 （发音：死猪头 表示苹果派等）toaster strudel 1I would have invited you to my office, but the electric company shut off our power. would have done 本来会。。。 shut off power 切断，关掉，拉闸断电 penguin 企鹅 be eager to do 非常渴望做 memoir 回忆录 keep missing your deadlines 一直错过最后期限&#x2F;一直拖延 make great progress 取得重大进展 bestseller 畅销书 money wise 或者 money-wise adv 金钱方面，金钱至上 1234Aren&#x27;t you an editor at a major publishing house?Yeah, a publishing house.When was the last time you saw a book? 注意这个问句I thought I saw someone reading one in the park the other day, but it turned out it was a takeout menu. the other day 上次，几天前 turn out 结果是 takeout 外带，外卖；取出 month to month 逐月，按月 Pinky说 We’re living month to month here. 的意思是 what we earn in one month we spend in the same month. 也就是传说中的“月光” count on v 指望 autobiography 自传 ghostwriter 枪手 knock your ass back to the South Pole 惊讶到把你震回南极 a top priority for me 对我来说是第一位 prom n 舞会 1I improvised that line. improvise v 即兴临场创作 line n 台词 spin 表示风格 give something a spin 一般指对。。进行了修改 it works on every level 一语双关 orphan 孤儿 weigh v 重达 1Todd, I weigh over 1,200 pounds. 我重1200绑以上。 bum out 逐出；伤心 bum 屁股，懒汉；乞讨；使灰心 princess 王妃，公主 dump — dumped you甩了你 check out v 检查，退房，口语里有快看的意思 rug n 小毯子，用于讽刺假发 1Who does he think he&#x27;s fooling? fool somebody 骗某人 embarrass somebody 让某人尴尬 12I am not crazy about the bread here.Why do I keep eating it? be crazy about something 喜欢某物 undivided 专一的，未分开的 undevided attention 1You have my undivided attention. 表达我全神贯注地听你阐述 1I think we should see other people. 直译：我认为我们应该和别人约会了。 cruller 油炸麻花，油炸面包圈 That’s a horse of a different color. Mulligan 人名。。美国俚语：蔬菜烩肉 1Are you embarrassed of me because I&#x27;m a has-been? embarrassed of somebody 被动语态：因为某人丢脸 has-been 过气名人 advance n 进步；预付款 v 提前，进步 这里是预付稿费的意思 explicitly 明确地，显然地 step away 走开，让开 run away 逃走，抛开 1I was running away from my girlfriend whom I don&#x27;t respect enough to have a baby with. face it 承认吧 be afraid of something commitment n 承诺 following through on 表示对某事的跟进 peanut butter 花生酱 crossover 跨界 sarcastic 讽刺的 12You&#x27;re being sarcastic, but I think it does actually get funnier every time.你在说反话（反讽） 1would it kill you to be civil? 礼貌点会死么？ 1Could we please have the check? 叫waiter买单时候这么说 premeal 餐前面包，正常是随便吃的 fat ass 大屁股 calories 卡路里 metabolize 新城代谢 1Couldn&#x27;t hear you over the sound of my calories not metabolizing. throw a party 举行一个party barf v 呕吐；n 呕吐物 duck and roll 蹲下然后滚翻 感觉这个动作描述类似前滚翻 duck 鸭子；蹲下 1I pride myself on my ability to separate my professional life from my personal life. pride on v 以。。为傲 separate v 分开，区别；a 单独的 catnip 猫薄荷 a pile of crap 一坨屎 用pile masturbate v 手淫，打飞机 dire a 危急的，糟糕的 strait 海峡，困境 investment 投资 franchise v.n 特许，经营权 scary 恐怖的，吓人的 swamp 沼泽 grew up before our eyes 在我们眼前长大 secretariat 秘书处；一代骄马 personal hero 个人英雄，心目中的偶像 off the ground 起步 1Could never get the project off the ground. swag box 礼品盒 1easy for you to say, you hippie. hippie 嬉皮士 ie结构 小垃圾的意思 turf n 草皮，地皮 v 用草皮覆盖 better question 更好的问题 这里表示我更想知道的是 dummy 笨蛋 sitcom 情景喜剧 obsess v 痴迷 hand it off to somebody 交给某人 one shot 一击 preserve 保留 legacy 遗产 12This book is my one shot at preserving my legacy.这本书是让我一举流芳百世的遗产。 washed-up 疲倦，不行了的 hack 老家伙 finale 结局，剧终 12We might have gone too dark on that series finale.我们可能在最后一集里太黑暗了。 live off 依靠。。。谋生 make a living 谋生 123Your silence speaks volumes.你的沉默说明了一切。That was my intention. intention n 意图，目的 mild a 温和的，轻度的 anxiety 焦虑 attack v.n 攻击 在这是发作的意思 spicy a辛辣的，刺激的 在这是重度的 salsa joke n 冷笑话 overstressed 压力大 stress somebody out 给某人施加压力 consistent 一致的，始终如一的 pity 怜悯 casual 随便的，轻松的 1I totally hear what you are saying. 我理解你在说什么 senor 先生 西班牙语 generosity n 慷慨，大方 variety of folks 多种多样的人 quinceanera 西语的15岁成人礼 all walks of life 各界人士 racist 种族主义者 pendant 吊坠 kid around 开玩笑 catch up 赶上 在这表示继续谈话，聊天，叙旧 It’s was nice to catch up with you. furious a 狂怒的，激烈的 这里表示兴奋的 mispronounce 发错音 mingle 混合，交融，交际 anxious 焦虑的 broad sense a 广义的 n 宽泛的意义 broad 本集开场出现这个词表示 a 粗俗的in a real broad sense 广义上来说 overthinking 想多了 compliment v.n 赞美，问候 P.S.我们在EnglishPod里学过complimentary a 免费的 throw away 抛弃，浪费，失去 12Yeah, well, if your&#x27;re gonna throw away most of your adult life on some dumb sitcom, you might as well get a sweet house out of the deal, right?&quot;out of the deal&quot; 的意思是 &quot;从这件事情中&quot; 或 &quot;作为这件事的回报&quot; autograph 亲笔签名 miserable 可怜的，不幸的 envy 嫉妒 profoundly adv 深刻地，严重地 get sick of me 厌烦我 1You would probably get sick of me. 你可能会烦我 that doesn’t count 那不算数 on the clock 正在上班 这里表示我们还没正式签约呢 you got it 没毛病，没问题 penis 阴茎 vagina 阴道 S01E02say when 倒酒场合：你说停就停 when 停 definitely adv 绝对地 hilarious 滑稽的，可笑的 get over here 过来吧 get over 克服 Don’t put things in my butt “别逼我”的非常粗俗的说法 1Don&#x27;t put things in my butt if you want them back. warhorse 战马 set 安排好的 we are all set. catty a 刁钻刻薄的，阴险的 1Laura, do not respond to him. decency n 得体，正派，礼貌 crappy a 劣质的，糟糕的 crap 拉屎，垃圾，废话 self-conscious a 不自然的，刻意的 than ever 比以往任何时候都。。 be used to doing 习惯做。。 get away with things 逃避责任，随心所欲 have an effect on somebody 影响别人 regrettable 令人遗憾的，令人惋惜的 1234That better not be my last Toaster Strudel.这最好不是我最后一个烤果馅卷。&quot;That better not be my last Toaster Strudel&quot;：这是常见的口语简略形式，省略了 &quot;had&quot; (即 &quot;That had better not...&quot;)，但是在口语中人们常常这样表达，语法虽然不完全正式，但广泛接受并且自然。&quot;That&#x27;d better not be my last Toaster Strudel&quot;：这是语法上更完整的表达，&quot;That&#x27;d&quot; 是 &quot;That had&quot; 的缩写，表示条件或期望的语气。这种形式在书面或正式的口语中更为规范。 show up 露面，出席 tranquilizer 镇静剂 dildo 假阳具 magenta 洋红，品红，品红色的 above board 正大光明的，都是上得了台面的 drop by 顺便拜访 123456I&#x27;ll drop by your office tomorrow to discuss the project.（我明天会顺便去你办公室讨论项目。）Feel free to drop by if you&#x27;re ever in the neighborhood.（如果你在附近，随时过来看看。）She decided to drop by the coffee shop on her way home.（她决定在回家的路上顺便去咖啡店。） old ball and chain 也就是wife 理解为老婆子 出自不想解释的某个典故，这个词语本意是带着铁球和铁锁链的犯人，这个铁链球参照海贼王里犯人戴的那种玩意。 brag v 吹嘘 cutting edge a 前沿的，潮的 edge 前沿 jelly 果冻，果酱 wordplay 文字游戏，俏皮话，双关语 story of my life 经常表示：这就是命，这就是我的生活 muffin 松饼 dibs on something 有权利。。。 123I had dibs on them.我对them有所有权。我对them有权利。Really? You had dibs? produce section 农产品区 pseudo-celebrity 伪名人 apply to 适用 saturate 浸透 routing number 识别码 maiden 少女，处女，未婚女子 omelet&#x2F;omelette 煎蛋卷 abortion 流产 get right into the big 直接来到高潮，一下子成名 fall down 跌倒，绊倒 simultaneously 同时地 cripple 瘸子，残疾人，使成为瘸子 Afghanistan 美帝出现频率超高的国家名字 call dibs on the last box of muffins 要了最后一盒松饼 antic 滑稽的；滑稽的动作 chortle v 开怀大笑 rapturous 兴高采烈的，热烈的 glee 高兴 frontlines 前线 elitism 精英主义，高人一等的优越感 guess what 常用插入语 set the record straight 弄清真相，澄清问题 feed off 以。。。为食 controversy 争论，辩论 dignify 使有尊严，抬高。。。的身价 1If you dignify the story with a response, it&#x27;s just gonna fan... ramp up 上升，提高 这里为一直说 ramp 本意是斜坡 slap 大嘴巴 legitimate 使合法；合情合理的 a good deal 就是 a deal 表示大量 mystery 神秘，奥秘 12how&#x27;d I come off?我表现得怎么样？come off 表现，举行 hooray 万岁，万岁 well-adjusted 适应性强 insurance 本意保险，这里理解为保证，能够 lima 利马，秘鲁首都 shoddy 劣质得，劣质品 craftsmanship 手艺 slack off 懈怠，偷懒 democrat 民主党人 The Democratic Party 民主党 intend 打算，计划 uneventful 平淡无奇的，平凡的 put a pin in this 暂停一下，别个别针在这 deconstruction 解构，拆析 spiral 螺旋式 12Your dibs were void.你的声明无效。 automatically 自动地，无意识地 这里表示默认地&#x2F;绝对地 12You took that the bad way.你曲解了我。 level v 是平整，坦诚相见，开诚布公 1I&#x27;m gonna level with you, honey. swallow 吞下，燕子 let up 中止 jerk off 打飞机 come up with 提出，想出 controversial 有争议的 unbearable 不能忍受(熊)的 cowardly 怯懦的 Arab 阿拉伯人 obscenely 下流的 entrepreneur 企业家 scam 欺诈 pun 一语双关 authentic 真实的，可信的，真正的 save the day 反败为胜，挽救大局 stale 陈旧的 bun 圆面包 这东西明明是InNOut扔了的汉堡面包，并且他80块钱早被日本妹子偷走了 far too often 太经常了 cheapen 减价，贬低 pawn 人质，走卒 ambivalent 矛盾情绪的 seemingly 似乎，表面上的 mandate 授权，强制执行 appropriate 恰当的 genre 类型，体裁 thrive 繁荣，茁壮成长 chunk 大量 catchphrase 标语，名言 warts and all 如实描述 wart 瘊子，肉赘 heiress 女继承人，女嗣 resent 愤恨，生气 tore it down 扯下来 hearty 亲切的，有好的，精力充沛的 screws 螺钉 S01E03recall 召回，回想起 prickly 多刺的 pop 突击，砰地爆炸 这里是个双关语 on my watch 在我眼皮底下 stick with me 跟着我 stick with 坚持 stick 粘贴，刺，忍受 boom 吊杆；激增 trailer 拖车 boob 蠢材，乳房 wad 填料，揉成团，使成沓 jerk wad 煞笔，在这里wad有“蠢货”的“货”字的意思 pop 这里又出现pop的第三个意思 popular album 专辑 jojo5里面的白色相簿 sophisticate 迷惑，使复杂；老于世故的人，见多识广的人 sophisticated 复杂巧妙的，精致的，见多识广的 dubstep 回响贝斯风格 wunderkind 神童 clitoris 阴蒂 ginormous 特大 学我凡凡 inspiration 灵感 shriveled 枯萎的，干瘪的 gross 臃肿的，肥胖的 delightful 使人快乐的，可爱 chirp 喳喳叫 refill 续杯，再填满 cannonball 炮弹，加农炮 reclaim 开垦，改造，回收 pier 桥墩，码头，支柱 grand 千元 hobo 流浪汉 made out of… 由。。制作成的 Confederate 同盟者，联盟的，在这里特指美国历史中南部同盟 bayonet 刺刀 1Do we need letter openers made out of Confederate bayonets? stain authentic 真正的，可信的 Yankee 美国北方人，南北战争时期北军士兵 shitty 令人厌恶的，糟糕的，差劲的 celebrity 名人 1It&#x27;s a really big deal. 这真是一件大事、真了不起。 tank n 坦克，邮箱 v 彻底失败，破产，倒闭，输掉比赛 1Because you know I&#x27;ll bleed for you. 我愿意为你流血，也就是中文的我愿意为你去死。 make a scene 大吵大闹，出洋相 limey 英国佬 bastard 混蛋，杂种 take a dump 上大号，大便 &lt;德普老婆。。。&gt;（区分大小便pee） propeller 螺旋桨 rehab rehabilitation 康复中心，戒毒所 catch up 与。。并驾齐驱，扰乱，赶上 appreciate 感激 relief 解脱，轻松 snort 毒品，用鼻子吸入 paramedic 护理人员，急救医生 put to bed 让。。睡觉，哄孩子睡觉 confront 面对，处理，对抗 head on 迎面地 tough break 很不幸，运气不佳 turd 粪便，可鄙的人 murmur 嘟囔，低语 1You&#x27;ll get the guest room when you&#x27;ve earned the guest room. 用earn表示有资格 lasagna 千层面，宽意大利面 DUI driving under the influence 酒驾（泛指药物影响驾驶） gore 刺伤，淤血 shat shit 的过去式 floor model 落地式模型 fly off the handle 失去控制，发脾气 audition 饰演，试镜 drop it 拉倒吧 basket case 废物，破鞋 PR Public Relations 公关 hurricane 飓风 stab 刺，戳，捅 duct tape 胶布 duct 管子 back it up 倒回去，你刚才说什么 white whale 白鲸，形容大鱼 lemur 狐猴 slow your roll 放慢你的脚步，慢慢来，别着急 rap sesh 饶舌音乐 uptight 紧张不安的，拘谨的 dickhead 蠢货 satirize 讽刺 celebrate 庆祝，赞扬 obsession 痴迷 feminist 女权主义者 sexuality 性行为，性欲，性征 entrench 根深蒂固 entrenched 根深蒂固的 patriarchal 父权的 mere 仅仅 incapable 没有能力的 infantilization 幼稚化 misogynistic 厌恶女人的 tap dance 踢踏舞 sleazy 劣质的，肮脏的 take it sleazy 接受低俗吧，就这样吧 我猜的，本集最后也有这句话解释为：低级庸俗点就成，这个短语是一句台词，难理解 circus 马戏团 head back 掉头 tub 桶，盆 makeup 化妆 compensate 补偿，弥补 fantasy 幻想 neglect 忽视，忽略 retroactively 追溯地，逆动地 cocaine 可卡因 booth 小房间，电话亭 harsh 残酷的，严厉的 vibe 气氛，情绪 catch phrase 口头禅，流行语 boundary 界限 在剧中的界限理解为管教的界限 hang out 出去闲逛，出去玩 milady 太太，对贵妇的称呼 gin 杜松子酒，三脚起重机 nutmeg 肉豆蔻 skybox 贵宾看台 roast 烤，烤肉 prestigious 有威望的，声誉高的 credits roll 工作人员表 ginormous 极大的，巨大的 pawnshop 当铺 get rid of something 拜托something，甩掉something pawn 典当；走卒 1It wasn&#x27;t personal. 这不是针对你。 gross 令人不快的，恶心的 way out off line 太离谱了 rugged 崎岖的，艰难的 masculine 男人的，男子汉的 formative 形成性，造型的 formative years 形成性格时期 lit 点燃，照亮的 ottoman 旧土耳其帝国的，褥榻，坐垫 widdle 小便，撒尿 put it out 熄灭 impractical 不现实的 the voice of reason 理性之音，理智的人 exhausting 令人疲惫不堪的 take advantage of 利用，占。。。的便宜 substance abuse 物质滥用，药物滥用 sycophant 谄媚者，马屁精 enabler 捧人的人 tragically 悲剧地 blow it 搞砸了 take responsibility for something 对某事负责 marble 大理石，弹珠 cruel 残酷的，冷酷的 S01E0412I can&#x27;t help it. 我也没辙。Keep this up, and the only thing we&#x27;re gonna get is our money back! shack 棚 material 料 1But then how do I know if they got it? 字幕的how打错了 stand-up 单人脱口秀，单口相声 big shots 大人物 feminism 女权运动 go down in the annals 被载入史册 annals编年史 locker room 更衣室 locker 有锁柜子的房间，也就是换衣服的房间，储物间 settle a bet 解决一个赌局，打个赌 cram 填，塞，挤 legally 合法地，法律地 blonde 金发女郎 coincidentally 巧合地 premise 前提，假设 feature 可以做动词 以。。为特征 extrovert 性格外向的 pumpkin 南瓜 cynical 愤世嫉俗的，悲观的 introvert 性格内向的 throw up 呕吐 excessive 过分的，过多的 consumption 消耗 refine 精炼，改善 refind 精炼的 obesity 肥胖 casual racism 漫不经心的种族主义 ham-fisted 笨手笨脚的 moronic 低能的 paradigm 范例，模范 organism 生物，有机体 internalize 内化，相信某事 prospect 前途，勘探 cirque 圆形马戏场 circus erotic 性欲的，色性的 overtone 暗示，弦外之音 pcychodrama 心理剧 grip psychodrama 扣人心弦 thriller 惊悚片 thrill本身是高兴，兴奋的意思 Utopia 乌托邦 剧里用的Newtopia 新托邦 123I&#x27;m in.I&#x27;m out.这两句在剧中理解为：我喜欢，我不喜欢。玩牌可以理解为我跟，我不跟。 loam 沃土 agricultural 农业的 lightly 轻率的，轻松的 unruly 难以驾驭的，任性的 flourish 繁荣兴旺，成才的 stately 宏大的，壮观的 manse 宅邸 stately manse 豪宅 clip 固定，夹着，修剪 untapped 未开发的，未发觉的 potential 潜力，潜在的 mentor 导师，指导 dig in 挖掘，开始干活 premise 前提，这里理解为故事的背景 irredeemable 无可救药的 jumble 混乱的事物，一团糟 tough but fair 忠言逆耳 dungeon 地牢 holocaust 大屠杀 counteract 抵消，中和 elixir 灵丹妙药 vassal 附属国 blow something wide 把something搞大 1Fool me once, shame on you, but teach a man to fool me, and I&#x27;ll be fooled for the rest of my life. thorough 彻底 burritos 墨西哥卷饼 yak 喋喋不休的说话 mafia 黑手党，黑社会 freeloader 白吃白喝的寄生虫 decapitator 刽子手 hipper 时髦的 flunk 失败，放弃，通不过，不及格 flunk out 退学 screw-up 废柴 hit rock 摇滚 rehearsal 排练，预演，彩排 delicate 精致的，脆弱的 dazzle 炫目的 vomit 呕吐 1We are not married to that. 我们还没确定这个 in confidence 暗中，私下地，密密地 confidence 自信心，信任 showstopper 精彩表演 spellbinding 迷人的，引人入胜的 run a theater 经营一家剧院 revival 复兴 debut 处女秀，首次登台 marvelous 妙极了 posthaste 十万火急 libation 饮酒，奠酒 peg 楔子,橛子,晾衣夹子, 用夹子夹住 pegged 没救了 sentiment 情绪，看法，观点 choreography 编舞艺术，伴舞 pyrotechnics 烟花 anthem 圣歌 cassingle 卡带 All sales are final 概不退货 creative juices 创造灵感，创造果实 half an hour 半小时的说法 videographic 录像 roam 漫游 relevant 相关的，紧密联系的 pompous 自负的 Mon dieu 上帝啊，天呀 1I blew it. 我搞砸了 gibberish 胡说八道 nuanced 细致入微的 S01E051Stop holding up the line. 别堵着队伍的说法 idiot 蠢货 bourbon 波旁威士忌酒 Fascist 法西斯 over here 在这呢 get through 过去 in place 适当的，就位 12And now if you&#x27;ll excuse me, I&#x27;m going to New York.如果你能原谅我，我要去纽约了。 cavity 洞，蛀牙，（身体的）腔 cavity search 体腔检查，也就是搜身包含皮燕子 kneecaps 膝盖 for a little bit adv 稍微 scenery 风景，景色，场景 lump 肿块 bump 隆起，肿块 1how&#x27;s it coming along? 进度如何 pump out 泵出 heartfelt 真诚的，真心的 anecdote 趣闻轶事 witty 言辞诙谐的，妙趣横生的 observation 观测 left and right 到处 spin 旋转，纺织 在台词中理解成把观测见闻变成、加工成好的东西 sustain 支持 sustaining member 赞助会员，出资会员 firm up 敲定，落实 late September 表示九月下旬 perspective 观点，透视的 in perspective 以正确的角度 Where does that leave us 。。。? 12345Where does that leave us as far as the book of it all?关于这本书怎么办？Where does that leave us...给我们留在哪-让我们怎么办as far as 关于，直到 swing by 顺便拜访 condolence 吊唁 phone booth 公用电话亭 scramble 爬，争取 scrambled 不规则的快速爬行 scrambled eggs 炒鸡蛋 frankly 坦率地 seal’s broken 封条都被破了 crikey 诶呦 dirtbag 人渣 touch football 触身式橄榄球 noogie parades 其中noogie 我查到的是掰手指关节，就是要打架的那种磨拳擦踵的感觉；但是后来这个词出现又是戳脸的意思。。。 life as an only child 独生子女 imaginary 想象中的 freeloader 吃白食的人 communist 共产主义者 rip-off 敲竹杠，敲诈 welfare 福利，社会福利 productive 有效益的，有产出的 &lt;从用词看出父亲虽然是个混蛋，但文化水平还是很高的&gt; miserable 痛苦可怜的，悲惨的，不幸的 black sheep 害群之马，败家子 get you to open up 让你敞开心扉 pop in 突然造访 kaleidoscope 万花筒 look up 抬头看，仰望，查找，探望 wicked 邪恶的，缺德的，淘气的 depart 离开，消失，去世 drag in 把。。拉进来，硬把某人拉入某事 protestant 新教徒 stick around 逗留 savage 野蛮人；凶恶的，残暴的，受损严重的；v 凶猛的攻击，猛烈抨击 raisin 葡萄干 come off it 得了吧，别胡说了 legwork 跑腿调查 hang over 宿醉 knicker 内裤，女性三角内裤 conscience 良心 cut me out 把我排除在外 bat 蝙蝠，球拍，拍打（板球，棒球） barge in 闯入，干涉 lend a hand 助我一臂之力 couch 长沙发 区分和cauch的发音 quarry 菱形，采石场，挖掘 rest up 充分休息 wide receiver 外接手（橄榄球的一个角色位置） step off 走开，去死，失策 frickin 该死的 &#x3D;&#x3D; fucking belonging 所属物，随身物品 swan 天鹅 corpse 尸体 removel 去除 剧中是搬运移动的意思 pisser 惹人生气的人 wicked pisser make up 组成，化妆，编造 pal 伙伴，朋友 phony 骗子，假货 homecoming 返校，归家 boutonniere 胸花 prank 恶作剧，玩笑 humiliate 羞辱 pussy 阴道，猫咪，娘娘腔 therapist 治疗专家 jeebies 神经过敏的 platinum 铂金，白金 slumber 睡眠 12And thus concludes our tour. conclude 表示中止 sadistic 虐待狂的，生性残忍的 alcoholic 酒精的；酒鬼 actively 积极地 loosen up 放松 let off some steam 减压 explode 爆炸 blackmail 敲诈勒索 G——grand 千元 in the pink 感觉很好，很健康；酒精中毒，喝多了 the books aren’t adding up 账本也加不起来 lav——lavatory 厕所 end up with 以。。而告终 screw around 胡闹 small fry 小子，不重要的人 offshore 离岸 lifestyle beg your pardon 请原谅 hiccup 打嗝，小问题 minor hiccup 小问题 goon （受人雇佣的）打手；傻瓜 nominal 名义上的，象征性的 scrounge up 弄到 scrounge 白要，白拿 care to 乐意，愿意。。 peruse 精读，研读 loaner 债权人 12loaner closet : A loan closet is a program that allows people to borrow durable medical equipment and home medical equipment at no cost or at low cost. The loan closet may be offered through an organization, an individual, or some other entity, often a non-profit organization. Because medical equipment is expensive and often needed for only a short time, loan closets help people receive equipment that they may not otherwise be able to afford. 简单理解为借用细则 stuffy 闷热的，通风不畅的，乏味的 chum 朋友，鱼饵，渣渣 12chum: animal or vegetable matter (such as chopped fish or corn) thrown overboard to attract fish throw in 投入，边界发球，扔向 ground into 磨成，碾成 mushy 糊状的，多愁善感的 big-shot 大人物 spectacle 精彩的表演；壮观的场面; 奇观 clam 蛤，沉默寡言的人（就是傻吊） hop 弹跳 pitcher 投球手 sox 短袜 disperse 散开 land on one’s feet 某人总是好运连连 pop 可以指代飞机上的耳压变化 sinkhole 落水洞，排污坑，臭水沟 modicum 少量，一点点 closure 关闭，倒闭 superficial 肤浅的 artisanal nuts 手工坚果 artisanal 手工，手工的 hotshot 运动高手，很有成就的人 barrel 桶，枪管 grudge 怨恨，积怨，嫌隙，吝惜 12smell you later: A humorous modification of see you later. S01E06pet name 昵称，爱称 put it there 握手 剧中put her there是一个调皮的说法 12while you were back east. 从东部回来的时候注意方向词的用法 stick with somebody 跟紧某人 1Hey, I&#x27;ll take the ride as long as it&#x27;s not as bumpy as that pilot&#x27;s landing.只要不像飞行员降落时那么颠簸我就愿意坐。 bum 懒汉，屁股 bumpy 不平的，颠簸的 freak out 吓坏了 beating heart 跳动的心脏 hemisphere 半球 road sodas 公路啤酒 1: An alcoholic beverage (usually beer or perhaps malt liquor) consumed inside a moving vehicle. This beverage can be consumed by passenger, driver, or both. Road sodas are illegal in most states due to open container laws. Still, they are widely enjoyed as evidenced by all the beer cans littering rural raodsides. ordeal 折磨，煎熬 sober up 使清醒一下 cliffside 悬崖峭壁，悬崖边 vacay 假期 hazard 危害，危险 champagne 香槟 champion 注意二者重音，冠军在前，香槟在后 keep with the trend of 跟上。。的趋势，与。。相匹配 off the menu 不在菜单上，意味着定制版本的菜 courtesy 礼貌，好意 rip off 抢劫，剽窃，强奸 observation 观察，观测；见闻，评论 chopper 砍刀，在美国俚语中有搭直升机的意思 extravagant 奢侈的，挥霍的，过分的 1What&#x27;s the rush? 着什么急？ hatred 仇恨，憎恨 coincidental 巧合的，碰巧的 check this out 看看这个，你看这个哈 lift weights 举重，举哑铃，练肌肉 toilet wine 监狱自酿酒 1: Home-Made alcohol brewed by prison convicts in the top tank of their cell toilets. Used primarily for &quot;Getting a Shine On&quot; and trading for cigarettes and &quot;Bitches&quot;. pruno 简单理解为酿酒吧 12345: A great science experiment for the kids... and yummy too!To make it, alls you have to do is smush some oranges in a bag, add ketchup and sugar cubes, let sit for a week, and enjoy!Prisoner: Boy, this delicious pruno makes me nostalgic for my childhood days when I used to drink cat urine. 1234567Never thought I&#x27;d say this, you put a pretty good spin on Nazis.这里的spin应该是倾斜，偏袒描述的意思。有点那种你能大言不惭的把这么丢人的失败说的这么清新脱俗的意思。: To present an incident in a particularly slanted or biased manner. Originated from the game of pool, wherein if one shoots the ball from the side to put “spin” on the ball, it will go into the desired hole. To properly “Spin” a story, one should employ a “Spin Doctor”.“Spin Doctors” are frequently used by politicians to help write a slanted story which presents a “fact” in a far different way than most people would see it, had it been told directly and honestly.Arnold Schwarzenegger hired spin doctors to write a response to the accusation that he groped women. drop by 顺便拜访 make up your own mind 你自己做决定 increasingly 越来越多，日益 petty 小的，琐碎的，气量小的，次要的 carpool 拼车，高速上常出现的多人车道 goddamn 该死的，十足的 environmentalist 环保主义者 bail 保释，担保 cyanide 氰化物 vodka 伏特加 absinthe 苦艾酒 scrambling 攀登，争夺，扰频（剧中是紧急插播的意思） tinseltown 星光熠熠之城（指位于加利福尼亚的美国电影业中心好莱坞） defcon 防御，战备状态 diabolically 恶魔一般的 demonstrably 可论证地，明确地 alliteration 押韵 investigate 查找，调查 invest 投资 investment 投资 suspect 怀疑；嫌疑犯 memoirist 回忆录作家 wheeze 喘息 dismantle 拆卸，摧毁 grunt 嘟囔 incriminate 控告，暗指有罪 flake 剥落 blaking on an obligation 逃避责任 obligation 义务，责任 make this not my problem 摆平这个问题 tie up 捆绑，亲密联系 deviant 不正常的，行为不轨的人 bracelet 手镯，手链 fence 篱笆 deduction 推理 forensics 辨证学，取证 indubitably 无疑的，绝对的 fantasize 幻想 cut you a deal 跟你做个交易 cavity 腔 cavity search在前面过飞机安检时候出现过这个词，是身体检查的意思 don’t get me wrong 别误会我 court 法院；追求，吸引，求婚 belle of the ball 舞会之花 belle 美女 ball 舞会 shapeless 不成形的，长得不好看的 insult 侮辱，辱骂 foul ball 界外球 fight over 争夺，为了。。而争吵 mustard 芥末 pickle 腌黄瓜 SWAT Special Weapons and Tactics 简称特警 juices flowing 思如泉涌 camaraderie 友情 bastard 混蛋 stupendous 了不起的，屌爆了的 being 注意这个用being表示指的是，表示，其实是 jump-in 加入帮派，跳入，入帮 jam 果酱，困境，阻塞 conundrum 谜语，谜题 recall 召回，会想起 pal 哥们儿，伙计 steal one’s thunder 抢某人风头 fiscally 财政方面 12juggling both never ends well. 两者兼顾从来没有好结果juggling both 两者兼顾 blankly 茫然地 bail somebody out 把。。保释出去 foie gras 鹅肝酱 don’t bother 不用麻烦了；别麻烦了；不要打扰 bozo 笨蛋 riot 骚乱，发生骚乱 Ring the alarm 拉响警报 irreplaceable 不可取代的 sketchy 粗略的，概略的 presumably 大概 unflinching 坚定的，不屈不挠的 coverage 新闻报道，覆盖范围 harrowing 恐怖的 ordeal 折磨，煎熬 peril 险情 this just in 最新消息 heist 盗窃 literal 确切的，字面意思的 confess 坦白，承认 turn in 上交 badge 徽章 fuzzy 毛茸茸的，模糊的 cot unmade 没铺床 unmake 撤回，使消失，使变形 double-cross 出卖，欺骗 pitch 球场，推销 sale pitch 推销 sell pitch 12Look, you may have come up with a log line, but he&#x27;s the one who sold the pitch. 你是想出梗概（创意）的人，但他是话术推销（推销成功的人）This is more on brand for him than it is for you. desecrate 亵渎 landmark 里程碑 stupor 昏迷，神志不清 1I got to bounce. 我得走了、挂电话了。 Reich 第三帝国（德意志） neo- 新 chess pieces 棋子 whittle 屠刀；把。。削成 doozie 非常好的 pilfere 偷窃 legitimate 正当合法的 standoff 僵局 sneeze 打喷嚏 overkill 过火了 catch 这里表示非常抢手的 spectacle 精彩的表演，壮观的场面，奇观 consolation 安慰，慰藉 scotch 挫败，阻止；苏格兰威士忌 cushy 轻松愉快的；安逸的；不费劲的 S01E07lick 舔；打败 took some licks 挨了几下，输了几次 bounce back 反弹，很快挽回，卷土重来 bender 狂饮作乐 ears pierce 耳洞 current 水流指代海浪 designate 指派，委任 get you back on your feet 让你重新振作 get off 下车，脱衣，离开 get on 关注 和 get off 相反 in that favor 因为这个人情 muppet 蠢蛋，木偶 upright 直立的，挺直的，垂直的，垂直地 take up 拿起，占据 in charge 负 snappy 精炼的，简洁的 predictably 可预见的，可推论的 loath 不情愿的，勉强 toot 吹喇叭,嘟嘟声 done deal 木已成舟，搞定了，板上钉钉 redundance 冗余 get laid off 下岗，被裁员 slippery 湿滑的，油滑的 slimy 谄媚的，讨好的 bug-eyed 凸眼的，死鱼眼的 pussycat 小猫咪 in the flesh 正式本人 flesh 肉体 elite 精英 get my ass here 赶过来 pumped 紧张，兴奋 keep track of 跟踪，保持密切联系，记录 charcoal 木炭 mellow 醇香的，甘美的；老成，柔和 mellowed tuxedo 燕尾服 driver over 开车过来 nominate 提名，推荐，任命 comfort 安慰 nude 裸露的 erector 竖立肌 erector 竖起 vis a vis 面对面 permanent 永久的 distract 分散，转移 jargon 行话，术语 booze 喝酒；酒精饮料 restrain 抑制，阻止 practically 几乎，差不多；实事求是地 lucrative 赚大钱的，获利多的 blackmail 敲诈 needless to say 不用多说 extortion 勒索 prosecute 起诉，控告，检举 felony 重罪 pin that on us 把责任推到我们头上 take the fall 代人受罪，当替罪羊 fascinate 使着迷 fascinating 有魅力，有趣 double up 对折，两人共处一室 lampoon 讽刺文章；讽刺 prop 道具；支撑 pep talk 鼓舞士气的演讲 tagline 结尾语，口号 protocol 礼仪，条约 champing 心急如焚 at the bit 有一些 wrapping up 快结束了 wrap up 抱起来，总结，封装 cynical 愤世嫉俗的 rotate 转动 babysit 照顾，照料 entree 主菜 appetizer 开胃菜 gelato 冰淇淋，意式冰淇淋 scamper 欢快地奔跑，蹦蹦跳跳 repping 代表 rep 名声，纵向纹路的布 moron 白痴 put you on mute 给你静音了 screw’em 去他们的 flights of fancy 异想天开的东西 shred 碎，一点，撕碎 riddance 拜托 trombone 长号 wash our hands of him 我们和他绝交 raven 渡鸦；到处抢劫 misconception 误解 suffragette 妇女参政论者 oversee 监督 shat shit … premiere 首映 revitalize 复兴，使强壮 stable 马厩 head out 头向外，出发 表示离开办公室 S01E08I’m off to Malibu 这里off的用法出去 whole thing 可以理解为一个复杂的，可能引发争议的情况 along 一起，沿着 buffer 缓冲；缓冲物 slip 溜，滑 fiance 未婚夫 winky 闪闪，眨眼 smiley 笑容符号，笑脸符号 on the whole 整体上来说 hit me 让我意识到 No offense 对他人的道歉：无意冒犯 none taken 我不介意 同no problem 1What&#x27;s the deal with you and this guy? 你和这家伙怎么回事？ stab him in the back 背刺 stab 捅刀 betrayal 背叛 bathtub 浴缸 tipsy 醉醺醺的 suit 可以表示高级管理人员 nod 点头 exexutive 领导层，管理人员；领导层的 pantsuit 女子套装 lame 表示无趣的 tricycle 三轮车 bicycle had the balls to say 有胆量说 ball 勇气 knock them down 干掉他们，击倒 let’s give it up for somebody 让我们把掌声给某人 flock 聚集；群 knob 球形把手，突起，阴茎，这里指代矬子 tip 小费 slug 蛞蝓；一小杯（烈性酒）；子弹； 猛击 stay sharp 保持锐利，保持敏锐 commercial 贸易的，商业的；专指名词广告 hotshot 高手，很有成就的人 LACMA —— Los Angeles County Museum of Art pitch 推销 off-the-clock 业余时间 quiche 乳蛋饼，一种法式开口馅饼 busted 当场逮住 bust 半身像雕塑； 打破，突击搜查 salutation 致敬 stay out of trouble 别惹事 small-fry 不重要的，小角色 1he thinks the world of you. 他很看重你 make up your mind 下定决心，干脆点（说明白给个准儿） tar pits 焦油坑 tar 焦油，沥青 smack 海洛因，一拳，掌掴；直接 metaphor 比喻 make a move on me 对我下手，move on 是向前一步 prosciutto 意大利熏火腿 hooker 妓女 be on board with 同意 I catch up in the moment. 原意是我赶上那个时候，我抓住那个时候，在剧里表示我一时兴奋。 gotcha 口语的 I got you. unflinching 果敢的，坚定的，不屈不挠的 gritty 含沙砾的，有勇气的 rollerblade 旱冰 racist 种族主义的；~者 limp 无聊的 和lamp一样 tabloid 小报 keep your head down keep your nose clean 不要惹是生非，你得安分点(感觉就是鼻子别流血) sting 叮咬，钓鱼执法的圈套 indecency 猥亵 lewd 淫荡的，好色的，下流的 conservative 保守的，保守派 nubile 性感的 preteen 青少年13岁下 perv 变态色狼 flaunt 夸耀招摇 flaunting 招摇的 count on 指望的上 crapper 厕所 storm out 暴跳如雷地冲出去 courtesy 礼貌 turnaround 转变，变卦 dicked over 理解为完蛋 eat your guilt 吞下愧疚，就是很愧疚的意思 stunning 有魅力的 stun 震惊；打昏；胡桃 这熊不就是机场要蜂蜜那个么 utensil 餐具 swag 赃物 fuzz 茸毛 on our heels 在我们后面 heel 后脚跟 pussy 阴道，娘娘腔 disgnose 诊断 juice 有权势的意思 hostility 敌意，对抗 charity 慈善 1keep in touch 保持联系 closure 关闭，倒闭 prop 支撑，支持 showbiz 娱乐圈 phony 假的，虚伪的，~人 rectal 直肠的 vibe 气氛 warts and all 如实描绘 wart 瘊子 S01E09arid 干旱的 stud 散布，耳钉 sophisticate 老于世故的人 transaction 交易，业务 flirt 调情 trench 壕沟，沟渠 trench coat 军事雨衣，风衣 shenanigan 鬼把戏，胡闹，诡计 honeysuckle 金银花 sleet 雨夹雪，冰雹 dead of night 深夜 romp 玩耍，轻易取胜 burner phone 一次性手机 burner 炉子 cyanide 氰化物 capsule 胶囊 incriminate 归罪于，控告 destiny 命运，宿命 liberty 自由 bizarre 离奇的，奇怪的 toodle 再见 infiltrate 渗透 chauffer 手炉，司机 errand 差事 groomer 美容师 whatnot 某种东西，之类的 scour 冲刷 achilles heel 致命弱点 take him down 打败 biscuit 饼干 barcode 条形码 bandana 头巾 call off 取消（婚约） slosh 溅出 slosh around 晃来晃去 tummy 胃，肚子 raw data 原始数据 stage 上演 robbery 抢劫 guerilla 游击队 lodge 门房，小屋 cogent 有说服力的；令人信服的 tangent 切线，正切 impromptu 即兴的，即兴演出 rehearsal 彩排 partake in 参与 anecdote 轶事 dud 不中用的 ulterior 以后的，隐藏的 venue 场地，会场 sabotage 人为破坏，蓄意破坏 hit it off 意气相投；投缘 knobby 疙瘩 turf 草皮，地盘 knack 本领，窍门 custody 保管 cereal 谷物，麦片 defendant 被告 blabber 瞎扯；喋喋不休 synonym 同义词 kooky 蠢笨的，古怪的 scheme 密谋，方案，计划 nutty 坚果的，古怪的 caper 活动；雀跃 dedicate 奉献 take a leap of faith 大胆试一试，信仰飞跃 vest 赋予；马甲 S01E10bring out 发布，出版，展现 goof 傻瓜 Excess Hollywoo 这个词是过度的 总是和exercise发音混淆 set 片场 heist 盗窃 inspiration 灵感 over the moon 欣喜若狂的，月亮之上有多少梦想在自由的飞翔 听印度老铁聊过这个词，当时还以为是印度语中有高兴的意思，原来是英语phrase exploit 开发，利用；英勇的行为 casa 住宅 amigo 盆友 titty 奶头 a big titty baby 一个大号奶娃 revitalize v 使恢复生机 reservoir 水库 reservoir dogs 落水狗 inconceivable 不可思议的 alcoholic 酒鬼；酒精的 smear 涂 pep rally 赛前动员会，誓师大会 pep 鼓励 rally v召集 n群众大会 cheerleader 啦啦队员 slut 荡妇，婊子 lipstick 口红 what have you been up 最近忙什么？ aspire 渴望 cripplingly 极其严重地 throw up 呕吐 pigeonholed 归类于 acclaimed 受欢迎的 phone it in 理所当然的，顺其自然的 two-dimensional 平面的，无深度的，肤浅的 take 镜头 headspace 情景 equalizer 均衡器 spritz 喷水 spritzed 空气湿润的 in a jiff 马上 jiff 一会儿 skippy 日本女人（妓女） crew neck 圆领 wardrobe 衣柜，衣橱 fall apart 解散，崩溃 mess up 搞砸 [TOC]","categories":[{"name":"English","slug":"English","permalink":"http://example.com/categories/English/"}],"tags":[{"name":"English learning","slug":"English-learning","permalink":"http://example.com/tags/English-learning/"}]},{"title":"No Stupid Questions Note","slug":"No Stupid Questions","date":"2024-09-13T19:00:00.000Z","updated":"2024-10-08T22:52:41.679Z","comments":true,"path":"2024/09/13/No Stupid Questions/","permalink":"http://example.com/2024/09/13/No%20Stupid%20Questions/","excerpt":"","text":"[TOC] 12345resource example: https://freakonomics.com/series/nsq/《No Stupid Questions》-- Freakonomics Radiohttps://freakonomics.com/podcast/what-makes-a-good-sense-of-humor/资源在B站有搬运，自己搜索 127 How Can You Be a Better Communicator1234567891011121314151617181920212223242526mimic v 模仿 a 模仿的type out v 键入keep to ourselves 保守秘密，亦可以指代独处context n 背景，语境，环境amateur 业余keep at 继续做，坚持做grit n 沙砾，勇气reach out someone 找到某人，联系某人demerit n 缺点，过失under the impression 有。。的印象in advance 预先，提前go over 本来是仔细查看的意思，这里理解为解决 think about trying to go over.articulate v 表达on the fly adv 快速地，匆忙地take a step back 退一步deliberately adv 刻意地，故意地conversing 谈话，倒转thumb typed 拇指打字spontaneous 自发的，心血来潮的take-home 带回家，拿回家去summon v 召唤，传唤misogynist 厌女的男人bewitched 被迷惑 210 No Stupid Questions - What Makes a Good Sense of Humor?off the rails 出轨了，失控了 over the cliff 在悬崖外拉不回来了 开场用I’ve got this great joke. 为什么用have got而非have，因为have got 有我听过的时态，然后引出接下来的话题。have单纯说有这个动作 move on &#x3D;&#x3D; go ahead perpetuate v 使。。持久化，使。。延续 这里在说让我们的物种、基因延续 persistent a 坚持不懈不屈不挠的 prior a 以前的，之前的 previous fair 这个词常用作 a 公平的 n 展销会，集会 在这是 a 合理的 嗯有道理 even on that 即使那样 No. 1 box office smash hit 热映榜首 box office 是票房 fall under the categorization of 属于。。分类&#x2F;类型下 hit me so hard 非常用力地打(动)我 uncontrollably adv 控制不住地 for days after 几天后 in that category 属于某种类型下 be amused 被逗乐 例如你被逗出猪叫 subject line 说的是邮件主题 abduct v 绑架，劫持 fell out of 就这个连读 trauma n 创伤，精神创伤 be reflecting on 反思，深思 reflect 这个词用作反思 unnoticed a 未引起注意的 traumatic a 痛苦的，创伤的 come upon this gem 知道的这个爆梗 巧遇这个珍宝 obituary n 讣告，死讯 fact checked it 核实真相 bludgeon v 大棒重击，恫吓 hysterical 歇斯底里的 self preservation mechanism 自我保护机制 adaptive a 适应的 adrenaline and cortisol 肾上腺素和皮质醇 tribe 部落，一伙儿 have your back 做你的后盾，支持你 evolutionary a 进化的 vocalization n 发声 intention n 意图，目的 tickle v 咯吱，挠痒 speculate v 推测 defend something 一般来说表示守卫something, 如果是抵御A免遭B侵袭 defend A against B constructive manner 建设性的方式 voice box 喉 这里不是指公寓门前的门铃 communicative threaten v 威胁 t 不发音 laugh tracks 音轨(情景喜剧里哈哈哈的背景笑声) fledgling 雏儿，新手 piped 这里是表示插入的的意思 communal a 公共的，共享的 bring it up 提出来 integrative a 综合的，一体的 antecedent n 先行词，祖先 ancestor right off the bat 立刻马上 ingredient n 成分，要素，菜谱的配料 hypothesize v 假设 recipe 食谱 active ingredient 有效成分，活性成分 就是指发挥作用的成分简称“要点” superiority n 优势，优越感 expense n 这里是代价 是说取笑别人，拿消遣别人为代价 wit that offends 冒犯的智慧 subordinate a 次要的，隶属的 n 下级 v 使隶属于。。。 quote unquote 带引号的 benign a 善良的，和善的，良性的 juxtaposition n 并列 wavelength n 波长 vibe 共鸣，共振 figuratively adv 比喻地，象征性地 sweet spot 最佳击球点 exclusivity n 专有性，独特性 voice memo 语音备注，语音备忘 harness v 利用 n 马具；挽具 strengthen v 加强 注意发音 diffuse v 弥漫，散布 a 弥漫的，扩散的 resilience n 适应力，弹力，恢复力 stakes n 赌注 deadly a adv 非常，极度，十分的 yearn v 渴求 humanize v 使更适合人，教化 approachability n 可接近性 self deprecating 自嘲的，自谦的 slink off stage 悄悄下台 slink 悄悄溜掉 deadpan a adv n 面无表情的，冷面 juxtapose v 把。。并列 misread v 误读，念错 mis_read craft n 工艺，手艺，飞行器 craft of writing 写作技巧 transcribe v 抄录，转写，改作 Swedish n.瑞典语, 瑞典人 Sweden n 瑞典 Switzerland n 瑞士 Scandinavian n.北欧(人)的；斯堪的纳维亚语(的) charisma n.超凡的个人魅力；感召力；号召力 captivate v 迷住，使着迷，吸引 you’d think 表示推测“你会认为”，这里‘d几乎不发音，需要上下文推断 somber a 忧郁的 uproarious a 喧嚣的 eulogy n 颂词，悼词 ebb n 落潮 v 衰退 approachable a 和蔼可亲的，平易近人的 exceptional circumstances 特殊情况，意外情况 give you credit for something 这里的credit是认可 inadvertently adv 无意中地 biting a 刺骨的，尖锐的 roast them 这个词本来是烤的意思，但是对人是说说某人糗事的宴会 cringey a 令人尴尬不适的，畏缩的 myth n 神话，黑神话悟空用的这个词表示神话 paralyze v 使瘫痪，使麻痹 impact v 影响，冲击 perception n 感知，知觉，看法 determinant n 决定性因素 competence n 能力，技能，权限 informative a 提供有用信息的 immensely adv 非常，极端地 willingness 意愿 abysmal a 糟糕的 heartbeat n 心跳 注意这个词是名词 roll one’s eyes 翻白眼 roll off his chair 从椅子上滚下来 deep end 可以表示深渊，深水区 look for times 这里的times refers to opportunities or moments changes n 几率 right amount of 适当的数量的 hearken v 倾听 mindset n 思维方式，心态 growth n 生长，增长，发育 juggle 杂耍 One reason I beg to differ is that 我不同意的一个原因是 autobiographical a 自传的 autobiographic 的变体 be obsessed with 痴迷于 expertise n 专业知识，专业技能 pop tart 玉米饼状的吃的 pastry 油酥甜点总用这个词 buffing and polishing 抛光 premeditated 预谋的，蓄意的 spontaneity n 自发性 off the cuff adv 即兴的 think through 仔细考虑 extraordinary a 意想不到的，非凡的 massively adv 大规模地，厚重地，庄严地 rehearse v 排练 hearken back to 回想起 per se 本身，本质上 wallow 沉溺 funk 沮丧，抑郁 it got me out of a funk 让我摆脱了抑郁 is often credited as 通常被认为是 novelty n 新奇 a 风格独特的 composition n 成分，构成，作曲 Puritan 清教徒 air v 播出 orchestrate v 谱写，精心策划 awareness n 意识，察觉 fatality n 宿命，致命死亡 campaign n 战役，活动 imperial a 帝国的，皇帝的 n 写字纸 imperial system 这里的system为制度，度量，分类规则 masochism n 受虐狂 freakonomics 怪诞经济学 这个词是一个合成词 123456789101112Some sentencesOur emotions fundamentally serve the purpose of our survival, but how does laughing or being funny prevent us from being eaten by a lion?I don&#x27;t think like oh &quot;funny&quot; would be in the top 40 adjectives that anybody would use to describe me.They both fall under the categorization of dad jokeI don&#x27;t think I&#x27;m in that category anymore.that&#x27;s when all the trouble started. 一切麻烦就是从这开始I&#x27;ve never fact checked it. 我没核实过这个I sort of feel like I&#x27;m old enough to have been alive when they were invented.Sometimes you&#x27;re laughing at someone else&#x27;s expense.that was huge for us. 对我们来说意义重大Humor obviously impacts our perception of status competence confidence etcwhat are the chances that the two main comics hosting late night shows (they)&#x27;re both named Jimmy. 212 When Do You Become an Adult?homesick a 想家的 n 思乡 adulthood n 成年，成年期 forced upon us 外界强加给我们的 12Why hasn&#x27;t this evolved with our understanding of human brain development.为什么这没有随着我们对人类大脑发育的理解而发展 neuroscience n 神经科学 vague a 模糊的 be occupied with 忙着做某事 handful 一把，少数的人(物)，很棘手的人 o’lantern 南瓜灯 First load of laundry 意思是“第一批洗的衣服”或“第一次洗的衣物” dryer sheet 干衣纸 drop somebody off 开车送人，把。。从车上放下 suburban a 郊区的，平淡乏味的 n 郊区居民 这里指雪佛兰 Suburban汽车（Chevrolet Suburban） distinctly adv 明显地，清晰地，历历在目地 transition n 过渡，转变 bizarrely adv 古怪地 majority n 大多数，大部分 fluctuation n 波动，脉动 fluctuate v 波动，起伏，涨落 in the heads of families themselves 一家之主 correlate v.n 互相关联 puberty n 青春期，初情期 onset n 发生，开始 back then adv 那时候 guardianship n 监护，监护权 curator n 馆长，监护人 validate v 验证 warfare n 战争，作战 hop with me for a minute over to England 大伙跟我来谈论英格兰 hop v 跳行 n 啤酒花 defensive armor 防护用的铠甲 eligibility n 合格，有参加比赛的资格 knighthood n 爵士头衔，爵位 turn into 变成 warrior n 战士 agricultural a 农业的 congress n 国会 conscription n 征兵 amendment n 宪法修正案 so much of it comes down 很多都归结于此 some down 可以理解为归结于此 pragmatic a 实用的，务实的 n 管闲事的人 bright lines 明确的界限 somehow 不知为何 demarcation n 划分，界限 match up 配对，匹配 prohibition n 禁令，禁酒令 equate to 相当于 arm 在这里是支持，推动 abide v 遵守，容忍 abide by 遵守 adolescence 青春期 transitional a 过渡的，转移的 hormones 荷尔蒙 adolescent a 青春期的 sensation n 感觉take sensation seeking behaviors 寻求刺激 mushy a 糊状的，模糊的 postdoc 博士后 make the distinction 做出区分 peer pressured 同侪压力 大概就说说别人家孩子的压力 induce v 诱导 anger inducing 被愤怒诱导 urge n 冲动 intersection n 十字路口 crossing 12表示三思而后行的四个单词rational, thoughtful, analytical, logical susceptible a 敏感的，易受影响的 practical a 形容人表示务实的，实用的 unambiguous separation 清晰的区分 prefrontal cortex 前额叶皮质区 reasoning 推理，论证 suppression n 抑制，镇压 self regulatory capacity 自我调节能力 resist v 低质，反抗 resisting impulses 抵制冲动 lost count 数不清 bar mitzvah 犹太人的成人礼 infantilization n 幼稚化，婴儿化 fully formed adults 完全成型的成年人 所以这里formed表示’成型的‘，也就是’成熟的‘的意思 preconceived notion 先入为主的观念preconceived a 预设的 engage v 从事 testosterone n 睾酮 estrogen n 雌激素 cellular clock 细胞的时钟 profoundly adv 深刻地，深远地 incentive v 刺激，激励 effectively adv 有效地 forestall v 预先阻止，垄断，先发制人 procrastinate v 拖延 invention n 发明 postpone v 推迟 customary a 习惯的 biblical a 圣经的 molar n 磨牙，臼齿，大牙 permanent molars 恒牙 erupt v 爆发，喷发，突然发生 也就是说童年压力越大，后槽牙长出来的越早。。。 capitalize v 用大写字母，资本化，利用 movable a 可移动的，不固定的 pre programmed 预先编程的 calories 卡路里 venture a guess 斗胆猜一下 venture v 冒险地做。。 unprecedented a 前所未有的 ramification n 分支，衍生物 verifiable a 可证实的，可检验的 Zoomers Z时代 &#x3D;&#x3D; Gen Z respondent n 被调查对象，回答问题的人 stat n 统计 rebrand v 重新命名 prominently adv 突出地 fellow faculty 同事们 mind blowing 大开眼界 take back something 收回那些话 catastrophic a 灾难性的 other than me 除了我 melting pot 大染缸，大融合 quincinera quinceanera 墨西哥成人礼，第一集波杰克party上15岁小姑娘用鞭子抽马 induct v 诱导，引领 legislate v 立法 pomp n 盛况 don v 披上 don a gown to fair point 说到点子上了 as my closing remark 作为我的结束语 213 what is Evil?question on 用介词on 表示关于 light topic 轻松的话题 malevolent a 恶毒的，有恶意的；有坏心肠的，凶狠的malevolent laugh 不知道为什么这么形容笑，类似反派死于话多那种吧 同evil laugh villain n 坏蛋，反派，恶棍Disney villain the other day 上次，几天前 heated a 愤怒的，十分激烈的 curt a 简短d，草率的，唐突的 1I&#x27;m especially curious because the other day my friend and I got into a surprisingly heated yet curt debate. refute v 反驳，否认 refuse v 拒绝 have interest in doing 1She firmly refuted and had no interest in doing deeper. Clearly, I do. 很显然，当然 我是 mentally ill 心理有病的 mental issue 心理问题 enlighten v 启发，开导 lighten 点亮 1What I&#x27;m mostly curious about is what happened in her neihborhood. plot n 剧情 pedophile n 有恋童癖的人 entrap v 诱捕，诱骗 and so forth 等等 interior n a 内部，内部的 worldview n 世界观 sympathy n 同情 nuance n 细微差别 consensual a 一致同意的，有共识的 psychological a 心理学的 definition 定义，解释 put it out there 放在那，摆出来 uniquely adv 独特地 1I think we think it&#x27;s a uniquely human capacity. 这里humam是adj，uniquely是adv lots of ink has been spilled morality n 道德 moral a 道德的 evident a 清楚的，显然的 oath n 誓言，宣誓 tit for tat 以牙还牙 consistent a 一致的，连续的 consensually adv 一致地，一致同意地 上文提到consensual getting back to (topic) 说回（某个话题） intentional a 故意的，存心的 perpetrate v 犯（罪）；做（错事）；干（坏事） emphasis n 强调，重要性 P.S. 下次想说重点是xx的时候用这个词 intentionality n 蓄意，意图性 set a fire 引发火灾，放火 1&quot;Set a fire&quot; can mean both &quot;to start a fire intentionally&quot; and &quot;to cause a fire, either accidentally or deliberately.&quot; make me freak out &#x3D;&#x3D; freak me out 我们在englishpod里学过 at the wheel adv 掌舵的时候，开车的时候 plow into 全力冲入 这里形容开车撞进一个大楼 plow本来是犁的意思 horrific, tragic, awful 这三个词一起记 conceptual a 概念上的，观念上的 whichever 无论哪个，究竟哪一个 tie up with a bow 用蝴蝶结系起来，表示结束某事，下结论bow不仅表示鞠躬弯腰还表示蝴蝶结 pry n 窥探 v 打听pry open v 撬开pry open the door on … 撬开。。大门 1But I do want to tell you about one study that was done that I think actually just like pries open the door on how deep this question really is. arguably adv 有争议地，可以认为地 prominent a 卓越的，权威的 Double-Edged Sword 双刃剑 judges make sentences 法官做出判决 as is often the case 就像通常一样 crime 和 criminal psychiatric a 精神病的 trial v 使用，测试 n 测试，审判，选拔赛 hypothetical a 假设的 convict v 定罪 n 服刑囚犯 psychopathy n 精神病态，心里变态psychopath n 心理变态者 biomechanical 生物力学~ MRI 核磁共振 lesion n 病灶，损伤 faulty a 有错误的，有缺陷的 amygdala n 杏仁体 rule on the sentence 对判决做出裁决 testimony n 证词，证据 mitigating circumstances 减轻处罚情节 The only thing that varies across the conditions 唯一不同之处 punitive a 刑罚的，处罚性的 perceive v 认为，注意到 1234&quot;Do we need to be even more careful upon release in what happens to this individual?&quot; the word &quot;upon&quot; is used to mean &quot;at the time of&quot; or &quot;immediately after.&quot;Here, &quot;upon release&quot; means &quot;at the moment of release&quot; or &quot;when the individual is released.&quot; 这里的careful in 表示在哪一方面要小心 in/about on the face of it 从表面上看 mitigate v 缓解 bear on 对。。产生影响 content analysis 内容分析 1When they did content analysis of the reasoning that judges gave for their sentence, they found that the proportion of judges that list mitigating factors, meaning like psychopathy should bear on the sentencing, it increased from about 30% to about 48% when you go from the condition lacking evidence of biology to the one with biology. loom v 显得突出，逼近 12It looms large in our minds.它在我们的心中占据着重要的地位。 criminologist n 犯罪学者 dysfunctional brains 功能障碍的、机能失调的大脑 psychiatrist n 精神病学家 base rate 基数，基率 statistically 统计学地 diagnosis n 诊断 1It&#x27;s just that statistically, they are more likely than people who have no diagnosis at all. schizophrenia n 精神分裂症 oversimplification conservative n 保守派 a 保守的 progressive a 进步人士，改革派 regulation n 法规，监管 12Hey, if we could just control guns, right, and do more to get some of these weapons off the street, et cetera.get some of these weapons off the street 是从街上收缴走 take into account 考虑到，顾及 1We need to take into account the individual. wickedly good 非常好 It doesn’t compute &#x3D;&#x3D; It doesn’t make sense shine a light on it 点亮它，照亮它 controversial a 有争议的 flip of the coin 投硬币 foist people in 强加于人 healthiest healthy 的最高级 最健康的 in the bunch 在这伙人中 flair n 天赋，天资 1he has flair for dramatic. 他有喜剧天赋 1234一系列对你做的事people show up at your houseand handcuff youand take you off 把你带走（绑走） in charge 负责 asymmetry n 不对称 asymmetric 不对称的 make up 虚构，编造 1But pretty soon, you have these guards making up, from only their own imaginations, these terrible things like the guards got the prisoners to clean the toilet bowls with their bare hands. taunt v 挑逗，嘲弄，奚落 sodomy n 鸡奸 devolve v 移交，委托 barbarism n 野蛮，未开化 disarray n 混乱，无秩序 massive a 巨大的 cognitive a 认知的 dissonance n 不和谐，不一致 unfold v 展开 breakdown n 分解，损坏，破裂 sadistic a 虐待症的，邪恶残忍的 burnout 燃尽，这里指职业倦怠 barrel 木桶–P.S. 相对于apple本身，barrel指代环境因素 disorienting 迷失方向的，混乱的 parable n 寓言故事 bring it up 提起某事 in my heart of hearts 在我内心深处 acknowledge v 承认 用admit的时候可以替换一下 slippery a 滑的 deliberate a 故意的 v 深思熟虑 people off the street 大街上的人们 rigged a 被操纵的 quote, unquote 表达所谓的，正所谓的 so called flip the switch 拨动开关，或者按动开关 imply v 暗示，表明 inflict v 加以打击，使痛苦，处以刑罚 wander down 逛下，溜达下来 frightful a 糟糕的，可怕的 1vice is a monster of so frightful a mean face. oft 经常 1We first endure, then pity, then enbrace gradualism n 渐进主义 as if 好像，仿佛 slumped over 瘫倒 habituate v 习惯于 rationalize v 使合理化 appeal to 呼吁，上诉，求助于 appeal to authority out of whole cloth 胡诌的，瞎编乱造的 bring out 公开，暴露 buck the trend 抵制这种趋势，逆势而行 midst n.adv.prep 中间 getting caught up 陷入困境 hysteria n.癔症；歇斯底里 communism turn on 对。。进行突击 turn on their neighbor stand up 指挺身而出，站出来 conscience 良知 注意发音 conscientious a 认真的，凭良心的 whistleblower n 吹哨人，告密者，举报人 protest v.n 反抗，反对 macro a 巨大的 surround v 环绕，包围 n 周围 unequivocally adv 毫无疑问地，绝逼地 go on the record 公开表态 1I want to go on the record agreeing with you. unconscious a 无知觉的，无意识的 visceral a 出自内心的，内脏的，发自肺腑的 appalled a 惊骇的 moral obligation 道德责任 wrestle with 与。。搏斗 wrestle 摔跤，角力 nuances n 细微差别 takeaway 收获，要点 fact check 信息核实 214 What Does It Take to Survive Scandal?take to survive 生存，立足 restore v 恢复，修复 hold me 让我负责 1you can hold me to a higher standard egregious a 令人震惊的，臭名昭著的 appalling 之前的播客提到过这个词，令人震惊的，骇人听闻的 irreparably adv 无法挽回地 permanently adv 永久地 Here is my take 这是我的看法 take 表示n看法，观点 anecdotally adv 传闻地 vast a 广阔的，大量的 花瓶是哪个词 vase all the above 以上所有 如果有人问是这个还是这个还是那个？不，是所有 stick out to you in your mind 在你脑海里凸显出来 &#x3D;&#x3D; 令你印象深刻 glue v 专注于 be glued to &#x3D;&#x3D; pay attention to 1I think most people are pretty glued to their screens. stick out most of me 最令我印象深刻 formative a 形成的，持续重大影响的in our formative years 在我们成长时期 frenzy n 疯狂，狂乱 v 疯狂 media frenzy 媒体狂热 anomalous and rare 异常的 罕见的 coin n 硬币 v 铸造，创造 coin the phrase 发明这个词 posit v 假设，认定 这里用法和assume claim一样表示某人认为 justification n 正当理由，辩护理由 rationalize v 使合理化 之前pod出现过 affiliation n 加入，联系 political affiliation 政治立场，政治联系 regardless of 不管 12We rationalize a way instead of holding people to sort of same standard regardless of which political affiliation they have.我们采用一种合理化的方法，而不是不管人们属于哪种政治派别，都用同样的标准来要求他们。 taboo n 戒律，忌讳 unthinkable a 不可想象的 polarize v 两极分化polarized society 两极分化的社会 wedlock n 婚姻，已婚状态 scandalized a 震惊的，反感的 我觉得还是听到丑闻那种惊愕和鄙夷的感觉 ostracize v 排斥，放逐 scarlet 猩红 scandalize v 诽谤 感觉就是对骂喷人揭短的感觉 他这里阐述了因为关系远近用不同标准衡量（维护或者诋毁）不同的人 party affiliation 政党关系 Democrat 民主党人 Republican 共和党人 counsel v 建议 n 法律顾问，律师 campaign n 竞选 have an affair with somebody 与。。有染 thrown off to the side 被丢到一边 word to the wise 给你点建议，忠告 老友记瑞秋 word of advise underling 表示下属 exonerate v 开脱，宣布某人无罪 cover something up 掩盖某事 toss v 掷，抛，折腾got tossed to the curb 被扔到路边（被抛弃） went into hiding 躲起来 at its dawn 在它的黎明时分，形容刚兴起时 12The internet was just at its dawn互联网才刚刚兴起 butt n 笑柄 in essence 本质上 dynamic a 活跃的，动态的 in the wrong 错了的 1A majority of Americans thought she was in the wrong. accountable a 对自己行为负责的 synonymous a 同一的 n 代名词 anonymous a 匿名的 put out 放出，熄灭 put out her Ted talk reclaim v.n 拿回，开垦 open jawed 张大下巴 1I&#x27;m just still a little open jawed. Democratic a 民主党的 spotlight n 聚光灯 operative n 工作人员，尤其政府特工 12三个不好的词sexism 性别歧视，racism 种族主义，privilege 特权 socioeconomic a 社会经济（学）的 back into the fold 回到正轨，重新回到某个组织 excommunicate v 开除，逐出（教门） 想起郭德纲清理门户，对就是清理门户这个词 weight in on that 对此进行权衡 readily adv 乐意地，容易地 outrage v 违反，犯罪，实施暴行 n 愤怒，暴行 12He focus mostly on this idea that an apology has to be costly to be effective.这就是之前提到的tit for tat incompetence n 无能力，不称职 idiotic a 白痴的 commitment n 承诺，保证 commit明明是犯罪，不过也是做，实施perform的意思 backfires 适得其反 news outlets 新闻机构，新闻媒体 polling data 民意调查数据 dope n 吸毒者 v 给。。服用兴奋剂&#x2F;麻醉剂 aboriginal n 土著 a 土著的 original 原来的 restitution n 赔偿，补偿 12如何道歉，划重点Most successful you focus on the victim so you start by talking about who is hurt. Talk very little about yourself or any personal justifications. And then you end by talking about how sorry you are. If possible you make restitutions. abjectly adv 卑鄙地，悲惨地，卑微地 mortification n 耻辱，屈辱 unequivocal a 斩钉截铁的，十分明确的 remorse n 懊悔，自责 mortify v 羞愧 ego n 自我 put kerosene on the fire 火上浇油 kerosene 煤油 swirl n 漩涡，弯曲 v 打转，旋转 recap v 重述，回顾 It failed you 它让你失望了 make it up for&#x2F;to you 弥补你 rupture v 破裂 off 直接表示错误的 we know our estimate was off count on 依靠，指望 1We&#x27;re working hard to give you arrival times that you can count on. 1money speaks louder than words blowout n 爆发，井喷 speculate v 推测 bracelet n 手镯 restitution sense 补偿意识 uptight a 紧张不安的，局促的 monetary a 钱的 memorable a 值得纪念的，难忘的 go way out on a limb 孤注一掷，冒风险做 parable n 圣经的寓言故事 之前的pod brilliance n 光辉，辉煌 the brilliance of Modern Family 《摩登家庭》的精彩之处 transgressor n 违法者 humiliate v 羞辱 ridicule v 嘲笑，奚落 base note 基调 symmetry n 对称 asymmetry n 不对称 之前pod出现 embody v 体现，包含 melodramatic a 情节夸张的，剧情狗血的 factual a 根据事实的 embodiment n 化身，具体体现 embodiment condition 实施条件 这个想表达真实施救情况 vernacular a 口语的，白话的 n 方言 cynical a 悲观的，愤世嫉俗的 nonverbal a 非语言的 susceptible a 易受影响的 ethnocentric a 种族为中心的，种族的 cue n 线索 v 给。。暗示 pro tips 专业提示 extenuating a 情有可原的，可减轻的 bystander n 旁观者 systemically n 系统性地，影响全局地 abusive a 辱骂的；恶语的；毁谤的；虐待的 whereas 然而 willingness n 意愿，自动自发 persistent a 执着的，不屈不挠的 tactical a 战术的 12have a little skin in the game在短语 “have a little skin in the game” 中，“skin” 指的是某人对一件事的投入、利害关系或风险。具体来说，“skin in the game” 表示某人为了追求某个目标或项目成功而投入了自己的资源，比如金钱、时间、精力等，因此如果事情不顺利，他们也会受到损失。","categories":[{"name":"English","slug":"English","permalink":"http://example.com/categories/English/"}],"tags":[{"name":"English learning","slug":"English-learning","permalink":"http://example.com/tags/English-learning/"}]},{"title":"English Pod Note","slug":"English Pod Note","date":"2024-09-13T19:00:00.000Z","updated":"2024-09-27T02:52:14.864Z","comments":true,"path":"2024/09/13/English Pod Note/","permalink":"http://example.com/2024/09/13/English%20Pod%20Note/","excerpt":"","text":"[TOC] 001 Elementary ‐ Difficult Customer (B0001)12345678910111213dialogue v.n 对话involved 理解为参与好一点 Two people are involved.May i take your order? 点菜用语be still working on it 介词 on 当别人问任务做完了没，可以用这个回答 I still need more time.come with 附带 语气就是(附)带薯条可乐么？complimentary a 免费的 free的替换词I will go with something/someone 做选择时候可用I will choose/take；或者表示我跟你一起去 I&#x27;ll go with U.angry at 对某人生气时候 朝向的介词用atfinish reading 完成某事 finish doingcasual 啧啧啧，随便！short way of saying... 缩写until then adv 在那之前001 Elementary ‐ Difficult Customer (B0001) 002 Elementary ‐ Calling In Sick (B0002)123456789101112131415161718quite ill 病的很重，很难受 I&#x27;m feeling quite illsynonym n 同义词once in a while 偶然call in sick 打电话请病假keep one&#x27;s ears open 竖起耳朵听runny nose 流鼻涕的鼻子feverish n 发烧 ~ish后缀be hoping to do 委婉请求take the day off 歇一天get some rest 休息的动作convinced 确信的I am coming down with the flu. 表示得病的前期，有点“我要感冒”impolite a 不礼貌的would have been 虚拟语气that would have been really bad for me... 那你上礼拜要是请假，那不就我一个人录节目了though 表示“不过”的语气speculation n 猜想，推测out of time a 没时间了 003 Elementary ‐ Daily Life ‐ Hotel Upgrade12345678910reservation under the name xxx 某人名下的预约we&#x27;ve been expecting you 我们一直在等你。注意时态用法keycard 房卡presidential suite 注意套房和sweet发音一样overbooked 订满了mix-up n 乱套，混乱come in handy 迟早要用上in case 以防万一震惊，印度火车升级为1st class座位five-course meal 五道菜，西餐的流程说法 004 Elementary ‐ The Office ‐ I need an assistant!123456789101112help you with your work around your offic. 介词 help ... with 还有这个around用的很厉害表示在办公室各个方面，如果用in只表示在办公室里会有个人帮你，不会强调广泛性help out 帮忙give me a hand 帮我一把，帮把手understaffed a 缺人手的the timing is just not right 这时候不合适，时机不对take on v 雇佣，担任 hireget hired by the companytake some of the weight off my shoulders 为我分担负担keep our costs down 省钱，省预算meet her 这里t变d，her的h被吞掉了，感觉her的h总不发音elaborate on that 阐述一下某件事sexist n 性别歧视者 005 Elementary ‐Daily Life ‐ Cut In Line12345678910111213141516cut in line 插队 When you are standing in a line somewhere, and somebody gets in front of you.It takes/took two hours to do somethinggo on vacation 度假course 常用于课程，在这是球场 golf course 不是高尔夫球课No seriously 不是吧I was here first 这个first表示第一个地，中文理解为我先到的says who 谁说的？这句话倒装了sue me 你告我去呀！impatient a 急躁的，没耐心的point out 指出no way 没门儿！ It is impossible!impolite a 不礼貌的take it seriously 对某事很认真严肃英国妹解释jump a/the queue，英国人的反应会指桑骂槐，they do it very obviously, speak it out loud.escalator n 自动扶梯 006 Elementary ‐ The Weekend ‐ Road Trip1234567891011road trip 自驾游the car&#x27;s packed 某物打包好了 everything you need is inside the carmunchies n 零食 snacksfill up the tank 加满油 put gas in your carall set 都完事了we&#x27;ve got all our bases covered 把基本情况都考虑进去了，准备好了let&#x27;s get going 开始吧pit stop 加油站，补给站，中国的高速服务区we&#x27;ve only been on the road ...hurricane hits 飓风袭击get down to business 开始做正事吧 007 Elementary ‐ The Office ‐ Virus!12345678910virus n 病毒pick up a virus 感染病毒froze v freeze 描述电脑卡了 your PC stops working.act up 出毛病，调皮捣蛋I&#x27;ll be right up 马上上来 be right there/down/outinfected files 中毒的文件anti-virus software 杀毒软件up to date a 最新的 This is the most up to date map.how come == whyturns out that 结果是 008 Elementary ‐ Daily Life ‐ What’s your nameagain? (C0008) 12345678conference n 研讨会I am in a bit of a hurry. 我有点急事meet up 偶尔见面，常联系contact details n 联系方式Something just slipped my mind. 忘了be terrible with name too 不擅长people can get in touch with you. 联系到你Is it a bank around here. right around the corner. adv 表示附近 009 Elementary ‐ The Weekend ‐ Silence please!12345678910speaking of movies 说到电影呢。。。展开话题用语movies n 电影院 cinema, movie theaterinconsiderate a 不体谅别人的keep it down 小点声 be quietswitch it off 关掉 turn it offnot such a bit deal: it is not importantcan&#x27;t hear a thing.Do you mind keeping it down?sarcastic a 讽刺的tone of voice 语气 010 Elementary ‐ The Office ‐ Driving Sales1234567891011drive sales 促销promotion n 促销和升职都可以用这个词 job promotionbuy one get one free which is a two for one promotionconcrete a 具体的，实际的How do you intend to do something? 你有什么想法？It&#x27;ll never fly with Swan. Swan 不会同意的I kind of like the sound of that. 这个听起来不错match the competitors 与竞争对手匹敌It sounds like something we should consider.brilliant a 牛Bcut them off 打断他们 011 Elementary ‐ Daily Life ‐ New Guy in Town1234567891011121314151617181920gossip v.n 八卦 gossip girl; gossip on somebodyweird == oddhousewarming gift 乔迁礼物pastry n 油酥点心I don&#x27;t know if you heard, ... 当你想分享八卦的时候的开场白fill me in 让我知道，快告诉我practically adv 简直，几乎peek into 瞥一眼，搂一眼you&#x27;ll never guess 另一个分享八卦的开场白pull into （车）停进，驶入coffin n 棺材you scared the heck out of me 你tm吓死我了 creep me outover 邀请别人来自己家都和这个介词有关get a bad feeling about someone 呃呃kick me out 把我踢出，轰出 they forced you to leavemisbehave v 行为不端car wrecking yard 废车场 scrap yardtake the part apart to sell 表述从wrecked car 上拆零件去卖moved away 搬走了juicy story n 爆料 012 Elementary ‐ Daily Life ‐ Cleaning the House123456789101112such a mess 乱成这样！disorganizedchores n 家务 do the laundryin the middle of something 正做。。事情，我正干。。事情 tidy up 收拾，打扫spotless a 一尘不染，无瑕dust v.n 名词是粉尘，灰尘 动词是擦去尘土，掸去on your way home 在回家的路上set the table 摆桌vacuum v 用吸尘器吸这的个动作 hoover the ruggrocery n 杂货，日用品I&#x27;ll be there in a sec. I&#x27;ll be there soon.why don&#x27;t you do something. how about you do something. You’ve known me for years? For me, I think this is the end of a beautiful friendship. 013 Elementary ‐ The Office ‐ Out Of Control Spending12345678910expenses n 费用，花费expenditures n 也是费用，开销，这个词更偏向于总体花费，比较宏大，类似聊经费预算office supplies 办公用品through the roof 直线上升，暴涨，（budget）烧穿房顶off the charts 超出预期，爆表that will be all 就这样吧！thorough adv.a 完全地，彻底地go over 仔细检查，排练，过一遍I will look into it 我会注意/看看的 check somethingI will take care of it 我会处理好它 014 Elementary ‐ I’m in Debt12345678in debt adv 背着债务，欠人钱 If I owe you money, I&#x27;m in debt.recession n 经济萧条hit me pretty hard 对我打击很大，重击broke a 破产了mortgage 贷款on top of all that 另外，除此以外ask for a loan v 借贷francs 法郎 015 Elementary ‐ Daily Life ‐ I’m sorry, I love you12345678knock over 击倒，撞倒 make it fall down 和 knock out 一样 KOexplode v boommean to do 故意做 on purposeget going 出发someone&#x27;s place 就是指someone’s housecoincidence n something happens by chanceI feel terrible 可以表示内疚难过we are so you think 就是你想的那样 016 Elementary ‐ Turn left here!123456789101112in a big hurry 匆忙speed up 加速slow down 减速what&#x27;s the rush! 着什么急!step on it 加大油门 drive fasternuts a 疯了的run a red light 闯红灯packed a 拥挤的，大量的take a side street 走小路have a fit 大发雷霆 get really angry, can&#x27;t control emotions.short cut 捷径cut through 穿过 go thru 017 Elementary ‐ Here Comes the Bride12345678groom n 新郎 the man is getting marriedaisle 过道 超市里面shelving units 之间的过道常用这个词ring bearer 持戒人priest 神父，牧师reception n 老美那种室外的自助partyit&#x27;s about time 该到时间了表达结婚要用get marriedWhen I get married, I wanna a huge wedding. 018 Elementary ‐ Upper ‐ Intermediate ‐ Protest!12345678910protest v.n 抗议bankrupt 倒闭，破产bailout 紧急救助，紧急财政援助irresponsibility n 不负责outrage v 激怒 n 愤怒，暴行mismanage v 对。。管理不当have the nerve to 好意思去做，舔着脸去做，厚颜无耻 how dare youfurious a 狂怒的，暴怒的injustice n 不公平，不公正break out 爆发 019 Elementary ‐ The Weekend ‐ Christmas Chronicles I1234567891011121314缺少的半句话：the state will appoint one for you. Do you understand all these rights that have just been read to you?eggnog 蛋奶酒get a load of 仔细看we&#x27;ve got ourselves a situation 我们遇到了状况’tis == it isDon&#x27;t take that tone with me 别用那种口气跟我说话invoice 发票under arrest adv 被捕了pout 撅嘴生气appoint v 任命，委派sleigh 雪橇get help 去求救，去叫人帮助step out 走出来 step in 走进去 santa的每只鹿都有自己的名字 020 Elementary ‐ I Can See Clearly Now12345678910struggle to do 努力做某事，挣扎着做某事blurry a 模糊的，难以理解的 blur v 使模糊prescription 药方make out 辨认出，理解，发现 at times 有时候20/20 vision 等同 5.0视力nearsighted 近视眼的blind as a bat 像蝙蝠一样的好眼力what seems to be the prob?head on 去，到 021 Elementary ‐ The Office ‐ What Do You Do?123456789101112缺少的半句话：daily operations of our quality control for the entire east coast that alone means I have 1500 employees under me.Fortune 500 世界500强nationwide 全国的under me 下属 working for meoversee 监视quality control 质量控制that alone means 仅仅这一点就意味着chosen by MoiraTop Gun 《凌云壮志》sarcastic tone 得瑟嘲讽的语气is going on about xx 谈论关于xx keeps talking aboutwhat do you do for living? 你干什么工作的？比what&#x27;s your job?地道地道地道It doesn&#x27;t sound natural. 022 Elementary ‐ The Weekend ‐ Christmas Chronicles II123456789elf n 精灵 little people with pointy hats 带着尖尖的帽子candy cane 拐杖糖book v 可以用作警察将某人的违法行为记录在案，可以理解为逮捕 booked this guy.reindeer 驯鹿Mayday 呼救就会喊这个backup 这里是增援 call for backup 注意发音 否则是后退的意思形容超速 you were/are speeding.impound v 拘禁，扣押ruined destroyed messed up 023 Elementary ‐ Making an Appointment1234567financial advisor 财务顾问，理财顾问arrange an apponinment with Someone 预约的时候动词可以不总用make/bookbooked solid 日程排满了 记得我们之前学的订超了 overbookedI&#x27;ve got something scheduled on Monday 我周一有约了/有事 scheduled 预定好的May I ask where your&#x27;re calling from? 你哪个单位？你谁？no good 不好 Tuesday&#x27;s no good. 周二不好，拒绝别人时候可以这么表达double check 非常常用的表达“我看看”，“我再检查一下” let me double check 024 Elementary ‐ Where should we eat?12345678910food poisoning 食物中毒 get food poisoningallergic a 过敏的 I&#x27;m allergic to seafood.stay away v 躲开check out 文中的check out是去看一看(吃一次)的意思 look atdecor n 装饰，装修bistro n 小店，小餐馆platter n 大盘儿，大拼盘a hole in the wall 苍蝇馆儿，简陋的小店give them a try 试一下tasty a 美味的，可口的，好吃的 025 Elementary ‐ Upper ‐ Intermediate ‐ Planning For The Worst1234567891011be managed to do 设法做某事order of business 这个词表示议程 something we must discusscontingency n 偶发，突发事件 backup planpandemic a 大流行的 n 传染病a pandemic strikes 疫情来袭as many of you are aware 你们很多人都知道head up 指挥，主导critical a 重要的，关键的come up with == think ofmedia coverage 媒体报道 coverage 新闻报道，覆盖范围I&#x27;ll leave this to you. 交给你了，留给你了 026 Elementary ‐ New Year Resolution12345678eating habits 饮食习惯New year&#x27;s resolution 新年愿望，或者叫新年立志，我今年一定要。。。cut out 割掉，除去，停止 cut out all junk I eat 戒垃圾食品 remove/eliminate/take it awayIt&#x27;s time for me to focus on my work. I&#x27;m going to cut out everything else from my life.stick to something/it 坚持某事，坚守某事I really mean it 我认真的 I am seriouswait and see 拭目以待 某外交部记者会常用词汇I&#x27;m stuffed == I&#x27;m full 饱了，撑了 027 Elementary ‐ Asking for Time Off12345678time off 休息时间，休假时间take some time off 休息一段时间use up 用完，耗尽notice 在这里表示提前告知unpaid leave 无薪休假in advance 提前Do you have a second? 有空么，忙着呢么？Well, I was just wondering... 我就是想问一哈。。。 028 Elementary ‐ Daily Life ‐ I’m Sorry, I Love You II12345relieved 松了口气，放松I wanna make it up to you. 我想弥补你my treat == it is on me 我请a twist of fate 命运的转轮啊。。。crash into 闯入 029 Elementary ‐ Advanced ‐ Investing in Emerging Markets12345678910emerging market 新兴市场downturn 衰退，下滑，低迷inevitable a 不可避免的mattress n 床垫，垫子get a jump start 快速开始nest egg 储备金，私房钱turmoil n 骚乱，混乱hit up 催促，乞求stimulus package 刺激计划aggregate demand 总需求 aggregate a 总计的 030 Elementary ‐ Daily Life ‐ New Guy in Town II1234567outcome 成果，在这里是结局 == endingthoughtful a 考虑周到的，体贴的 thoughtful invitation 周到的邀请appetite n 食欲 I have a big appetite.on earth 到底rope me into things 把我牵连进来 get meself into thisstay tuned 继续收听，持续关注give me creeps 吓着我了 make me feel uncomfortable 031 Elementary ‐ Canceling an Appointment1234make it 设法 make it to the meeting 赶得上某个会议postpone v 延期，推迟this thing came up 事情就来了 (刚要下班。。)inconvemience v 麻烦别人 n 不便，麻烦 032 Elementary ‐ Daily Life ‐ Opening a Bank Account12345678910issue v 颁发，签发overdraft n 透支额度No, that won&#x27;t be necessary 拒绝推销时候可以这样fill out 钱德勒在er，护士让他填表fill it outpaperwork n 填表，签字all set 完事 It&#x27;s all setmake a deposit 存钱 withdraw cash 取钱transaction n 交易，事务bank teller 银行出纳员，俗称柜员I&#x27;ll get you to... 礼貌用语 I&#x27;ll need your... If you could just do.. 033 Elementary ‐ Foul!1234567foul n 犯规ref referee 裁判screw up 搞砸free throw 罚球make a shot 投篮得分a beer run 买啤酒 run to get beertravel 走步 034 Elementary ‐ Upper ‐ Intermediate ‐ Live from Washington12345678910111213inaugural address 就任演说swear in 宣誓就职 sworn inoath n 誓言，宣誓who&#x27;s who n 名人，著名人物constitution n 宪法Hail to the Chief 向领袖致敬salute n.v. 致敬，鸣礼炮dignitary n 达官贵人The mood here is electric 气氛热烈palpable a 明显的go down in history 载入史册fellow n 伙伴 a 同伙的 这里是deardeliver the speech 发表演讲 035 Elementary ‐ Daily Life ‐ He’s not a Good Fit12345678910111213a good fit for 适合。。的。。representative n 代表，销售代表bottom line 底线be pleased with his performance 对他的表现很满意take .. for a instance 就拿。。举个例子work ethic n 职业道德It&#x27;s up to you. 由你决定，听你的coach a employee v 指导，训练unreliable a 不可靠的productive a 有生产力的attitude towards something 这里attitude的介词搭配overtime 加班overall 总体 in general","categories":[{"name":"English","slug":"English","permalink":"http://example.com/categories/English/"}],"tags":[{"name":"English learning","slug":"English-learning","permalink":"http://example.com/tags/English-learning/"}]},{"title":"java question","slug":"java_question","date":"2024-01-10T20:00:00.000Z","updated":"2024-01-10T20:14:47.317Z","comments":true,"path":"2024/01/10/java_question/","permalink":"http://example.com/2024/01/10/java_question/","excerpt":"","text":"[TOC] java43 Abstract class vs. Interface. When to use abstract class and when to use interface?","categories":[{"name":"java","slug":"java","permalink":"http://example.com/categories/java/"}],"tags":[{"name":"java","slug":"java","permalink":"http://example.com/tags/java/"},{"name":"interview","slug":"interview","permalink":"http://example.com/tags/interview/"}]},{"title":"vocabulary","slug":"vocabulary","date":"2024-01-03T05:37:24.000Z","updated":"2024-09-13T18:44:57.713Z","comments":true,"path":"2024/01/02/vocabulary/","permalink":"http://example.com/2024/01/02/vocabulary/","excerpt":"","text":"[TOC] 2000Text 1 1234567891011121314151617181920212223242526272829303132333435363738394041effortless a 不费力的dreadful a 糟糕的，令人讨厌的handicap n 障碍，缺陷driving force n 驱动力competitor n 竞争者unparalleled a 无可匹敌的economies of scale 规模经济prosperous a 繁荣的inevitable a 不可避免的primacy n 首要retreat v.n 撤退predominance n 优势，主导地位，支配地位at a loss over 面对。。的时候不知所措competitiveness n 竞争力vanish v 消失textile n 纺织品，纺织业sweeping into 涌入，席卷，横扫looked as though 看起来像semiconductors n 半导体invented a 发明casualty n 受害者crisis n 危机prosperity n 繁荣take … for granted 把。。当成理所应当的inquiry n 调查sensational a 轰动的，耸人听闻的look back 回顾solely ad 仅仅地，单独地devalued 贬值的yielded to v 屈服于quick-witted a 明智的dean n 院长productivity n 生产力think-tank n 智库painstaking a 辛苦的workforce n 劳动力impetus n 动力，刺激manifested v 证明，表明suicidal actions 自杀行为revival n 复苏be attributed to 归因于","categories":[],"tags":[{"name":"en","slug":"en","permalink":"http://example.com/tags/en/"}]},{"title":"Hello World","slug":"hello-world","date":"2024-01-01T10:01:37.983Z","updated":"2024-09-13T18:23:35.448Z","comments":true,"path":"2024/01/01/hello-world/","permalink":"http://example.com/2024/01/01/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment I have to say the version of NPM, in case I forgot it. 1v18.9.0","categories":[],"tags":[]},{"title":"Leetcode169","slug":"Leetcode169","date":"2023-09-11T19:00:00.000Z","updated":"2024-01-02T01:31:03.394Z","comments":true,"path":"2023/09/11/Leetcode169/","permalink":"http://example.com/2023/09/11/Leetcode169/","excerpt":"","text":"插件 1https://github.com/SimplifyJobs/Summer2024-Internships 169地址 1https://www.techinterviewhandbook.org/grind75 [TOC] Week11.Two SumMap要有泛型 hashmap.containsKey(i) hashmap.get(i) hashmap.put(i1,i2) 20.Valid Parentheseshashmap初始化可以写为，注意结尾的引号 123private static final Map&lt;Character, Character&gt; map = new HashMap()&#123;&#123; put(&#x27;(&#x27;,&#x27;)&#x27;);put(&#x27;[&#x27;,&#x27;]&#x27;);put(&#x27;&#123;&#x27;,&#x27;&#125;&#x27;);&#125;&#125;; str.length() 注意有括号Parentheses Stack可以用linkedlist实现，方法是addLast(c)和removeLast()这个会得到删除的元素 stack.size() 遍历一个字符串时候 Character c:s.toCharArray() 按照index找字符串中的字符时候 str.charAt(index) 防止一上来加入的字符就是后半个括号，向往stack里加一个特殊字符? 也可以使用Deque“代课” deque.pop() deque.push() deque.peek() 21.Merge Two Sorted Lists递归 链表指针的移动 121.Best Time to Buy and Sell Stock卖股票得最大利润 简单题需要记录当前最大利润和记录当前最低点 125.Valid Palindrome 回型文2种思路，1是新建字符串拼接反转后对比，2是在原有基础上双指针对比 StringBuffer的&#x3D;&#x3D;比较的是地址，equals方法也没被重写，所以对比两个字符串的值等不等需要先toString()再equals() 12345Character.isLetterOrDigit()Character.toLowerCase(ch) Character.toUpperCase(ch) 226.Invert Binary Tree递归，本质是深度优先遍历 depth first traversal如果root为null, 0 就return, 否则做必要动作，然后return root 栈迭代，本质是广度优先遍历 breadth first traversal这个套路是先把root节点加到栈里， 242.Valid Anagram 相同字母异序词 ‘A’ 的ASCII码值是 65。 ‘a’ 的ASCII码值是 97。 ‘Z’ 的ASCII码值是 90。 ‘z’ 的ASCII码值是 122。 第一种方法是Arrays.sort() 然后Arrays.equals(a1, a2) 第二种是用一个alphabet的长度26的array维护统计字符个数，然后看是否数量相等 704.Binary Search二分查找 简单题 733.Flood Fill队列也是用LinkedList实现 queue.offer() 代表添加queue.poll() 删除 第一种方法是Breadth first traversal 什么时候用Queue, 什么时候用Stack需要甄别 这种二维数组画pixel都要考虑边界是否越界 123if (mx &gt;= 0 &amp;&amp; mx &lt; image.length &amp;&amp; my &gt;= 0 &amp;&amp; my &lt; image[0].length) &#123; dfs(image, mx, my, currColor, color);&#125; 235.Lowest Common Ancestor of a Binary Search Tree找最小祖先 这是Binary Search Tree的正向利用 110.Balanced Binary Tree首先height-balanced Height-Balanced A height-balanced binary tree is a binary tree in which the depth of the two subtrees of every node never differs by more than one. 这个题目用递归，一个方法找当前的height, 一个方法查看当前节点是否balanced 2 just calculate height of current node. If the any descendant of current node is unbalanced, the current node would be unbalanced too. 这种方法just calculate the height of current node. 141.Linked List CycleHashSet 或者 快慢指针 HashSet 中 set.add()方法会返回是否添加成功，因此可以判断是否有重复快慢指针的精髓在于slow每次走一步slow.next, fast每次走两步fast.next.next 232.Implement Queue using Stacks原理是一个栈是入栈，一个栈是出栈，出的时候先看出栈，出栈为空的时候需要有一个从入栈到出栈的压入过程 12345private void in2out() &#123; while (!inStack.isEmpty()) &#123; outStack.push(inStack.pop()); &#125;&#125; Week 2278.First Bad Version本质是binary search，寻找相同情况最左点。 注意这个不是找对应数字，这是找连续数字的最左点。 383，Ransom Note 勒索信str转字符数组str.toCharArray() map.getOrDefault(c, 0) 可以用数组存储26个字符的方式，我用的map存储，两个for循环 Week 357.Insert Interval往一个顺序的且不重叠non-overlapping区间中插入一个新的区间，不能重叠（合并新区间和老区间重叠的部分） 给的是int的二位数组，先新建一个list，最后再循环一边list，把答案导入新的int二维数组。重点是循环原数组，然后将老数组中每一个区间和新区间比较，一共三种情况，重叠就合并。","categories":[{"name":"leetcode","slug":"leetcode","permalink":"http://example.com/categories/leetcode/"}],"tags":[{"name":"leetcode","slug":"leetcode","permalink":"http://example.com/tags/leetcode/"}]},{"title":"NSQ scripts","slug":"NSQ scripts","date":"2023-09-11T19:00:00.000Z","updated":"2024-10-08T22:48:28.528Z","comments":true,"path":"2023/09/11/NSQ scripts/","permalink":"http://example.com/2023/09/11/NSQ%20scripts/","excerpt":"","text":"[TOC] When Do You Become an Adult?MAUGHAN: Angela, we have a fascinating question today about adulthood. DUCKWORTH: “Adulting” or adulthood? MAUGHAN: Well, adulthood, I think, but I think they’re tied together, and I don’t know that I’m good at “adulting.” I don’t know how you are at “adulting,” but it’s kind of forced upon us at a certain age. DUCKWORTH: It is. MAUGHAN: So, here’s the question: “Who decided, and when was it decided, that the age of 18 years old is considered an adult? Why hasn’t this evolved with our understanding of human brain development? Thank you so much for considering my question, Alison.” DUCKWORTH: Oh, so nice, Alison. MAUGHAN: Yeah, I think this is a great question — my favorite is like, “Who decided?” Like, “Who, who are you to tell me that 18 is an adult?” DUCKWORTH: Do you know the answer to that question? Because I know the neuroscience and the psychology on that question, but I don’t know who decided it was that at the age of 18 we are able to vote and do some other things. MAUGHAN: I weirdly do know the answer to that, but before we jump into that, I want to ask you a question first. Was there a time in your life when you finally felt like, “I’m an adult? DUCKWORTH: I think in high school, I actually did have a little vague feeling about this, and it’s partly because my parents, whom I loved and who were caring, were very occupied with raising my older brother and sister and they were a handful. And so, the kinds of things that some parents do, like, “Hey, it’s time for your physical,” or like, “You should probably get an eye exam,” or, “It’s time to send out Christmas cards. And maybe we should put out a jack-o’-lantern because it’s Halloween.” So, basically I did all those things in high school, and they are kind of adult things. So, obviously that was all before I was 18, but honestly, I think my first load of laundry — like, you know that first load of laundry that you do completely by yourself, and you’re, like, paying complete attention to the task. You’re like, “And then the dryer sheet goes in the, dryer.” Like, I think the first load of laundry I did, I was like, “Now I am an adult.” MAUGHAN: See, I think I thought of when did I become an adult, and I remember moving to college — which by the way was 45 minutes away from the home I grew up in. And I thought, “I am an adult now. I’m moving out. I’m on my own.” And those first two weeks, I called home maybe 12 times, because I was so homesick. And I thought, “Maybe I’m not as much of an adult as I thought I was.” DUCKWORTH: Did you drive yourself? Your parents didn’t drop you off? MAUGHAN: No, and that is so funny because it’s become a conversation in my family. My parents were always just like, “Hey, good luck!” My friend Dave Smith and I packed my family’s Suburban — I took half the Suburban, he took half the Suburban — for all of our stuff, and we listened to Billy Joel’s “Moving Out.” And I thought I was an adult, but then I realized that maybe I still need my mom and dad. DUCKWORTH: Well, I absolutely cried when my parents dropped me off. And I remember distinctly the feeling of watching the car get smaller in the distance. And there was just this, like, sinking feeling, and it was like, “I want my mommy.” But yeah, there are these transitions, and, you know, psychologists have been thinking about this forever. But you said you bizarrely know the answer to this. So, who decided that 18 — MAUGHAN: Right. So, Alison, I’m going to answer that. First of all, there’s this thing called “age of majority,” which is different than what’s called the “legal age of license.” So the age of majority is when you are legally considered an adult and fully responsible for your own actions. DUCKWORTH: So, that’s 18. MAUGHAN: Most places now view the age of majority — or age of adulthood, if you will — as 18. Now, there are a few states in the United States — Alabama and Nebraska, for example, say the age of majority is 19. Mississippi says the age of majority is 21. That does not mean, however, that you can’t vote or any of those things. DUCKWORTH: That’s federal, right? MAUGHAN: Right, and so, legal age of license, which is slightly different, that’s when, for example, you can participate in certain activities like drinking alcohol. What’s interesting is the historical fluctuations. And the age of majority, fluctuated over time between being the mid-teens and mid-twenties for what’s adulthood. So, if we go back to the Romans, because everything goes back to the Romans. DUCKWORTH: At least over here, in this part of the world. Go on, yes. MAUGHAN: The Romans in the early days considered 15 for males. They said that’s when they have obtained the intellectual capacities required to exercise full citizenship, manage their affairs, become parents, and the heads of families themselves. Now, for anyone who’s met a 15-year-old, God bless the 15-year-old Romans. DUCKWORTH: Okay, wait, I need to interrupt you very briefly and say it’s possible that 15-year-olds back then were not the same as 15-year-olds now. MAUGHAN: Yes, 100 percent true. But basically this is because they were correlating adulthood with puberty. And the onset of puberty roughly was 15 for males back then. What’s interesting, though, is that they still didn’t trust these 15-year-olds completely, so they would place them under temporary guardianship of adults who were known as “curators,” and the curators would validate any formal action that the 15-year-old took until they reach the age of 25. So, it’s kind this, like, balance between you’re an adult at 15, but you’re a supervised adult for 10 years. DUCKWORTH: Okay, so this is the historical origin of 18. So it started off as 15. MAUGHAN: But then it changes. As the nature of warfare changes, we start to think of adults differently. Hop with me for a minute over to England. So, in the Middle Ages, think about all the weight of defensive armor. And so the age of eligibility for knighthood turns into age 21, because that was when they felt like you could be an actual warrior. DUCKWORTH: Like, you were strong enough. MAUGHAN: Right. And so they change it to 21 if you’re in the military. But the age of adulthood stayed about 14 or 15 if you were an agricultural status. So, I should just say, for centuries, the tradition spread widely because of the role that the English played — 21 became that age of adulthood in much of the world. But it was, once again, war that changed it in the U.S. to 18 because we didn’t have enough people that were entering the military. So, in 1942, Congress lowered the age of conscription into the military from 21 to 18, and then that led to the 26th Amendment in the United States, where it was like, “Hey, look, if you can send me into war at 18, then I want to be able to vote at 18.” DUCKWORTH: Ah, so voting followed the draft. MAUGHAN: Yes, because it was like, look, if you can send me into war, I should be able to vote for who my leaders are. And then, kind of everything flowed from there, that 18 became the age. And it’s so interesting that so much of it comes down to warfare. Not psychology, not brain development, not maturity, but warfare. DUCKWORTH: So, in the kind of like, “Well, who decided?” It sounds like there are political — I guess you could say pragmatic, but definitely political forces that say 15, 18, 21. Okay, back to 18. Well, 21 for this, 18 for that, right? MAUGHAN: Or if you’re on the farm, then we need you to be an adult earlier, versus if you’re out there fighting a battle, we’re going to call it something different. DUCKWORTH: Well, the thing you said about there are two bright lines — you said there’s an age of majority, which is kind of a confusing expression except for when you think of children and teenagers as being minors. I guess that’s why it’s called the age of majority. You are no longer a minor. But then, there is the blah, blah, blah, blah about license? What was that phrase? MAUGHAN: The legal age of license. DUCKWORTH: Somehow, like, that phrase sounded, like, so long to me, but okay, again, the legal age of license. So, that being a different bright line, that’s a different demarcation for adulthood, at least in terms of our laws. So, that one was, you said it was like drinking, for example, and — MAUGHAN: Yeah, and they can match up or they might not. So, if you look at some of the history: when Prohibition ended in 1933, most states set the drinking age to 21, which at the time also equated to the voting age. That continued until, again, we talked about this —. DUCKWORTH: We needed soldiers, yeah, the draft. MAUGHAN: Yeah, that’s when we moved the voting age to 18 with the Constitutional Amendment. A bunch of states, in turn, lowered the drinking age to 18. But then, in 1984, President Reagan comes in and he says, “Look, you need to raise the drinking age because of drinking and driving.” It became this massive national problem, especially on kids who hadn’t quite developed the brain function, etc. So, he basically strong-arms all of Congress to pass this National Minimum Drinking Age Act, where he said that if states don’t raise the drinking age from 18 to 21, then he would cut funding for their federal highway funds. So he forced all these states to raise the drinking age to 21, but it had been 18. DUCKWORTH: Until Reagan? I did not know that. And are all states in the United States 21 for drinking? MAUGHAN: Yes, so every state abides by the standard of age 21 for drinking. DUCKWORTH: Okay, so here’s what I want to say about the age of majority and the legal age of license. So, when you’re a child, you’re a child. And when you’re an adult, you’re an adult. And I guess different societies have made the bright line differently. But there’s also this stage that is in between childhood and adulthood. I think every society would agree that it’s not childhood to adulthood, it’s childhood to adolescence to adulthood. One of my favorite adolescent psychologists is Larry Steinberg. And he is one of the world experts on this transitional stage, right? I think one thing Larry would want everyone to know is that all mammals have adolescence. It’s a phase that is biological, and it is this transition sexually. So, you know, the hormones change, you develop the ability to reproduce. And during that stage, you actually also engage in a bunch of behaviors that are true across mammals. And I find this fascinating, because there is a kind of teenage phase — even for, like, mice and rats. MAUGHAN: I’m just thinking about, like, elephants being teenagers and, like, getting in trouble and testing the rules. DUCKWORTH: Right. I think what’s so funny is that during this stage, you know, adolescent mammals do, like, stupidass things, like, risk-taking, sensation-seeking behaviors. And so, one of the things that Larry has thought hard about as a prominent adolescent psychologist is: when should these bright lines be made? And he’s smart enough to understand that no policymaker can handle like, “Well, it shouldn’t be —” like, you need to have bright lines. He kind of understands that even though there’s complexity, you cannot govern a society where you’re like, “For this, it’s 16 and a half, except for if this person hasn’t reached this milestone.” I mean, he gets it. MAUGHAN: Right, that’s what’s so tricky, because the development of individuals is not uniform, but to your point, from a policy-making standpoint, you can’t have just a mushy middle forever, so we have to draw these lines. DUCKWORTH: So, he has these two lines as well. So, he wrote this article in 2019, so not that long ago with a postdoc named Grace Icenogle, and it’s entitled, “Using Developmental Science to Distinguish Adolescents and Adults Under the Law.” And, you know, he summarizes decades of research, including the neuroscience on brain development. And he says, “Look, we need two lines. Here’s one line.” And this line comes earlier. By age 16 — Larry wants to argue, and I would agree with him — it’s at that age at our capacity to reason logically is actually fully mature. MAUGHAN: At 16? DUCKWORTH: At 16. Now, by the way, you can point to these 16-year-olds and you’re like, “Seriously?” But he makes this distinction. He said it’s in cool decision-making contexts. In other words, like, not emotional, not peer-pressured. But if you actually give 16-year-olds logic puzzles, and, like, reasoning puzzles, they are just as good, if not better, honestly, than many of their older family members. For example, voting, you know, thinking about the upcoming election when obviously our voting rules are not going to change. I think Larry would argue that 16-year-olds should be fully capable of reasoning in a cool context. Now, you might not argue that this election is a cool context, but I think this is what he means. MAUGHAN: And “cool” not meaning, um, fun, popular. Cool as in, like, non-emotional. DUCKWORTH: Oh, yes. Not Stanley Cups and Adidas Sambas, but, like, “cool” as in not emotionally hot. He says, it’s a different thing when you’re asked to make decisions in a hot context. That’s one that, you know, there’s time pressure, there’s peer pressure, and there’s something emotional. Like, say you’re angry. That’s actually where teenagers get in trouble. Teenagers actually do not get into trouble in, like, pencil and paper hypothetical scenarios. They do not make stupid decisions. But when they’re with their friends and they’re in these, like, emotional, anger-inducing, or embarrassment-inducing, or, and also, you know, I mentioned this, like, thrill-seeking and sensation-seeking. Whenever I talk to undergraduates, I mean, I sound like that old person, but I do tell them, I’m like, “If you can get through this period of time, as you move into your mid-twenties, the urge to do those stupidass things, it just fades. Like, this one kid in my class was like, “So Dr. Duckworth, do you mean this? When I was a kid, well, not that long ago, actually, I guess I was in high school, there was a steep hill near my house. And I would ride my bike to the top of the hill, and then I would go down as fast as I could, with no brakes, right through an intersection.” MAUGHAN: Oh my gosh. DUCKWORTH: “Again and again, because it was fun.” And he was like, “And Dr. Duckworth, I, I kinda think that’s crazy now, like, I would never do that.” And I’m like, “Yeah, that’s what I mean.” MAUGHAN: So, here’s this distinction, though, that sounds like you’re making is: this kind of cold-decision making. In other words, like, the rational, thoughtful, analytical, logical. And then, there’s the hot, and the hot takes a lot longer to master, if ever. I don’t know that any of us ever master this idea of peer pressure, frankly. I mean, I think we’re maybe less susceptible to it. DUCKWORTH: I think he wants to say 21 — and by the way, you know, he’s not saying that, like, a miracle happens between 20 and 21 on that day. But again, he’s a practical guy. So he was like, you know, a society has to have laws and the laws have to have round numbers and you need that unambiguous separation. But the reason why he says 21 is very much informed by brain research. So, like, basically, the prefrontal cortex — you know, the part of your brain that sits right behind your forehead — it is the last to develop in evolution, and it’s the last to mature in your life. And so, for anybody who has young people in their lives, you should just know, like, this part of the brain continues maturing structurally and functionally well into your twenties. And there’s some disagreement about exactly how long, but part of Larry’s reasoning about age 21 is that that part of your brain that is in charge of impulse suppression, task switching, working memory, all that stuff, that is the part of your brain that you absolutely need to be had on, you know, high alert and in high functioning when you’re in an emotional hot decision-making context. And the other reason I know that Larry thinks about 21 is because when I told you about the sensation-seeking impulse — that is really strong throughout your teens, and it starts to fade. And so, I think that’s why Larry wants to say, and I’ll quote him from his article, “Some of the legal situations that require mature self-regulatory capacities: driving, consuming alcohol, gambling, resisting impulses” — these are the ones that a society should set a legal boundary that’s possibly as old as 21. He also mentions 18. But it’s not 16. MAUGHAN: I do know that Angela and I would love to hear your thoughts on what it means to be an adult and when, if ever, did you start to feel like a grown up? So, record a voice memo in a quiet place with your mouth close to the phone and email it to &#78;&#83;&#x51;&#64;&#x46;&#114;&#101;&#97;&#107;&#x6f;&#110;&#111;&#x6d;&#x69;&#x63;&#115;&#46;&#x63;&#111;&#109;. And maybe we’ll play it on a future episode of the show. Also, while being an adult is hard, sharing a podcast is simple. So if you like the show and want to support it, please do the responsible grown-up thing and tell your friends about it. You can also spread the word on social media or leave a review in your podcast app. MAUGHAN: Our view of what an adult is, I think changed a bit. And I, I look at this Atlantic article I read by a woman named Julie Beck: “When Are You Really an Adult?” And it talked about how this transition to adulthood used to be this big collection of markers: getting a job, moving away from your parents, getting married, having kids. But what we’re seeing is this massive trend across the United States, but also happening in many societies globally, where people are getting married later, having kids later, moving out later, or maybe even as adults living with their families. And so, adulthood isn’t always still associated with age of your body, it’s not always associated with the development of the mind, but rather we have these constructs. And I think one fascinating thing I listened to recently was from Trevor Noah, who’s the comedian, wrote one of my favorite books, Born a Crime. But he talks about this almost infantilization of singlehood. And that we treat single people as sort of not fully-formed adults, because we have this preconceived notion that adulthood should include all those things that Julie Beck listed in her article. DUCKWORTH: Well, okay, that is its own super interesting debate. I thought you were going to say Jean Twenge when you said The Atlantic*, because Jean Twenge is — well, she’s a professor of psychology at San Diego State University and she’s very famous, actually, for writing in places like* The Atlantic. MAUGHAN: Yeah, and we’ve talked about Jean’s work before. DUCKWORTH: Right. So, she wrote this paper with another professor named Heejung Park, and it’s called “The Decline in Adult Activities Among U. S. Adolescents, 1976 — 2016.” So, over this 40-year span, fewer teenagers in the United States engaged in what she calls “adult activities.” I guess we could debate that. And here they are: having sex, dating, drinking alcohol, working for pay, going out without parents, driving. And so, she’s documenting that there is this shift. Now, I do want to give you, like, the evolutionary argument for all of these changes. The human body, we go through puberty. And in that phase all these things come online. For a long time, I think people thought like, “Oh, it’s biology.” Like, somehow your cells know on a certain day to change. You know, the testosterone or the estrogen starts flowing. But one of the major theories in evolutionary psychology right now is called life-history theory, and it says that these things that you think are just fixed and just are, like, on some kind of cellular clock, they’re profoundly influenced by experience and there’s an evolutionary reason. If you sense that you are in a chaotic, uncertain, and dangerous environment, you better get to adulthood fast. Get to adulthood, reproduce, and get the hell out of there. You don’t have a lot of time. But so this life history theory says, like, what if you have the sense that you are in a stable, rich, secure environment, where you’re probably going to live for years and years? Well, then you have an incentive effectively to forestall puberty and whatever line you want to give yourself for being in adult roles, and whatever responsibilities, and everything. And here’s why. It’s the period of childhood and also adolescence where you learn the most. So, this theory says that you can procrastinate on adulthood if you live in a secure world, because then you have time to learn from your parents and to go and get more educated from your peers and to develop skills. So, this life history theory is actually one of the things that Jean Twenge draws upon. She also thinks that social media as an invention is a major reason why people are, like, not going out as much and doing some of the things that teenagers used to do. MAUGHAN: Well, I think it makes a lot of sense that your body’s ability to say, hey, I can postpone puberty because I’m in a safe environment versus the evolutionary response to I’ve got to reproduce. And, and you look at marriage and the age for marriage, in previous societies girls would be married as — and current societies in some parts of the world, there’s still lots of teenage marriage. For example, in Iran, there were 35,000 marriages between March of 2017 and 2018 of girls who were between the ages of 10 and 14, 170,000 marriages of girls between 15 and 19. So, there’s still this idea in some parts of the world, but certainly in other times, it was very customary to get married at a very young age. Mary the mother of Jesus was 14, they say. I have no idea who came up with that number, but biblical historians would say that, right? DUCKWORTH: I did not know that. MAUGHAN: So, this idea, I think, that goes along with this concept that you’re talking about. With a less stable environment, with a lower lifespan, there was just this, we’ve got to go reproduce earlier. DUCKWORTH: I mean, one of the things that I had to look up actually at some point — and you know, I am, in some respects, an adolescent psychologist, so I kind of can’t believe that I had to look this up. But the age of puberty. So, puberty actually is starting biologically earlier than it used to. And there’s an evolutionary argument for that too. MAUGHAN: Wait, it’s starting earlier? See, I would have guessed the opposite. DUCKWORTH: That’s why I had to look it up! MAUGHAN: Because they’re in a more safe, stable environment. DUCKWORTH: Now you’re making me feel less stupid, because I was like, “Wait.” Just thinking about this life history theory, you’re like, “Oh, well, you’ve got time. Isn’t that why we’re going into adulthood later? Like, there is some sense to that. So, there’s evidence from one of my very favorite neuroscientists. Her name is Allyson Mackey, and she studies the developing brain. There’s evidence that our molars, you know those big teeth in the back of your mouth, this emergence of permanent molars, the molars that you don’t lose — her research shows that the more early life stress you have, the earlier your molars erupt. And she would argue, in this life-history theory context, that would be consistent with people who grow up in secure, enriched environments are sort of waiting, right? The pace of development is slowed down so you could capitalize on learning and exploration. So, I don’t think we’re wrong to think, like, “Wait a second, wouldn’t puberty be later?” But here’s the complexity of the human condition, Mike. Like, other things are also true. And one of the reasons why puberty is a movable event and it’s not preprogrammed into your cells that it’s like, okay, exactly on this day, is that other things also influence, including nutrition. So, that’s the big thing. So, when an animal has enough food, and also you have to as a female predict that you can make it through pregnancy and then nurse this child. Anyway, we are consuming more calories and we’re consuming a lot more calories than we did in childhood than we used to. And so, that is I think probably the biggest — I don’t know, but I would just venture a guess that lots of things are going on, but one of the things that’s going on is that we eat so much more. MAUGHAN: Just raw calories. DUCKWORTH: Just raw calories. And so that makes the age of puberty go earlier. So, it’s complicated, but let’s just put two facts together. If the age of adulthood is getting later, and the age of puberty is getting earlier, then you have this extended adolescence. And some scientists would say, like, that is a historic event, that we have this adolescent period, where you’re not strictly a child, but you’re not fully an adult. It really is an unprecedented phenomenon. MAUGHAN: And I don’t know that any of us know yet the good or bad ramifications of it. Angela, I wanted to just bring up, as we close this conversation, a survey that was done by resumetemplates.com that got a lot of press. DUCKWORTH: Ohh, that sounds, uh, extremely verifiable, resumetemplates.com? MAUGHAN: It shocked me. DUCKWORTH: Okay, I’m going to hold my breath. Go on. MAUGHAN: They asked 1,400 Zoomers, which is kind of the Gen Z — they call them “Zoomers.” DUCKWORTH: Oh, that’s a thing? Okay, “Zoomers.” MAUGHAN: But, they asked them a bunch of questions about jobs, and job interviews, and resumes, and stuff like that. And they found that 10 percent had had their parents write their resume. Sixteen percent of respondents said their parents had submitted job applications for them. But this was the number that shocked me most: 26 percent of Gen Z respondents said that at one point or another they had brought a parent with them to a job interview. DUCKWORTH: What? They brought their mom or dad to their job interview? I can’t believe — is that possible? MAUGHAN: I would immediately invite both to politely exit the office and never come back. Now, maybe in fairness, they meant, “I got a ride.” I don’t know. Anyway, my point is this: that was a shocking stat to me. And sometimes in our prolonged adolescence, maybe we’re doing it wrong if that’s what we’re doing. DUCKWORTH: I mean, I have heard complaints — you know, as a university professor, right? I teach — I guess you could call them adolescents between 18 and 22. Some scientists, by the way, want to argue for a new term because, you know, if you’ve got this adolescent period that’s so long, they’re like, “How about if we rebrand the part of this life course that’s between 18 to 25,” so think about, like, basically your college years and your first job. There’s some people, most prominently Jeffrey Arnett, who’s a professor of psychology at Clark University, he wants to rebrand that as “emerging adulthood,” or he wants to say that’s, like, a distinct developmental period. At any rate, I teach these adolescents, or if you want, you can call them “emerging adults.” But it is interesting, because I have heard stories, complaints from my fellow faculty who are like, “This kid had their mom call me about their quiz grade. Like, I used to get these annoying complaints from the students themselves, and now I’m starting to get complaints from parents who are like, “Excuse me, professor, but, you know, I think this grade was unfair —” Like what? So it is interesting. MAUGHAN: That is mind-blowing. DUCKWORTH: I take back “interesting.” Mind blowing. Horrifying. Catastrophic. MAUGHAN: Yeah, interesting was the nicest way you could possibly say that. DUCKWORTH: Yeah. I will say this. I grew up in this neighborhood where everybody had a bar mitzvah or a bat mitzvah other than me. Because it was a highly Jewish area. And I lost count, but I think at some point I had, like, 27 bar mitzvahs or bat mitzvahs in, like, a year. I remember one day I went to three. Of course, this is a ceremony where you enter adulthood at a single point in time. And it’s not the only tradition where, you know, you were a child and now you are not a child — you are an adult. But I didn’t have that ceremony, not being Jewish. So, then I you know, wondered like, oh, well, if I don’t have this rite of passage, you know, when does it happen for me? I do think, and I have long thought, that the United States — maybe because we’re so diverse, right? Maybe because we’re a melting pot — or choose your metaphor — we don’t actually have a consensual — like, we don’t have how do you say it? Quinceañera? Is that the — you speak Spanish. MAUGHAN: When you’re 15, you have a quinceañera, yeah. DUCKWORTH: Quinceañera. But, like, many societies have a rite of passage, as it’s called. Like, we are going to, as a society, induct you into the next chapter of your life. And it’s not this, like, super gradual, maybe at some point, you’ll wake up one day and feel like you’re on the other side of the line. And I have long thought that the United States would benefit from some kind of clear social ritual — not a private ritual, but a social ritual — where you can say, “Now you’re an adult and here are the responsibilities.” So, I know this is not going to happen. Like, I don’t get to legislate this. MAUGHAN: “Everyone must throw a party at this stage.” DUCKWORTH: We could agree on that. MAUGHAN: See, I always viewed high-school graduation as sort of that moment. It’s a lot of pomp and circumstance. You’re 18, usually, I mean, when you’re graduating. It’s not an individual celebration, like a bat mitzvah, or a bar mitzvah, or a quinceañera, but it is sort of that ritualistic, like, you’re crossing a stage, you’ve now completed —. DUCKWORTH: That’s right. You’ve, like, donned a gown. By the way, most rites of passage have these things: like, everybody shows up in a certain costume, there are songs — MAUGHAN: And rituals associated with it. DUCKWORTH: Yeah, there are people of authority who usually, like, say the same thing over and over — I mean, it is like a bar mitzvah or a bat mitzvah. So, funny that you thought of that as high-school graduation. Now, some would argue it has to be college graduation. Obviously not everyone goes to college. But then some would argue that you go to these college graduations, you hear “Pomp and Circumstance,” people go out to dinner, and a lot of people would say, and I would agree with them, that those 22-year-olds are not thinking like, “And today I’m an adult.” MAUGHAN: It’s a fair point. So, Alison, thank you for your question. Who decided? Sounds like warfare and the Romans a little bit. When was it decided? I think that what Angela and I have discovered is that it’s still being decided. And thankfully, we have a lot more science and neuroscience and understanding of the brain nowadays. But I will just say, as my closing remark, if you ever want to really be considered an adult, don’t ever, ever bring your parent with you to a job interview. DUCKWORTH: And it’s never too early to start doing your own laundry. 1234为什么这没有随着我们对人类大脑发育的理解而发展？Why hasn’t this evolved with our understanding of human brain development?因为我了解有关这个问题的神经科学和心理学知识，但我不知道是谁决定我们在 18 岁时就可以投票和做其他一些事情。Because I know the neuroscience and the psychology on that question, but I don’t know who decided tha at the age of 18 we are able to vote and do do some other things. What Does It Take to Survive a Scandal?MAUGHAN: Angela, we have an amazing question today about scandal. DUCKWORTH: Scandal? Like the um TV show? MAUGHAN: Not the show. Sorry, I know you got very excited about Kerry Washington here. “Hi NSQ*. Over the last few years, so many celebrities, leaders, politicians, and public figures have been ‘canceled’ for a range of things from ignorant and thoughtless to egregious and appalling behavior. Some of these people have been able to recover their reputation completely, while others appear to have had their image irreparably and permanently damaged. Why does society forgive or forget some of these behaviors, but not others? And is there a particular formula for successful recovery from a scandal? Best, Anonymous.”* DUCKWORTH: Mm, I love this question MAUGHAN: Here’s my take: they’re anonymous, so maybe this is like, “Hey guys” — DUCKWORTH: Oh, is this like, “I have a ‘friend’ who got canceled. Any advice for my ‘friend’?” MAUGHAN: Asking for a quote, “friend.” Okay so, one, I will just say that the data is clear on this — just anecdotally you would know this anyway — but the number of public apologies and cancellations, whatever, have become so vast that they’re just everywhere nowadays. DUCKWORTH: Wait, scandals are up or apologies are up? MAUGHAN: All of the above. Is there a scandal, or a public apology, or a cancellation that really sticks out to you in your mind? DUCKWORTH: Okay I actually have an answer to this, but it’s, it’s old. So, Monica Lewinsky and I were interns at the White House in the very same summer. MAUGHAN: What?! DUCKWORTH: Yes! That particular scandal is one that I had a front row seat to, in a sense. I only met Monica Lewinsky once during that summer at a party. And I do recall therefore paying even more attention than most people — I think most people were pretty glued to their screens — during the proceedings. But I have wondered, why is it that — well, many people have forgiven Clinton for that scandal. I guess some have not, but you’re exactly right. Sometimes these scandals unfold in ways that are like, oh, suddenly everybody’s embracing this person again and other times not. So, anyway, yes. That is my scandal story. MAUGHAN: That’s one of the ones that sticks out most to me. Now, partly it’s our age and where we were in our formative years. And I was, I think, in high school, and it was this massive media frenzy. But here’s what I think is interesting: it was so anomalous and rare back then that something like that stood out massively. DUCKWORTH: The scandal and the apology? Or just the scandal? MAUGHAN: Both. We now live in what — and I don’t remember who coined the phrase, but someone called the “Age of Apology.” There’s a professor of political science at the University of Houston, Brandon Rottinghaus, who talked about, like, how scandals don’t hit like they used to partly, he posits, because media and politics are so divided. When something comes out about X person did this or Y person did that, one, often people only get one side of the story. But two, we exercise justification so much that we are like, “Well our side can’t have done anything bad,” or we rationalize away instead of holding people to sort of the same standard regardless of which political affiliation they have. DUCKWORTH: I do actually think there’s a psychology of taboo, which is underlying why we consider some things a scandal versus, like, oh, a bad thing. MAUGHAN: Right. Okay. Say more about this. DUCKWORTH: So, every society has these unthinkable acts, these bright lines that you do not cross. Even, like, naming them is like — You know, they, they make you take a deep breath. And I think what you’re saying is that in a polarized society where there is less consensus about the moral right and wrong, even about taboos, which are usually consensual in a society, — I mean, that would suggest that, like, only half of the country is scandalized and the other half is like, “Meh.” MAUGHAN: Yeah. I think it’s kind of that, right? I, I think, one, fewer things are considered taboo in today’s day and age. DUCKWORTH: Like, period. MAUGHAN: Well, think about it. I mean, having a child out of wedlock you were ostracized, scarlet letter, all these things. DUCKWORTH: Right. Not being the dominant religion was also a taboo and would therefore lead to scandal. MAUGHAN: So, there’s so many things like that, but I’m not sure that it’s because different parties consider different things taboo. I think it’s that different parties will justify their own person’s behavior or scandalize someone else’s behavior, not using different standards of what’s bad, but just saying like, “Because you’re ‘other,’ this thing was terrible.” Or, “Because you’re of my same party, I’m going to justify your behavior.” And it’s like, “Oh, well, I can rationalize that,” or, “That’s the worst thing I’ve ever heard.” DUCKWORTH: You mean depending on their party affiliation, whether they’re Democrat or Republican. MAUGHAN: Yes. DUCKWORTH: So, you would predict that scandals would be perhaps on the rise if you’re like, “Yeah, I’m going to be scandalized by the thing that the other party is doing because I am so anti that party”? Is that what you’re saying? MAUGHAN: A hundred percent. One of the things that Rottinghaus, who I just talked about, that professor, also talks about is this idea of staff, basically. So, if you think about it, often the people who survive the scandal are in power versus the people who work for them. And I’ll never forget, there was a, a movie that came out when I was in grad school, and David Gergen — who’s famously counseled, I don’t know, seven, I think, different presidents — a very well-established White House advisor. He watched the movie with us, and then we had a Q&amp; A after, and it was a movie about — DUCKWORTH: Is he a Republican or a Democrat? MAUGHAN: He’s served presidents of both parties. And we watch this movie about campaigns. And in this movie, one of the staffers, for example, had had an affair with the candidate. She got pregnant. She is basically forced to have an abortion. There are all these people covering it up. Da da da. Afterwards, we have a Q&amp;A with David Gergen and several other people who’ve been high-ranking individuals on both Republican and Democratic presidential campaigns. And they’re like, “Look, I know many of you are going to go work in presidential politics. Be careful.” Staffers in a scandal are more likely to be sort of thrown off to the side. DUCKWORTH: So they’re saying, like, word to the wise: if you are the underling and you are involved in a scandal, in theory, you should be the one exonerated because you had less power, but, in fact, you are more likely to be the one not forgiven. MAUGHAN: You’re one that they’re going to try to use to cover themselves up, and you’re still the one who’s going to get tossed to the curb. DUCKWORTH: Now, this didn’t happen for Monica Lewinsky, right? Because I don’t think Monica Lewinsky was canceled. MAUGHAN: Oh, I think Monica was absolutely canceled. DUCKWORTH: You think so? She was, like, a kid! MAUGHAN: Monica Lewinsky basically went into hiding for a couple of decades. She is considered, in many ways, the first example of cyberbullying, because the internet was just at its dawn. She became the butt of every late-night joke. I mean, if you think about it, like you just said, she was in essence, just a kid who had had an affair with the most powerful person on the planet. DUCKWORTH: Right, if you want to make an argument about power dynamics, the President of the United States and then an intern. What could she have been? Early 20s at most? So, she was cyberbullied. Of course, maybe not by a majority of Americans, but by — MAUGHAN: Oh, I think the majority of Americans. DUCKWORTH: A majority of Americans thought she was in the wrong? MAUGHAN: Definitely held her accountable and cyberbullied her. Her name became synonymous with scandal. I think we in many ways ruined her life. In fact, I only met Monica Lewinsky once, and it was after she put out her TED Talk where she basically, I think 20-something years later said, “I am going to reclaim my story.” DUCKWORTH: No, I totally respect this. I’m just still a little open-jawed. I mean, the last time I saw Clinton on a television screen, you know, I was watching the Democratic National Convention and his extremely long speech. I would argue that Bill Clinton is not canceled today, otherwise they wouldn’t have him at the Democratic National Convention, correct? MAUGHAN: Well, I think that Bill Clinton was not canceled for a long time. Then the #MeToo movement came about and it re-shined a spotlight on his behavior. Obviously, he’s not canceled to the point where — he, as a former president, just spoke at the Democratic National Convention. There were a lot of news articles that came out, though, that basically say, “Hey, Democratic Party.” And these are from, you know, Democratic operatives or other less-biased sources, and they’re just kind of like, “It’s time to move on past Bill Clinton. His behavior was egregious in the past and we shouldn’t continue to have Bill Clinton be part of these events.” It’s — I don’t, I’m making up a term now, but almost like a “soft cancel.” Let’s kind of move on. And also, like, I just think we can’t talk about being canceled and — I don’t know what you call it — welcomed back into the fold, without also looking at sexism, racism, and privilege. I think there are a lot of stories about how different crimes are covered in the news, and it may be reported very differently if it’s a Black male from a low socioeconomic environment versus a white male from a place of privilege who’s attending maybe an elite university. Maybe we let certain people with privilege, whatever form that privilege takes — money, better looking, different family situation, et cetera — back into the fold differently. I don’t have data, but we have to acknowledge that in the world in which we live, when we let people back into the fold versus permanently excommunicate them, there are other factors that weigh in on that that are, are not right. DUCKWORTH: So, we might be more readily forgiving of people for reasons that have nothing to do with their guilt or innocence — that it’s not so simple, right? I guess regardless of whether scandals are up or down, you know, whether we’re, like, morally outraged more or less and why, I did hear about this, like, “Age of Apology” in an academic psychology paper. And this paper, actually, they say: what is the effect of the increasing number of apologies on how apologies are received? And I think maybe that is in a way the heart of this question for our dear listener, Anonymous. MAUGHAN: Right. Let me, if I could, just share a couple of apologies, and then maybe you can dive into the psychology. Ben Ho is a economics professor at Vassar and Karen Cerulo is at Rutgers University and is a cultural psychologist. So, Ben Ho in a 2018 Freakonomics Radio episode, one of our sibling shows, talked about how to optimize your apology and he focused mostly on this idea that an apology has to be costly to be effective. And he’s talked about two types of costs specifically. One is the status apology. He basically said you admit incompetence, you ask for forgiveness, and then in some sense, you make yourself look stupid. An example he gave is, “I’m sorry, that was completely idiotic.” If it’s done sincerely, then that has some real reputational cost. The other one he talked about was the commitment apology, which he posits can be even more powerful and it’s this commitment to do better in the future. So, the example there, “I messed up, I know what I did was wrong. Moving forward, you can hold me to a higher standard.” That one’s riskier because it backfires, obviously, if you don’t — DUCKWORTH: When you don’t follow through. MAUGHAN: Yes, hundred percent. So, now moving to Cerulo quickly — she did a study of 183 different apologies over a 13-year period, from 2000 to 2012. And she looked at only highly-visible apologies, and what I mean by that is every apology was covered in at least five or more distinct news outlets. All of them had public polling data attached to them. And she then looked at people’s reactions to determine whether an apology was effective or not. Some examples: Marion Jones was an Olympic athlete who was caught doping. Kevin Rudd was the Prime Minister of Australia. He apologized on behalf of the nation for removing Aboriginal children from homes and placing them with white families. And so, his was more an institutional apology. DUCKWORTH: That was historical probably, right? He was not directly responsible for that. MAUGHAN: He was, yeah, not around at all, but said, “Let’s finally make an apology for this.” So, my point is there’s this vast difference in all the public apologies that she looked at. And she said the most successful apologies followed a similar pattern — and the least effective ones. Most successful, you focus on the victim. So you start by talking about who is hurt, talk very little about yourself or any personal justifications, and then you end by talking about how sorry you are. If possible, you make restitutions. Now, I know this is a little obvious, but she says that in all of her research, she was surprised at how few people could make an effective apology and said that of all of these she studied over this decade-plus period, less than a third of public apologies were effective with the public based on poll data. DUCKWORTH: Meaning, I think, that, like, we don’t forgive those people. So, maybe if you want to say, what does it mean to be canceled? I mean, there’s no, like, dictionary definition, I think, that you could be like, “Oh, that’s what it means to be canceled.” But I think there’s an absence of forgiveness, like, you are not forgiven. And so, these are ways that you can be forgiven and welcomed back into the fold, these two research studies. MAUGHAN: Yes, and these focus more specifically on apologies that led to forgiveness. DUCKWORTH: But only one out of three did in that last study that you mentioned. Okay, so the things that she said is, like, you have to focus on the person who was wronged, not on yourself. And then you have to sincerely and abjectly admit wrongdoing. MAUGHAN: Right, I mean she even goes so far as to use the word at one point, “mortification,” and defines it as “the unequivocal expression of shame, guilt, or remorse.” I mean, you have to express that you are mortified by what you did. So her advice is, is very simply: don’t wait. So, forget your ego, forget everything else, apologize immediately. Don’t apologize for what people thought; apologize for what you did. So, too many people come out and say, like, “I’m sorry that people misunderstood me.” “I’m sorry people misinterpreted that.” DUCKWORTH: Right, or, “I’m sorry that you feel that way.” The classic, “I’m sorry that you’re so upset.” You’re like, “Oh my god, I want to kill you.” MAUGHAN: Turns out that doesn’t work. DUCKWORTH: Turns out that just puts kerosene on the fire. MAUGHAN: So don’t wait, and then apologize for what you did, not what people thought. Don’t give context. I thought that was interesting. It totally makes sense to me. She said, “People don’t care why you did it. Why you did it is less important than just expressing regret and remorse.” We don’t need context. We just need to say, “Hey, I’m so sorry. What I did was wrong.” So, when it comes to Bill Clinton’s apology, Cerulo she said the number one issue with his apology was one, it took so long to be made and then it was made so many times because he did such a bad job, but eventually, he got to the National Prayer Service where he was doing an apology there and she and others say that that is the most effective one when he actually showed sorrow that looked genuine and actually even named Lewinsky, apologizing to her and for what he’d actually done. And I think Angela and I would love to hear your thoughts on what it takes to successfully recover from a scandal. So, record a voice memo in a quiet place with your mouth close to the phone and email it to us at &#78;&#x53;&#x51;&#x40;&#102;&#x72;&#x65;&#97;&#107;&#x6f;&#110;&#111;&#109;&#x69;&#x63;&#115;&#x2e;&#x63;&#111;&#109; and maybe we’ll play it on a future episode of the show. You can also spread the word on social media or leave a review in your podcast app. DUCKWORTH: So, you know, forgiveness is its own mystery, covered in enigma, you know, swirling in the unknown. But if you just assume that there is such a thing as being forgiven, and we do sometimes do it, the question of like when we’re forgive— I mean, I think most people are not going to experience being canceled, but I think all of us will do something at some point where we wish to be forgiven. You know, this professor of economics at Vassar you mentioned, Ben Ho, I was like, why do I know that name? He was a co-author on the paper that was on Uber and on apologies. MAUGHAN: Yes, yes! DUCKWORTH: And I know Stephen Dubner and I’ve talked about this but I’ll just recap it, because it’s so clever. It was published in 2021. But the origin story is that John List, who was I think the chief economist for Uber at the time. And Uber had chief economists so that they could do really clever experiments that would help them have a better app. And John, one day, orders an Uber and it doesn’t come, and he’s really pissed off and he decides to study what happens when you’re a customer of this app and you’re just so angry because it failed you. And the operative question was like, is there anything Uber can do to make it up for you? Can they repair this ruptured relationship? So, when a rider on Uber had a trip that was in the bottom 5 percent of time of arrival for your particular geographic region, then you were then randomly assigned to different apology conditions. Some people would get an email that would say, like, “Here’s a $5 gift card to your next ride.” The basic apology was like, “Oh no, your trip took longer than we estimated.” There was a status apology, like, language like, you know, “We know our estimate was off.” So, sort of taking some responsibility. And there was a commitment apology, by the way, like, “We’re working hard to give you arrival times that you can count on.” And one of the major findings was, quote, “Money speaks louder than words.” I think when you said an apology should be costly, to quote the paper, “The best form of apology is to include a coupon for a future trip.” But applying it personally — MAUGHAN: Sorry, I just have this image of like, “Hey, I’m so sorry for something egregious.” And I’m like, “Here’s $20.” In a personal view, it sort of cheapens the apology, but I totally get it from a corporate standpoint. DUCKWORTH: Yes, I don’t think you really want to, like, Venmo people directly after having, like, a blowout fight with your best friend or something. But the larger point is the costliness. I think actually, just to speculate, why it is that that rings true to us or that moves us more is maybe that we have a little bit of an “eye for an eye.” You know, maybe it’s part of human nature to say, like, “You hurt me. It’s only right that you get hurt.” MAUGHAN: There’s a silly Modern Family episode that I love where — DUCKWORTH: I love Modern Family*! They’re all silly, and they’re all amazing.* MAUGHAN: But there’s one where Gloria, who is this beautiful Colombian young-ish woman who married Jay, you know, the grandpa. And she’s basically the same age as Jay’s daughter. So, the stepmom and the daughter are basically the same age, and the stepdaughter, who’s Claire had at one point called Gloria a “gold digger.” And that comes out at a family dinner, and Gloria is upset and she said, “What do I need to do to prove to you all that I really just love your dad? I’m not in it for the money.” And she’s like, “Here, take the bracelets back, take the earrings, take the whatever.” And Claire comes up to the, the room and apologizes to Gloria and says, “Hey, I’m really sorry. I shouldn’t have said that. When you first started dating my dad — I mean, look at you, look at him. You’ll understand why I had some concerns. What can I do to get your forgiveness?” And interestingly, in this “restitution” sense, Gloria says, “I want you to go jump in the swimming pool with all your clothes on.” DUCKWORTH: Is that what she says? I don’t remember this. Okay. So, then what happens? MAUGHAN: The family goes outside and Claire is standing at the edge of the pool. And she’s like, “Wait, are you really going to make me get in? Like, I’ve shown I’m willing —” DUCKWORTH: And you have to know Claire is, like, the uptight person who would not jump into the pool with her clothes on. MAUGHAN: So she says, “Are you really going to make me do this? I’m standing at the edge of the pool. I’m showing you that I’m willing to jump in.” And Gloria just looks at her and says, “Yes. You have to jump in.” So, Claire jumps in with all her clothes on. And then next Jay, the older gentleman, pushes Gloria into the pool. And then the whole family jumps in. And this idea of restitution, while it wasn’t monetary, there was some cost that she had to pay, but it also turned into this joyful act of forgiveness where it was this memorable moment where the whole family is in the pool with all their clothes on — DUCKWORTH: Okay, I’m going to go, like, way out on a limb and now interpret that episode of Modern Family as if it were a parable from the Bible, okay? So, like, if Claire were, like, dunked into the water, right, and then everybody’s, like, sort of laughing at her, that would not have been a good ending. But then what they showed is that she was truly welcomed back into the fold. Such is the brilliance of Modern Family. Yes, there’s a costly apology, but it then follows with true forgiveness and like, true acceptance. MAUGHAN: Versus a public shaming. DUCKWORTH: And I think what this research is showing is that there is some instinct we have that there has to be a true cost to the person who was the transgressor — maybe it’s because we have some base instinct for an eye for an eye. We’re like, you have to jump into the pool and, like, be slightly humiliated in the way that you made me feel humiliated when you called me a “gold digger.” MAUGHAN: Which by way, I don’t think those were equal offenses. I think “gold digger” is much more offensive than making someone jump in a pool. But, they had negotiated this, and I love how you said it was not a public shaming where everyone then ridicules Claire. DUCKWORTH: Yeah, it’s actually also not an “eye an eye.” By the way, a $5 coupon is not the same thing as, like, “Okay, now I’m going to make you five minutes late.” You know, “I’m going to make you miss a flight,” right? So, it’s not exactly that, but I still think it has this, like, base note of, like, restitution or symmetry. But then, I think for there to be — because you said this, I think, about Ben Ho’s research. Like, what makes an apology effective is not only that you can see that this costs me, but also this commitment that you have to follow through on in the future. I’m also thinking about other research on body language of apologies. There was an article in Journal of Personality and Social Psychology about embodied remorse. And it’s about when you make a public apology, whether you include a physical display of remorse or you don’t. So, the two physical displays of remorse, one is getting down on your knees. MAUGHAN: Oh, come on. DUCKWORTH: I’m not kidding. MAUGHAN: No, I believe you. But like, that doesn’t have a place in public apologies. DUCKWORTH: You’re like, when has that happened? MAUGHAN: And also, like, if anyone got on their knees to apologize, that’s so dramatic, it just feels not useful. DUCKWORTH: You’d be like, oh, it must be insincere because it’s so melodramatic, almost. MAUGHAN: Yeah. I’m, I’m really interested to hear more about this but I call immediate B.S. Like, who’s going to get down on their knees and apologize? DUCKWORTH: In the paper that I’m talking about, there were descriptions of an actual historical event. Do you know about the Tokyo Electric Power Company and the nuclear disaster? MAUGHAN: I think there was one about 10 years ago. I don’t remember anything about an apology. I do remember that there were these elderly Japanese men who worked there who basically said, “To go fix this, we’re going to go in, because we’ve lived good lives, and we’re going to make sure that younger people don’t have to be exposed.” And it was this beautiful example of self-sacrifice in order to kind of bless generations. That’s what I remember, which has nothing to do with apologies or scandal. DUCKWORTH: I mean, I’ll say that in this experiment, you’re just a volunteer, right? Now, time has passed. But you’re told about this, you’re given factual information about what the disaster was, and then also, you know, the public statement that was made. You know, there was a, an image. And it says, you know, when you’re looking at these materials, like, “The picture below is a still, a still photo, from the press conference.” And then, there’s two conditions. In one condition, the representatives of the company are sitting at a desk in front of microphones, but in another condition, in the treatment condition — in the “embodiment” condition, they would say — in that condition, the representatives are away from their desks, kneeling with their palms pressed to the floor. So, these are both true photos, it’s just that they’re taken at different times. But, the embodiment condition — I don’t think American executives would do this. MAUGHAN: That’s what I was going to say. I wonder culturally if there’s a very different sense of that. DUCKWORTH: Yeah, no, you’re not going to get anybody in, like, American culture to, like — it just, it’s not in our vernacular, right? Like, we don’t do this. So, it would be so odd. But they did have other studies where, instead of kneeling, there was, like, crying. So, there have been actual public apologies where the transgressor seemingly spontaneously — one could get more cynical than that — but they’re crying as they issue their apology. And either way, crying and kneeling are nonverbal. MAUGHAN: Crying I buy, by the way. Like, I’ll be susceptible to that. DUCKWORTH: You might even buy kneeling just within that cultural context, right? MAUGHAN: Exactly. And that, I want to acknowledge. Mine was an ethnocentric reaction to that. DUCKWORTH: So, this embodiment — right, so seeing pictures of people like physically, either with crying or with kneeling, you know, showing their remorse — it actually did increase the viewer’s ratings of, like, how much you think this person does have remorse. In other research, I have generally found that, you know, sometimes it’s easy in the world of texting and email to miss the importance of nonverbal cues. This is one reason I think people will always need to have some face-to-face contact to have truly meaningful relationships. By the way, if you’re going to apologize to someone, I’m going to go out on a limb and say, don’t do it by text. Don’t DM the person. Because these nonverbal cues and also tone of voice in other research that I’ve done is, like, so important. You, you don’t get that in a text message. But the take-home of this multi-study investigation is that it does matter for how much people think you’re sorry. MAUGHAN: You’re saying “it” being body language. DUCKWORTH: Yeah, this kind of embodiment. It also matters for being perceived positively. So, the transgressor, we have more empathy for them, et cetera. But one of the interesting things about this research is that this embodied remorse did not have any significant effect on being forgiven in, actually, any of the studies. MAUGHAN: So, I just think it’s more sincere, but I’m not more likely to forgive you. DUCKWORTH: And this is why forgiveness is so interesting to me. Like, what is it to be forgiven? Because we can know that you’re sincere — and I’ve experienced this too. So, you know, I’ve shared with you before that Jason and I rarely have arguments, but when I get mad, I mean, I really — you’ve never seen it, but I get really, really, really mad. And I have wondered to myself, why is it that if Jason is sincerely sorry, I can see that he’s sincerely sorry, and yet I still don’t forgive him. Like, what is that? I don’t know, it’s something which is still beyond my understanding as a psychologist. I mean, I have to bring up: so my therapist, Dee, has given me this expression that has been so useful — and again, I have more interest in private apologies than public apologies. I mean, I hope I don’t have to ever make a public apology, but I think the dynamics are the same. So, Dee says that all relationships are such that there is going to be rupture and repair. And what she means by this is that any relationship — including ours, Mike, right? Like, that there will be a time where trust is ruptured, where understanding is ruptured. And then, they’re repaired. So, I think to me, the art of apologizing is about, you know, repairing that which has been ruptured, and I think these pro tips are great, you know, don’t wait, be sincere, don’t talk about extenuating circumstances, own it, commit. But for me, that phrase, “rupture and repair,” has been like a guiding light, because it also tells me that it’s normal. Maybe scandals are not normal, but like, you should expect friendships to be ruptured, and then you should expect them to be repaired. The thing that I’ve always been raised with is, like, forgiveness is always the right thing to do. So, if you have been either a victim or a bystander, like, the morally higher road is to forgive — maybe not to forget, but to forgive and to repair. MAUGHAN: I will say, I’m with you 100 percent on a personal level. I know that I am human, and I know that I make mistakes all the time — hopefully not of the egregious variety. Like you, I hope there’s never a public apology. DUCKWORTH: Hopefully, not at scandal-level. MAUGHAN: Right. But yes, I think that we all have occasion to apologize every day. I will say that I hope I am very forgiving to others because I want people to be forgiving to us. And I wonder — again, maybe in the societal framework of scandal and being canceled — I wonder if part of it is for some people we cancel them because their behavior is so obviously and systemically bad that we view that as a reflection of their character versus there are some individuals who committed an act. DUCKWORTH: It was a terrible action, but they’re not a terrible person. MAUGHAN: Right. And so we can put in context — Harvey Weinstein had perpetual, abusive, horrific actions against so many women over so many years that we have the context to say, “You’re not welcome back.” Whereas an individual who made a mistake, I hope we also have, as individuals and society, the willingness to say, “I’m not going to judge you by your worst day.” I hope people would grant that same grace or forgiveness to me. DUCKWORTH: I mean, I think the thing that you’re saying is that there is no formula for successful recovery if this is like a deeply motivated, persistent character flaw. And if it isn’t, then there are these, like, tactical things. Like, if you really just screwed up, but you’re basically well intentioned, then apologize immediately and do it with body language and have a little skin in the game and commit to doing differently and follow through on that commitment. But if on the other hand you are Harvey Weinstein, we don’t have a recipe for you. MAUGHAN: Yeah. I’m so sorry.","categories":[{"name":"No Stupid Questions","slug":"No-Stupid-Questions","permalink":"http://example.com/categories/No-Stupid-Questions/"}],"tags":[{"name":"No Stupid Questions","slug":"No-Stupid-Questions","permalink":"http://example.com/tags/No-Stupid-Questions/"}]}],"categories":[{"name":"English","slug":"English","permalink":"http://example.com/categories/English/"},{"name":"leetcode","slug":"leetcode","permalink":"http://example.com/categories/leetcode/"},{"name":"java","slug":"java","permalink":"http://example.com/categories/java/"},{"name":"No Stupid Questions","slug":"No-Stupid-Questions","permalink":"http://example.com/categories/No-Stupid-Questions/"}],"tags":[{"name":"English learning","slug":"English-learning","permalink":"http://example.com/tags/English-learning/"},{"name":"leetcode","slug":"leetcode","permalink":"http://example.com/tags/leetcode/"},{"name":"java","slug":"java","permalink":"http://example.com/tags/java/"},{"name":"interview","slug":"interview","permalink":"http://example.com/tags/interview/"},{"name":"en","slug":"en","permalink":"http://example.com/tags/en/"},{"name":"No Stupid Questions","slug":"No-Stupid-Questions","permalink":"http://example.com/tags/No-Stupid-Questions/"}]}